/* automatically generated by rust-bindgen */

#[allow(non_snake_case, non_camel_case_types, non_upper_case_globals)]
pub mod root {
    #[allow(unused_imports)]
    use self::super::root;
    pub mod std {
        #[allow(unused_imports)]
        use self::super::super::root;
        #[repr(C)]
        #[derive(Debug)]
        pub struct allocator {
            pub _address: u8,
        }
        pub type allocator_size_type = usize;
        pub type allocator_difference_type = isize;
        pub type allocator_pointer<_Tp> = *mut _Tp;
        pub type allocator_const_pointer<_Tp> = *mut _Tp;
        pub type allocator_reference<_Tp> = *mut _Tp;
        pub type allocator_const_reference<_Tp> = *mut _Tp;
        pub type allocator_value_type<_Tp> = _Tp;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct allocator_rebind {
            pub _address: u8,
        }
        pub type allocator_rebind_other = root::std::allocator;
        pub type allocator_propagate_on_container_move_assignment =
            root::std::true_type;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct char_traits {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug)]
        pub struct basic_string<_CharT, _Alloc> {
            pub _M_dataplus: root::std::basic_string__Alloc_hider<_CharT,
                                                                  _Alloc>,
        }

        pub type basic_string_allocator_type<_Alloc> = _Alloc;
        pub type basic_string_size_type = [u8; 0usize];
        pub type basic_string_difference_type = [u8; 0usize];
        pub type basic_string_reference = [u8; 0usize];
        pub type basic_string_const_reference = [u8; 0usize];
        pub type basic_string_pointer = [u8; 0usize];
        pub type basic_string_const_pointer = [u8; 0usize];
        pub type basic_string_iterator =
            root::__gnu_cxx::__normal_iterator<root::std::basic_string_pointer>;
        pub type basic_string_const_iterator =
            root::__gnu_cxx::__normal_iterator<root::std::basic_string_const_pointer>;
        pub type basic_string_const_reverse_iterator =
            root::std::reverse_iterator<root::std::basic_string_const_iterator>;
        pub type basic_string_reverse_iterator =
            root::std::reverse_iterator<root::std::basic_string_iterator>;
        #[repr(C)]
        pub struct basic_string__Rep_base {
            pub _M_length: root::std::basic_string_size_type,
            pub _M_capacity: root::std::basic_string_size_type,
            pub _M_refcount: root::std::_Atomic_word,
        }
        #[repr(C)]
        pub struct basic_string__Rep {
            pub _base: root::std::basic_string__Rep_base,
        }
        pub type basic_string__Rep__Raw_bytes_alloc = [u8; 0usize];
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct basic_string__Alloc_hider<_CharT, _Alloc> {
            pub _base: _Alloc,
            pub _M_p: *mut _CharT,
        }
        #[test]
        fn __bindgen_test_layout_char_traits_instantiation_15707() {
            assert_eq!(::std::mem::size_of::<root::std::char_traits>() ,
                       1usize , concat ! (
                       "Size of template specialization: " , stringify ! (
                       root::std::char_traits ) ));
            assert_eq!(::std::mem::align_of::<root::std::char_traits>() ,
                       1usize , concat ! (
                       "Alignment of template specialization: " , stringify !
                       ( root::std::char_traits ) ));
        }
        pub type string =
            root::std::basic_string<::std::os::raw::c_char,
                                    root::std::allocator>;
        pub type true_type = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __and_ {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct pair<_T1, _T2> {
            pub first: _T1,
            pub second: _T2,
        }
        pub type pair_first_type<_T1> = _T1;
        pub type pair_second_type<_T2> = _T2;
        #[repr(C)]
        #[derive(Debug, Copy)]
        pub struct input_iterator_tag {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_input_iterator_tag() {
            assert_eq!(::std::mem::size_of::<input_iterator_tag>() , 1usize ,
                       concat ! (
                       "Size of: " , stringify ! ( input_iterator_tag ) ));
            assert_eq! (::std::mem::align_of::<input_iterator_tag>() , 1usize
                        , concat ! (
                        "Alignment of " , stringify ! ( input_iterator_tag )
                        ));
        }
        impl Clone for input_iterator_tag {
            fn clone(&self) -> Self { *self }
        }
        #[repr(C)]
        #[derive(Debug, Copy)]
        pub struct output_iterator_tag {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_output_iterator_tag() {
            assert_eq!(::std::mem::size_of::<output_iterator_tag>() , 1usize ,
                       concat ! (
                       "Size of: " , stringify ! ( output_iterator_tag ) ));
            assert_eq! (::std::mem::align_of::<output_iterator_tag>() , 1usize
                        , concat ! (
                        "Alignment of " , stringify ! ( output_iterator_tag )
                        ));
        }
        impl Clone for output_iterator_tag {
            fn clone(&self) -> Self { *self }
        }
        #[repr(C)]
        #[derive(Debug, Copy)]
        pub struct forward_iterator_tag {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_forward_iterator_tag() {
            assert_eq!(::std::mem::size_of::<forward_iterator_tag>() , 1usize
                       , concat ! (
                       "Size of: " , stringify ! ( forward_iterator_tag ) ));
            assert_eq! (::std::mem::align_of::<forward_iterator_tag>() ,
                        1usize , concat ! (
                        "Alignment of " , stringify ! ( forward_iterator_tag )
                        ));
        }
        impl Clone for forward_iterator_tag {
            fn clone(&self) -> Self { *self }
        }
        #[repr(C)]
        #[derive(Debug, Copy)]
        pub struct bidirectional_iterator_tag {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_bidirectional_iterator_tag() {
            assert_eq!(::std::mem::size_of::<bidirectional_iterator_tag>() ,
                       1usize , concat ! (
                       "Size of: " , stringify ! ( bidirectional_iterator_tag
                       ) ));
            assert_eq! (::std::mem::align_of::<bidirectional_iterator_tag>() ,
                        1usize , concat ! (
                        "Alignment of " , stringify ! (
                        bidirectional_iterator_tag ) ));
        }
        impl Clone for bidirectional_iterator_tag {
            fn clone(&self) -> Self { *self }
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct iterator {
            pub _address: u8,
        }
        pub type iterator_iterator_category<_Category> = _Category;
        pub type iterator_value_type<_Tp> = _Tp;
        pub type iterator_difference_type<_Distance> = _Distance;
        pub type iterator_pointer<_Pointer> = _Pointer;
        pub type iterator_reference<_Reference> = _Reference;
        #[repr(C)]
        pub struct iterator_traits {
            pub _address: u8,
        }
        #[repr(C)]
        pub struct reverse_iterator<_Iterator> {
            pub current: _Iterator,
        }
        pub type reverse_iterator___traits_type = root::std::iterator_traits;
        pub type reverse_iterator_iterator_type<_Iterator> = _Iterator;
        pub type reverse_iterator_difference_type =
            root::std::reverse_iterator___traits_type;
        pub type reverse_iterator_pointer =
            root::std::reverse_iterator___traits_type;
        pub type reverse_iterator_reference =
            root::std::reverse_iterator___traits_type;
        #[repr(C)]
        pub struct istreambuf_iterator<_CharT> {
            pub _M_sbuf: *mut root::std::istreambuf_iterator_streambuf_type<_CharT>,
            pub _M_c: root::std::istreambuf_iterator_int_type,
        }
        pub type istreambuf_iterator_char_type<_CharT> = _CharT;
        pub type istreambuf_iterator_traits_type<_Traits> = _Traits;
        pub type istreambuf_iterator_int_type = [u8; 0usize];
        pub type istreambuf_iterator_streambuf_type<_CharT> =
            root::std::basic_streambuf<_CharT>;
        pub type istreambuf_iterator_istream_type<_CharT> =
            root::std::basic_istream<_CharT>;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct ostreambuf_iterator<_CharT> {
            pub _M_sbuf: *mut root::std::ostreambuf_iterator_streambuf_type<_CharT>,
            pub _M_failed: bool,
        }
        pub type ostreambuf_iterator_char_type<_CharT> = _CharT;
        pub type ostreambuf_iterator_traits_type<_Traits> = _Traits;
        pub type ostreambuf_iterator_streambuf_type<_CharT> =
            root::std::basic_streambuf<_CharT>;
        pub type ostreambuf_iterator_ostream_type<_CharT> =
            root::std::basic_ostream<_CharT>;
        pub type streamoff = ::std::os::raw::c_longlong;
        pub type streamsize = isize;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct fpos<_StateT> {
            pub _M_off: root::std::streamoff,
            pub _M_state: _StateT,
        }
        pub type streampos = root::std::fpos<::std::os::raw::c_int>;
        #[repr(C)]
        pub struct exception__bindgen_vtable(::std::os::raw::c_void);
        #[repr(C)]
        #[derive(Debug)]
        pub struct exception {
            pub vtable_: *const exception__bindgen_vtable,
        }
        #[test]
        fn bindgen_test_layout_exception() {
            assert_eq!(::std::mem::size_of::<exception>() , 8usize , concat !
                       ( "Size of: " , stringify ! ( exception ) ));
            assert_eq! (::std::mem::align_of::<exception>() , 8usize , concat
                        ! ( "Alignment of " , stringify ! ( exception ) ));
        }
        pub type __allocator_base = root::__gnu_cxx::new_allocator;
        #[test]
        fn __bindgen_test_layout_allocator_instantiation_20294() {
            assert_eq!(::std::mem::size_of::<root::std::allocator>() , 1usize
                       , concat ! (
                       "Size of template specialization: " , stringify ! (
                       root::std::allocator ) ));
            assert_eq!(::std::mem::align_of::<root::std::allocator>() , 1usize
                       , concat ! (
                       "Alignment of template specialization: " , stringify !
                       ( root::std::allocator ) ));
        }
        pub type __c_locale = *mut ::std::os::raw::c_int;
        pub type _Atomic_word = ::std::os::raw::c_int;
        #[repr(C)]
        pub struct ios_base__bindgen_vtable(::std::os::raw::c_void);
        #[repr(C)]
        #[derive(Debug)]
        pub struct ios_base {
            pub vtable_: *const ios_base__bindgen_vtable,
            pub _M_precision: root::std::streamsize,
            pub _M_width: root::std::streamsize,
            pub _M_flags: root::std::ios_base_fmtflags,
            pub _M_exception: root::std::ios_base_iostate,
            pub _M_streambuf_state: root::std::ios_base_iostate,
            pub _M_callbacks: *mut root::std::ios_base__Callback_list,
            pub _M_word_zero: root::std::ios_base__Words,
            pub _M_local_word: [root::std::ios_base__Words; 8usize],
            pub _M_word_size: ::std::os::raw::c_int,
            pub _M_word: *mut root::std::ios_base__Words,
            pub _M_ios_locale: root::std::locale,
        }
        #[repr(C)]
        #[derive(Debug)]
        pub struct ios_base_failure {
            pub _base: root::std::exception,
            pub _M_msg: root::std::string,
        }
        #[test]
        fn bindgen_test_layout_ios_base_failure() {
            assert_eq!(::std::mem::size_of::<ios_base_failure>() , 16usize ,
                       concat ! (
                       "Size of: " , stringify ! ( ios_base_failure ) ));
            assert_eq! (::std::mem::align_of::<ios_base_failure>() , 8usize ,
                        concat ! (
                        "Alignment of " , stringify ! ( ios_base_failure ) ));
            assert_eq! (unsafe {
                        & ( * ( 0 as * const ios_base_failure ) ) . _M_msg as
                        * const _ as usize } , 8usize , concat ! (
                        "Alignment of field: " , stringify ! (
                        ios_base_failure ) , "::" , stringify ! ( _M_msg ) ));
        }
        extern "C" {
            #[link_name = "_ZNSt8ios_base7failureC1ERKSs"]
            pub fn ios_base_failure_failure(this:
                                                *mut root::std::ios_base_failure,
                                            __str: *const root::std::string);
        }
        impl ios_base_failure {
            #[inline]
            pub unsafe fn new(__str: *const root::std::string) -> Self {
                let mut __bindgen_tmp = ::std::mem::uninitialized();
                ios_base_failure_failure(&mut __bindgen_tmp, __str);
                __bindgen_tmp
            }
        }
        pub use self::super::super::root::std::_Ios_Fmtflags as
                ios_base_fmtflags;
        pub use self::super::super::root::std::_Ios_Iostate as
                ios_base_iostate;
        pub use self::super::super::root::std::_Ios_Openmode as
                ios_base_openmode;
        pub use self::super::super::root::std::_Ios_Seekdir as
                ios_base_seekdir;
        pub type ios_base_io_state = ::std::os::raw::c_int;
        pub type ios_base_open_mode = ::std::os::raw::c_int;
        pub type ios_base_seek_dir = ::std::os::raw::c_int;
        pub type ios_base_streampos = root::std::streampos;
        pub type ios_base_streamoff = root::std::streamoff;
        #[repr(u32)]
        #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
        pub enum ios_base_event {
            erase_event = 0,
            imbue_event = 1,
            copyfmt_event = 2,
        }
        pub type ios_base_event_callback =
            ::std::option::Option<unsafe extern "C" fn(__e:
                                                           root::std::ios_base_event,
                                                       __b:
                                                           *mut root::std::ios_base,
                                                       __i:
                                                           ::std::os::raw::c_int)>;
        #[repr(C)]
        #[derive(Debug, Copy)]
        pub struct ios_base__Callback_list {
            pub _M_next: *mut root::std::ios_base__Callback_list,
            pub _M_fn: root::std::ios_base_event_callback,
            pub _M_index: ::std::os::raw::c_int,
            pub _M_refcount: root::std::_Atomic_word,
        }
        #[test]
        fn bindgen_test_layout_ios_base__Callback_list() {
            assert_eq!(::std::mem::size_of::<ios_base__Callback_list>() ,
                       24usize , concat ! (
                       "Size of: " , stringify ! ( ios_base__Callback_list )
                       ));
            assert_eq! (::std::mem::align_of::<ios_base__Callback_list>() ,
                        8usize , concat ! (
                        "Alignment of " , stringify ! (
                        ios_base__Callback_list ) ));
            assert_eq! (unsafe {
                        & ( * ( 0 as * const ios_base__Callback_list ) ) .
                        _M_next as * const _ as usize } , 0usize , concat ! (
                        "Alignment of field: " , stringify ! (
                        ios_base__Callback_list ) , "::" , stringify ! (
                        _M_next ) ));
            assert_eq! (unsafe {
                        & ( * ( 0 as * const ios_base__Callback_list ) ) .
                        _M_fn as * const _ as usize } , 8usize , concat ! (
                        "Alignment of field: " , stringify ! (
                        ios_base__Callback_list ) , "::" , stringify ! ( _M_fn
                        ) ));
            assert_eq! (unsafe {
                        & ( * ( 0 as * const ios_base__Callback_list ) ) .
                        _M_index as * const _ as usize } , 16usize , concat !
                        (
                        "Alignment of field: " , stringify ! (
                        ios_base__Callback_list ) , "::" , stringify ! (
                        _M_index ) ));
            assert_eq! (unsafe {
                        & ( * ( 0 as * const ios_base__Callback_list ) ) .
                        _M_refcount as * const _ as usize } , 20usize , concat
                        ! (
                        "Alignment of field: " , stringify ! (
                        ios_base__Callback_list ) , "::" , stringify ! (
                        _M_refcount ) ));
        }
        impl Clone for ios_base__Callback_list {
            fn clone(&self) -> Self { *self }
        }
        #[repr(C)]
        #[derive(Debug, Copy)]
        pub struct ios_base__Words {
            pub _M_pword: *mut ::std::os::raw::c_void,
            pub _M_iword: ::std::os::raw::c_long,
        }
        #[test]
        fn bindgen_test_layout_ios_base__Words() {
            assert_eq!(::std::mem::size_of::<ios_base__Words>() , 16usize ,
                       concat ! (
                       "Size of: " , stringify ! ( ios_base__Words ) ));
            assert_eq! (::std::mem::align_of::<ios_base__Words>() , 8usize ,
                        concat ! (
                        "Alignment of " , stringify ! ( ios_base__Words ) ));
            assert_eq! (unsafe {
                        & ( * ( 0 as * const ios_base__Words ) ) . _M_pword as
                        * const _ as usize } , 0usize , concat ! (
                        "Alignment of field: " , stringify ! ( ios_base__Words
                        ) , "::" , stringify ! ( _M_pword ) ));
            assert_eq! (unsafe {
                        & ( * ( 0 as * const ios_base__Words ) ) . _M_iword as
                        * const _ as usize } , 8usize , concat ! (
                        "Alignment of field: " , stringify ! ( ios_base__Words
                        ) , "::" , stringify ! ( _M_iword ) ));
        }
        impl Clone for ios_base__Words {
            fn clone(&self) -> Self { *self }
        }
        pub const ios_base__S_local_word_size:
                  root::std::ios_base__bindgen_ty_1 =
            ios_base__bindgen_ty_1::_S_local_word_size;
        #[repr(u32)]
        #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
        pub enum ios_base__bindgen_ty_1 { _S_local_word_size = 8, }
        #[repr(C)]
        #[derive(Debug)]
        pub struct ios_base_Init {
            pub _address: u8,
        }
        extern "C" {
            #[link_name = "_ZNSt8ios_base4Init11_S_refcountE"]
            pub static mut ios_base_Init__S_refcount: root::std::_Atomic_word;
        }
        extern "C" {
            #[link_name = "_ZNSt8ios_base4Init20_S_synced_with_stdioE"]
            pub static mut ios_base_Init__S_synced_with_stdio: bool;
        }
        #[test]
        fn bindgen_test_layout_ios_base_Init() {
            assert_eq!(::std::mem::size_of::<ios_base_Init>() , 1usize ,
                       concat ! ( "Size of: " , stringify ! ( ios_base_Init )
                       ));
            assert_eq! (::std::mem::align_of::<ios_base_Init>() , 1usize ,
                        concat ! (
                        "Alignment of " , stringify ! ( ios_base_Init ) ));
        }
        extern "C" {
            #[link_name = "_ZNSt8ios_base4InitC1Ev"]
            pub fn ios_base_Init_Init(this: *mut root::std::ios_base_Init);
        }
        extern "C" {
            #[link_name = "_ZNSt8ios_base4InitD1Ev"]
            pub fn ios_base_Init_Init_destructor(this:
                                                     *mut root::std::ios_base_Init);
        }
        impl ios_base_Init {
            #[inline]
            pub unsafe fn new() -> Self {
                let mut __bindgen_tmp = ::std::mem::uninitialized();
                ios_base_Init_Init(&mut __bindgen_tmp);
                __bindgen_tmp
            }
            #[inline]
            pub unsafe fn destruct(&mut self) {
                ios_base_Init_Init_destructor(self)
            }
        }
        extern "C" {
            #[link_name = "_ZNSt8ios_base9boolalphaE"]
            pub static ios_base_boolalpha: root::std::ios_base_fmtflags;
        }
        extern "C" {
            #[link_name = "_ZNSt8ios_base3decE"]
            pub static ios_base_dec: root::std::ios_base_fmtflags;
        }
        extern "C" {
            #[link_name = "_ZNSt8ios_base5fixedE"]
            pub static ios_base_fixed: root::std::ios_base_fmtflags;
        }
        extern "C" {
            #[link_name = "_ZNSt8ios_base3hexE"]
            pub static ios_base_hex: root::std::ios_base_fmtflags;
        }
        extern "C" {
            #[link_name = "_ZNSt8ios_base8internalE"]
            pub static ios_base_internal: root::std::ios_base_fmtflags;
        }
        extern "C" {
            #[link_name = "_ZNSt8ios_base4leftE"]
            pub static ios_base_left: root::std::ios_base_fmtflags;
        }
        extern "C" {
            #[link_name = "_ZNSt8ios_base3octE"]
            pub static ios_base_oct: root::std::ios_base_fmtflags;
        }
        extern "C" {
            #[link_name = "_ZNSt8ios_base5rightE"]
            pub static ios_base_right: root::std::ios_base_fmtflags;
        }
        extern "C" {
            #[link_name = "_ZNSt8ios_base10scientificE"]
            pub static ios_base_scientific: root::std::ios_base_fmtflags;
        }
        extern "C" {
            #[link_name = "_ZNSt8ios_base8showbaseE"]
            pub static ios_base_showbase: root::std::ios_base_fmtflags;
        }
        extern "C" {
            #[link_name = "_ZNSt8ios_base9showpointE"]
            pub static ios_base_showpoint: root::std::ios_base_fmtflags;
        }
        extern "C" {
            #[link_name = "_ZNSt8ios_base7showposE"]
            pub static ios_base_showpos: root::std::ios_base_fmtflags;
        }
        extern "C" {
            #[link_name = "_ZNSt8ios_base6skipwsE"]
            pub static ios_base_skipws: root::std::ios_base_fmtflags;
        }
        extern "C" {
            #[link_name = "_ZNSt8ios_base7unitbufE"]
            pub static ios_base_unitbuf: root::std::ios_base_fmtflags;
        }
        extern "C" {
            #[link_name = "_ZNSt8ios_base9uppercaseE"]
            pub static ios_base_uppercase: root::std::ios_base_fmtflags;
        }
        extern "C" {
            #[link_name = "_ZNSt8ios_base11adjustfieldE"]
            pub static ios_base_adjustfield: root::std::ios_base_fmtflags;
        }
        extern "C" {
            #[link_name = "_ZNSt8ios_base9basefieldE"]
            pub static ios_base_basefield: root::std::ios_base_fmtflags;
        }
        extern "C" {
            #[link_name = "_ZNSt8ios_base10floatfieldE"]
            pub static ios_base_floatfield: root::std::ios_base_fmtflags;
        }
        extern "C" {
            #[link_name = "_ZNSt8ios_base6badbitE"]
            pub static ios_base_badbit: root::std::ios_base_iostate;
        }
        extern "C" {
            #[link_name = "_ZNSt8ios_base6eofbitE"]
            pub static ios_base_eofbit: root::std::ios_base_iostate;
        }
        extern "C" {
            #[link_name = "_ZNSt8ios_base7failbitE"]
            pub static ios_base_failbit: root::std::ios_base_iostate;
        }
        extern "C" {
            #[link_name = "_ZNSt8ios_base7goodbitE"]
            pub static ios_base_goodbit: root::std::ios_base_iostate;
        }
        extern "C" {
            #[link_name = "_ZNSt8ios_base3appE"]
            pub static ios_base_app: root::std::ios_base_openmode;
        }
        extern "C" {
            #[link_name = "_ZNSt8ios_base3ateE"]
            pub static ios_base_ate: root::std::ios_base_openmode;
        }
        extern "C" {
            #[link_name = "_ZNSt8ios_base6binaryE"]
            pub static ios_base_binary: root::std::ios_base_openmode;
        }
        extern "C" {
            #[link_name = "_ZNSt8ios_base2inE"]
            pub static ios_base_in: root::std::ios_base_openmode;
        }
        extern "C" {
            #[link_name = "_ZNSt8ios_base3outE"]
            pub static ios_base_out: root::std::ios_base_openmode;
        }
        extern "C" {
            #[link_name = "_ZNSt8ios_base5truncE"]
            pub static ios_base_trunc: root::std::ios_base_openmode;
        }
        extern "C" {
            #[link_name = "_ZNSt8ios_base3begE"]
            pub static ios_base_beg: root::std::ios_base_seekdir;
        }
        extern "C" {
            #[link_name = "_ZNSt8ios_base3curE"]
            pub static ios_base_cur: root::std::ios_base_seekdir;
        }
        extern "C" {
            #[link_name = "_ZNSt8ios_base3endE"]
            pub static ios_base_end: root::std::ios_base_seekdir;
        }
        #[test]
        fn bindgen_test_layout_ios_base() {
            assert_eq!(::std::mem::size_of::<ios_base>() , 216usize , concat !
                       ( "Size of: " , stringify ! ( ios_base ) ));
            assert_eq! (::std::mem::align_of::<ios_base>() , 8usize , concat !
                        ( "Alignment of " , stringify ! ( ios_base ) ));
            assert_eq! (unsafe {
                        & ( * ( 0 as * const ios_base ) ) . _M_precision as *
                        const _ as usize } , 8usize , concat ! (
                        "Alignment of field: " , stringify ! ( ios_base ) ,
                        "::" , stringify ! ( _M_precision ) ));
            assert_eq! (unsafe {
                        & ( * ( 0 as * const ios_base ) ) . _M_width as *
                        const _ as usize } , 16usize , concat ! (
                        "Alignment of field: " , stringify ! ( ios_base ) ,
                        "::" , stringify ! ( _M_width ) ));
            assert_eq! (unsafe {
                        & ( * ( 0 as * const ios_base ) ) . _M_flags as *
                        const _ as usize } , 24usize , concat ! (
                        "Alignment of field: " , stringify ! ( ios_base ) ,
                        "::" , stringify ! ( _M_flags ) ));
            assert_eq! (unsafe {
                        & ( * ( 0 as * const ios_base ) ) . _M_exception as *
                        const _ as usize } , 28usize , concat ! (
                        "Alignment of field: " , stringify ! ( ios_base ) ,
                        "::" , stringify ! ( _M_exception ) ));
            assert_eq! (unsafe {
                        & ( * ( 0 as * const ios_base ) ) . _M_streambuf_state
                        as * const _ as usize } , 32usize , concat ! (
                        "Alignment of field: " , stringify ! ( ios_base ) ,
                        "::" , stringify ! ( _M_streambuf_state ) ));
            assert_eq! (unsafe {
                        & ( * ( 0 as * const ios_base ) ) . _M_callbacks as *
                        const _ as usize } , 40usize , concat ! (
                        "Alignment of field: " , stringify ! ( ios_base ) ,
                        "::" , stringify ! ( _M_callbacks ) ));
            assert_eq! (unsafe {
                        & ( * ( 0 as * const ios_base ) ) . _M_word_zero as *
                        const _ as usize } , 48usize , concat ! (
                        "Alignment of field: " , stringify ! ( ios_base ) ,
                        "::" , stringify ! ( _M_word_zero ) ));
            assert_eq! (unsafe {
                        & ( * ( 0 as * const ios_base ) ) . _M_local_word as *
                        const _ as usize } , 64usize , concat ! (
                        "Alignment of field: " , stringify ! ( ios_base ) ,
                        "::" , stringify ! ( _M_local_word ) ));
            assert_eq! (unsafe {
                        & ( * ( 0 as * const ios_base ) ) . _M_word_size as *
                        const _ as usize } , 192usize , concat ! (
                        "Alignment of field: " , stringify ! ( ios_base ) ,
                        "::" , stringify ! ( _M_word_size ) ));
            assert_eq! (unsafe {
                        & ( * ( 0 as * const ios_base ) ) . _M_word as * const
                        _ as usize } , 200usize , concat ! (
                        "Alignment of field: " , stringify ! ( ios_base ) ,
                        "::" , stringify ! ( _M_word ) ));
            assert_eq! (unsafe {
                        & ( * ( 0 as * const ios_base ) ) . _M_ios_locale as *
                        const _ as usize } , 208usize , concat ! (
                        "Alignment of field: " , stringify ! ( ios_base ) ,
                        "::" , stringify ! ( _M_ios_locale ) ));
        }
        extern "C" {
            #[link_name =
                  "_ZNSt8ios_base17register_callbackEPFvNS_5eventERS_iEi"]
            pub fn ios_base_register_callback(this: *mut root::std::ios_base,
                                              __fn:
                                                  root::std::ios_base_event_callback,
                                              __index: ::std::os::raw::c_int);
        }
        extern "C" {
            #[link_name = "_ZNSt8ios_base17_M_call_callbacksENS_5eventE"]
            pub fn ios_base__M_call_callbacks(this: *mut root::std::ios_base,
                                              __ev:
                                                  root::std::ios_base_event);
        }
        extern "C" {
            #[link_name = "_ZNSt8ios_base20_M_dispose_callbacksEv"]
            pub fn ios_base__M_dispose_callbacks(this:
                                                     *mut root::std::ios_base);
        }
        extern "C" {
            #[link_name = "_ZNSt8ios_base13_M_grow_wordsEib"]
            pub fn ios_base__M_grow_words(this: *mut root::std::ios_base,
                                          __index: ::std::os::raw::c_int,
                                          __iword: bool)
             -> *mut root::std::ios_base__Words;
        }
        extern "C" {
            #[link_name = "_ZNSt8ios_base7_M_initEv"]
            pub fn ios_base__M_init(this: *mut root::std::ios_base);
        }
        extern "C" {
            #[link_name = "_ZNSt8ios_base15sync_with_stdioEb"]
            pub fn ios_base_sync_with_stdio(__sync: bool) -> bool;
        }
        extern "C" {
            #[link_name = "_ZNSt8ios_base5imbueERKSt6locale"]
            pub fn ios_base_imbue(this: *mut root::std::ios_base,
                                  __loc: *const root::std::locale)
             -> root::std::locale;
        }
        extern "C" {
            #[link_name = "_ZNSt8ios_base6xallocEv"]
            pub fn ios_base_xalloc() -> ::std::os::raw::c_int;
        }
        extern "C" {
            #[link_name = "_ZNSt8ios_baseC1Ev"]
            pub fn ios_base_ios_base(this: *mut root::std::ios_base);
        }
        impl ios_base {
            #[inline]
            pub unsafe fn register_callback(&mut self,
                                            __fn:
                                                root::std::ios_base_event_callback,
                                            __index: ::std::os::raw::c_int) {
                ios_base_register_callback(self, __fn, __index)
            }
            #[inline]
            pub unsafe fn _M_call_callbacks(&mut self,
                                            __ev: root::std::ios_base_event) {
                ios_base__M_call_callbacks(self, __ev)
            }
            #[inline]
            pub unsafe fn _M_dispose_callbacks(&mut self) {
                ios_base__M_dispose_callbacks(self)
            }
            #[inline]
            pub unsafe fn _M_grow_words(&mut self,
                                        __index: ::std::os::raw::c_int,
                                        __iword: bool)
             -> *mut root::std::ios_base__Words {
                ios_base__M_grow_words(self, __index, __iword)
            }
            #[inline]
            pub unsafe fn _M_init(&mut self) { ios_base__M_init(self) }
            #[inline]
            pub unsafe fn sync_with_stdio(__sync: bool) -> bool {
                ios_base_sync_with_stdio(__sync)
            }
            #[inline]
            pub unsafe fn imbue(&mut self, __loc: *const root::std::locale)
             -> root::std::locale {
                ios_base_imbue(self, __loc)
            }
            #[inline]
            pub unsafe fn xalloc() -> ::std::os::raw::c_int {
                ios_base_xalloc()
            }
            #[inline]
            pub unsafe fn new() -> Self {
                let mut __bindgen_tmp = ::std::mem::uninitialized();
                ios_base_ios_base(&mut __bindgen_tmp);
                __bindgen_tmp
            }
        }
        #[repr(C)]
        #[derive(Debug)]
        pub struct basic_ios<_CharT> {
            pub _base: root::std::ios_base,
            pub _M_tie: *mut root::std::basic_ostream<_CharT>,
            pub _M_fill: root::std::basic_ios_char_type<_CharT>,
            pub _M_fill_init: bool,
            pub _M_streambuf: *mut root::std::basic_streambuf<_CharT>,
            pub _M_ctype: *const root::std::basic_ios___ctype_type,
            pub _M_num_put: *const root::std::basic_ios___num_put_type,
            pub _M_num_get: *const root::std::basic_ios___num_get_type,
        }
        pub type basic_ios_char_type<_CharT> = _CharT;
        pub type basic_ios_int_type = [u8; 0usize];
        pub type basic_ios_pos_type = [u8; 0usize];
        pub type basic_ios_off_type = [u8; 0usize];
        pub type basic_ios_traits_type<_Traits> = _Traits;
        pub type basic_ios___ctype_type = root::std::ctype;
        pub type basic_ios___num_put_type = root::std::num_put;
        pub type basic_ios___num_get_type = root::std::num_get;
        #[repr(C)]
        pub struct basic_streambuf__bindgen_vtable(::std::os::raw::c_void);
        #[repr(C)]
        #[derive(Debug)]
        pub struct basic_streambuf<_CharT> {
            pub vtable_: *const basic_streambuf__bindgen_vtable,
            pub _M_in_beg: *mut root::std::basic_streambuf_char_type<_CharT>,
            pub _M_in_cur: *mut root::std::basic_streambuf_char_type<_CharT>,
            pub _M_in_end: *mut root::std::basic_streambuf_char_type<_CharT>,
            pub _M_out_beg: *mut root::std::basic_streambuf_char_type<_CharT>,
            pub _M_out_cur: *mut root::std::basic_streambuf_char_type<_CharT>,
            pub _M_out_end: *mut root::std::basic_streambuf_char_type<_CharT>,
            pub _M_buf_locale: root::std::locale,
        }
        pub type basic_streambuf_char_type<_CharT> = _CharT;
        pub type basic_streambuf_traits_type<_Traits> = _Traits;
        pub type basic_streambuf_int_type = [u8; 0usize];
        pub type basic_streambuf_pos_type = [u8; 0usize];
        pub type basic_streambuf_off_type = [u8; 0usize];
        pub type basic_streambuf___streambuf_type =
            root::std::basic_streambuf<root::std::basic_streambuf_char_type<_CharT>>;
        #[repr(C)]
        #[derive(Debug)]
        pub struct basic_istream<_CharT> {
            pub _M_gcount: root::std::streamsize,
        }
        pub type basic_istream_char_type<_CharT> = _CharT;
        pub type basic_istream_int_type = [u8; 0usize];
        pub type basic_istream_pos_type = [u8; 0usize];
        pub type basic_istream_off_type = [u8; 0usize];
        pub type basic_istream_traits_type<_Traits> = _Traits;
        pub type basic_istream___streambuf_type<_CharT> =
            root::std::basic_streambuf<_CharT>;
        pub type basic_istream___ios_type<_CharT> =
            root::std::basic_ios<_CharT>;
        pub type basic_istream___istream_type<_CharT> =
            root::std::basic_istream<_CharT>;
        pub type basic_istream___num_get_type = root::std::num_get;
        pub type basic_istream___ctype_type = root::std::ctype;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct basic_istream_sentry {
            pub _M_ok: bool,
        }
        pub type basic_istream_sentry_traits_type = _Traits;
        pub type basic_istream_sentry___streambuf_type =
            root::std::basic_streambuf<_CharT>;
        pub type basic_istream_sentry___istream_type =
            root::std::basic_istream<_CharT>;
        pub type basic_istream_sentry___ctype_type =
            root::std::basic_istream___ctype_type;
        pub type basic_istream_sentry___int_type = [u8; 0usize];
        #[repr(C)]
        #[derive(Debug)]
        pub struct basic_ostream<_CharT> {
        }
        pub type basic_ostream_char_type<_CharT> = _CharT;
        pub type basic_ostream_int_type = [u8; 0usize];
        pub type basic_ostream_pos_type = [u8; 0usize];
        pub type basic_ostream_off_type = [u8; 0usize];
        pub type basic_ostream_traits_type<_Traits> = _Traits;
        pub type basic_ostream___streambuf_type<_CharT> =
            root::std::basic_streambuf<_CharT>;
        pub type basic_ostream___ios_type<_CharT> =
            root::std::basic_ios<_CharT>;
        pub type basic_ostream___ostream_type<_CharT> =
            root::std::basic_ostream<_CharT>;
        pub type basic_ostream___num_put_type = root::std::num_put;
        pub type basic_ostream___ctype_type = root::std::ctype;
        #[repr(C)]
        #[derive(Debug)]
        pub struct basic_ostream_sentry {
            pub _M_ok: bool,
            pub _M_os: *mut root::std::basic_ostream<_CharT>,
        }
        #[repr(C)]
        #[derive(Debug)]
        pub struct basic_stringbuf<_CharT, _Alloc> {
            pub _base: root::std::basic_streambuf<_CharT>,
            pub _M_mode: root::std::ios_base_openmode,
            pub _M_string: root::std::basic_stringbuf___string_type<_Alloc>,
        }
        pub type basic_stringbuf_char_type<_CharT> = _CharT;
        pub type basic_stringbuf_traits_type<_Traits> = _Traits;
        pub type basic_stringbuf_allocator_type<_Alloc> = _Alloc;
        pub type basic_stringbuf_int_type = [u8; 0usize];
        pub type basic_stringbuf_pos_type = [u8; 0usize];
        pub type basic_stringbuf_off_type = [u8; 0usize];
        pub type basic_stringbuf___streambuf_type =
            root::std::basic_streambuf<root::std::basic_stringbuf_char_type<_CharT>>;
        pub type basic_stringbuf___string_type<_Alloc> =
            root::std::basic_string<root::std::basic_stringbuf_char_type<_CharT>,
                                    _Alloc>;
        pub type basic_stringbuf___size_type<_Alloc> =
            root::std::basic_stringbuf___string_type<_Alloc>;
        pub type istream = root::std::basic_istream<::std::os::raw::c_char>;
        pub type ostream = root::std::basic_ostream<::std::os::raw::c_char>;
        pub type stringbuf =
            root::std::basic_stringbuf<::std::os::raw::c_char,
                                       root::std::allocator>;
        #[repr(C)]
        #[derive(Debug)]
        pub struct locale {
            pub _M_impl: *mut root::std::locale__Impl,
        }
        pub type locale_category = ::std::os::raw::c_int;
        #[repr(C)]
        pub struct locale_facet__bindgen_vtable(::std::os::raw::c_void);
        #[repr(C)]
        #[derive(Debug)]
        pub struct locale_facet {
            pub vtable_: *const locale_facet__bindgen_vtable,
            pub _M_refcount: root::std::_Atomic_word,
        }
        extern "C" {
            #[link_name = "_ZNSt6locale5facet11_S_c_localeE"]
            pub static mut locale_facet__S_c_locale: root::std::__c_locale;
        }
        extern "C" {
            #[link_name = "_ZNSt6locale5facet9_S_c_nameE"]
            pub static mut locale_facet__S_c_name:
                       [::std::os::raw::c_char; 2usize];
        }
        extern "C" {
            #[link_name = "_ZNSt6locale5facet7_S_onceE"]
            pub static mut locale_facet__S_once: root::std::__gthread_once_t;
        }
        #[test]
        fn bindgen_test_layout_locale_facet() {
            assert_eq!(::std::mem::size_of::<locale_facet>() , 16usize ,
                       concat ! ( "Size of: " , stringify ! ( locale_facet )
                       ));
            assert_eq! (::std::mem::align_of::<locale_facet>() , 8usize ,
                        concat ! (
                        "Alignment of " , stringify ! ( locale_facet ) ));
            assert_eq! (unsafe {
                        & ( * ( 0 as * const locale_facet ) ) . _M_refcount as
                        * const _ as usize } , 8usize , concat ! (
                        "Alignment of field: " , stringify ! ( locale_facet )
                        , "::" , stringify ! ( _M_refcount ) ));
        }
        extern "C" {
            #[link_name = "_ZNSt6locale5facet18_S_create_c_localeERPiPKcS1_"]
            pub fn locale_facet__S_create_c_locale(__cloc:
                                                       *mut root::std::__c_locale,
                                                   __s:
                                                       *const ::std::os::raw::c_char,
                                                   __old:
                                                       root::std::__c_locale);
        }
        extern "C" {
            #[link_name = "_ZNSt6locale5facet17_S_clone_c_localeERPi"]
            pub fn locale_facet__S_clone_c_locale(__cloc:
                                                      *mut root::std::__c_locale)
             -> root::std::__c_locale;
        }
        extern "C" {
            #[link_name = "_ZNSt6locale5facet19_S_destroy_c_localeERPi"]
            pub fn locale_facet__S_destroy_c_locale(__cloc:
                                                        *mut root::std::__c_locale);
        }
        extern "C" {
            #[link_name = "_ZNSt6locale5facet20_S_lc_ctype_c_localeEPiPKc"]
            pub fn locale_facet__S_lc_ctype_c_locale(__cloc:
                                                         root::std::__c_locale,
                                                     __s:
                                                         *const ::std::os::raw::c_char)
             -> root::std::__c_locale;
        }
        extern "C" {
            #[link_name = "_ZNSt6locale5facet15_S_get_c_localeEv"]
            pub fn locale_facet__S_get_c_locale() -> root::std::__c_locale;
        }
        extern "C" {
            #[link_name = "_ZNSt6locale5facet13_S_get_c_nameEv"]
            pub fn locale_facet__S_get_c_name()
             -> *const ::std::os::raw::c_char;
        }
        impl locale_facet {
            #[inline]
            pub unsafe fn _S_create_c_locale(__cloc:
                                                 *mut root::std::__c_locale,
                                             __s:
                                                 *const ::std::os::raw::c_char,
                                             __old: root::std::__c_locale) {
                locale_facet__S_create_c_locale(__cloc, __s, __old)
            }
            #[inline]
            pub unsafe fn _S_clone_c_locale(__cloc:
                                                *mut root::std::__c_locale)
             -> root::std::__c_locale {
                locale_facet__S_clone_c_locale(__cloc)
            }
            #[inline]
            pub unsafe fn _S_destroy_c_locale(__cloc:
                                                  *mut root::std::__c_locale) {
                locale_facet__S_destroy_c_locale(__cloc)
            }
            #[inline]
            pub unsafe fn _S_lc_ctype_c_locale(__cloc: root::std::__c_locale,
                                               __s:
                                                   *const ::std::os::raw::c_char)
             -> root::std::__c_locale {
                locale_facet__S_lc_ctype_c_locale(__cloc, __s)
            }
            #[inline]
            pub unsafe fn _S_get_c_locale() -> root::std::__c_locale {
                locale_facet__S_get_c_locale()
            }
            #[inline]
            pub unsafe fn _S_get_c_name() -> *const ::std::os::raw::c_char {
                locale_facet__S_get_c_name()
            }
        }
        #[repr(C)]
        #[derive(Debug, Copy)]
        pub struct locale_id {
            pub _M_index: usize,
        }
        extern "C" {
            #[link_name = "_ZNSt6locale2id11_S_refcountE"]
            pub static mut locale_id__S_refcount: root::std::_Atomic_word;
        }
        #[test]
        fn bindgen_test_layout_locale_id() {
            assert_eq!(::std::mem::size_of::<locale_id>() , 8usize , concat !
                       ( "Size of: " , stringify ! ( locale_id ) ));
            assert_eq! (::std::mem::align_of::<locale_id>() , 8usize , concat
                        ! ( "Alignment of " , stringify ! ( locale_id ) ));
            assert_eq! (unsafe {
                        & ( * ( 0 as * const locale_id ) ) . _M_index as *
                        const _ as usize } , 0usize , concat ! (
                        "Alignment of field: " , stringify ! ( locale_id ) ,
                        "::" , stringify ! ( _M_index ) ));
        }
        extern "C" {
            #[link_name = "_ZNKSt6locale2id5_M_idEv"]
            pub fn locale_id__M_id(this: *const root::std::locale_id)
             -> usize;
        }
        impl Clone for locale_id {
            fn clone(&self) -> Self { *self }
        }
        impl locale_id {
            #[inline]
            pub unsafe fn _M_id(&self) -> usize { locale_id__M_id(self) }
        }
        #[repr(C)]
        #[derive(Debug)]
        pub struct locale__Impl {
            pub _M_refcount: root::std::_Atomic_word,
            pub _M_facets: *mut *const root::std::locale_facet,
            pub _M_facets_size: usize,
            pub _M_caches: *mut *const root::std::locale_facet,
            pub _M_names: *mut *mut ::std::os::raw::c_char,
        }
        extern "C" {
            #[link_name = "_ZNSt6locale5_Impl11_S_id_ctypeE"]
            pub static mut locale__Impl__S_id_ctype:
                       [*const root::std::locale_id; 0usize];
        }
        extern "C" {
            #[link_name = "_ZNSt6locale5_Impl13_S_id_numericE"]
            pub static mut locale__Impl__S_id_numeric:
                       [*const root::std::locale_id; 0usize];
        }
        extern "C" {
            #[link_name = "_ZNSt6locale5_Impl13_S_id_collateE"]
            pub static mut locale__Impl__S_id_collate:
                       [*const root::std::locale_id; 0usize];
        }
        extern "C" {
            #[link_name = "_ZNSt6locale5_Impl10_S_id_timeE"]
            pub static mut locale__Impl__S_id_time:
                       [*const root::std::locale_id; 0usize];
        }
        extern "C" {
            #[link_name = "_ZNSt6locale5_Impl14_S_id_monetaryE"]
            pub static mut locale__Impl__S_id_monetary:
                       [*const root::std::locale_id; 0usize];
        }
        extern "C" {
            #[link_name = "_ZNSt6locale5_Impl14_S_id_messagesE"]
            pub static mut locale__Impl__S_id_messages:
                       [*const root::std::locale_id; 0usize];
        }
        extern "C" {
            #[link_name = "_ZNSt6locale5_Impl19_S_facet_categoriesE"]
            pub static mut locale__Impl__S_facet_categories:
                       [*const *const root::std::locale_id; 0usize];
        }
        #[test]
        fn bindgen_test_layout_locale__Impl() {
            assert_eq!(::std::mem::size_of::<locale__Impl>() , 40usize ,
                       concat ! ( "Size of: " , stringify ! ( locale__Impl )
                       ));
            assert_eq! (::std::mem::align_of::<locale__Impl>() , 8usize ,
                        concat ! (
                        "Alignment of " , stringify ! ( locale__Impl ) ));
            assert_eq! (unsafe {
                        & ( * ( 0 as * const locale__Impl ) ) . _M_refcount as
                        * const _ as usize } , 0usize , concat ! (
                        "Alignment of field: " , stringify ! ( locale__Impl )
                        , "::" , stringify ! ( _M_refcount ) ));
            assert_eq! (unsafe {
                        & ( * ( 0 as * const locale__Impl ) ) . _M_facets as *
                        const _ as usize } , 8usize , concat ! (
                        "Alignment of field: " , stringify ! ( locale__Impl )
                        , "::" , stringify ! ( _M_facets ) ));
            assert_eq! (unsafe {
                        & ( * ( 0 as * const locale__Impl ) ) . _M_facets_size
                        as * const _ as usize } , 16usize , concat ! (
                        "Alignment of field: " , stringify ! ( locale__Impl )
                        , "::" , stringify ! ( _M_facets_size ) ));
            assert_eq! (unsafe {
                        & ( * ( 0 as * const locale__Impl ) ) . _M_caches as *
                        const _ as usize } , 24usize , concat ! (
                        "Alignment of field: " , stringify ! ( locale__Impl )
                        , "::" , stringify ! ( _M_caches ) ));
            assert_eq! (unsafe {
                        & ( * ( 0 as * const locale__Impl ) ) . _M_names as *
                        const _ as usize } , 32usize , concat ! (
                        "Alignment of field: " , stringify ! ( locale__Impl )
                        , "::" , stringify ! ( _M_names ) ));
        }
        pub const locale__S_categories_size: root::std::locale__bindgen_ty_1 =
            locale__bindgen_ty_1::_S_categories_size;
        #[repr(u32)]
        #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
        pub enum locale__bindgen_ty_1 { _S_categories_size = 6, }
        pub const locale_none: root::std::locale_category = 0;
        pub const locale_ctype: root::std::locale_category = 1;
        pub const locale_numeric: root::std::locale_category = 2;
        pub const locale_collate: root::std::locale_category = 4;
        pub const locale_time: root::std::locale_category = 8;
        pub const locale_monetary: root::std::locale_category = 16;
        pub const locale_messages: root::std::locale_category = 32;
        pub const locale_all: root::std::locale_category = 63;
        extern "C" {
            #[link_name = "_ZNSt6locale10_S_classicE"]
            pub static mut locale__S_classic: *mut root::std::locale__Impl;
        }
        extern "C" {
            #[link_name = "_ZNSt6locale9_S_globalE"]
            pub static mut locale__S_global: *mut root::std::locale__Impl;
        }
        extern "C" {
            #[link_name = "_ZNSt6locale13_S_categoriesE"]
            pub static locale__S_categories:
                       *const *const ::std::os::raw::c_char;
        }
        extern "C" {
            #[link_name = "_ZNSt6locale7_S_onceE"]
            pub static mut locale__S_once: root::std::__gthread_once_t;
        }
        #[test]
        fn bindgen_test_layout_locale() {
            assert_eq!(::std::mem::size_of::<locale>() , 8usize , concat ! (
                       "Size of: " , stringify ! ( locale ) ));
            assert_eq! (::std::mem::align_of::<locale>() , 8usize , concat ! (
                        "Alignment of " , stringify ! ( locale ) ));
            assert_eq! (unsafe {
                        & ( * ( 0 as * const locale ) ) . _M_impl as * const _
                        as usize } , 0usize , concat ! (
                        "Alignment of field: " , stringify ! ( locale ) , "::"
                        , stringify ! ( _M_impl ) ));
        }
        extern "C" {
            #[link_name = "_ZNKSt6locale4nameEv"]
            pub fn locale_name(this: *const root::std::locale)
             -> root::std::string;
        }
        extern "C" {
            #[link_name = "_ZNSt6locale6globalERKS_"]
            pub fn locale_global(__loc: *const root::std::locale)
             -> root::std::locale;
        }
        extern "C" {
            #[link_name = "_ZNSt6locale7classicEv"]
            pub fn locale_classic() -> *const root::std::locale;
        }
        extern "C" {
            #[link_name = "_ZNSt6localeC1Ev"]
            pub fn locale_locale(this: *mut root::std::locale);
        }
        extern "C" {
            #[link_name = "_ZNSt6localeC1ERKS_"]
            pub fn locale_locale1(this: *mut root::std::locale,
                                  __other: *const root::std::locale);
        }
        extern "C" {
            #[link_name = "_ZNSt6localeC1EPKc"]
            pub fn locale_locale2(this: *mut root::std::locale,
                                  __s: *const ::std::os::raw::c_char);
        }
        extern "C" {
            #[link_name = "_ZNSt6localeC1ERKS_PKci"]
            pub fn locale_locale3(this: *mut root::std::locale,
                                  __base: *const root::std::locale,
                                  __s: *const ::std::os::raw::c_char,
                                  __cat: root::std::locale_category);
        }
        extern "C" {
            #[link_name = "_ZNSt6localeC1ERKS_S1_i"]
            pub fn locale_locale4(this: *mut root::std::locale,
                                  __base: *const root::std::locale,
                                  __add: *const root::std::locale,
                                  __cat: root::std::locale_category);
        }
        extern "C" {
            #[link_name = "_ZNSt6localeD1Ev"]
            pub fn locale_locale_destructor(this: *mut root::std::locale);
        }
        impl locale {
            #[inline]
            pub unsafe fn name(&self) -> root::std::string {
                locale_name(self)
            }
            #[inline]
            pub unsafe fn global(__loc: *const root::std::locale)
             -> root::std::locale {
                locale_global(__loc)
            }
            #[inline]
            pub unsafe fn classic() -> *const root::std::locale {
                locale_classic()
            }
            #[inline]
            pub unsafe fn new() -> Self {
                let mut __bindgen_tmp = ::std::mem::uninitialized();
                locale_locale(&mut __bindgen_tmp);
                __bindgen_tmp
            }
            #[inline]
            pub unsafe fn new1(__other: *const root::std::locale) -> Self {
                let mut __bindgen_tmp = ::std::mem::uninitialized();
                locale_locale1(&mut __bindgen_tmp, __other);
                __bindgen_tmp
            }
            #[inline]
            pub unsafe fn new2(__s: *const ::std::os::raw::c_char) -> Self {
                let mut __bindgen_tmp = ::std::mem::uninitialized();
                locale_locale2(&mut __bindgen_tmp, __s);
                __bindgen_tmp
            }
            #[inline]
            pub unsafe fn new3(__base: *const root::std::locale,
                               __s: *const ::std::os::raw::c_char,
                               __cat: root::std::locale_category) -> Self {
                let mut __bindgen_tmp = ::std::mem::uninitialized();
                locale_locale3(&mut __bindgen_tmp, __base, __s, __cat);
                __bindgen_tmp
            }
            #[inline]
            pub unsafe fn new4(__base: *const root::std::locale,
                               __add: *const root::std::locale,
                               __cat: root::std::locale_category) -> Self {
                let mut __bindgen_tmp = ::std::mem::uninitialized();
                locale_locale4(&mut __bindgen_tmp, __base, __add, __cat);
                __bindgen_tmp
            }
            #[inline]
            pub unsafe fn destruct(&mut self) {
                locale_locale_destructor(self)
            }
        }
        #[repr(C)]
        #[derive(Debug, Copy)]
        pub struct ctype_base {
            pub _address: u8,
        }
        pub type ctype_base___to_type = *const ::std::os::raw::c_int;
        pub type ctype_base_mask = ::std::os::raw::c_ushort;
        pub const ctype_base_upper: root::std::ctype_base_mask = 1;
        pub const ctype_base_lower: root::std::ctype_base_mask = 2;
        pub const ctype_base_alpha: root::std::ctype_base_mask = 4;
        pub const ctype_base_digit: root::std::ctype_base_mask = 8;
        pub const ctype_base_xdigit: root::std::ctype_base_mask = 16;
        pub const ctype_base_space: root::std::ctype_base_mask = 32;
        pub const ctype_base_print: root::std::ctype_base_mask = 64;
        pub const ctype_base_graph: root::std::ctype_base_mask = 524;
        pub const ctype_base_cntrl: root::std::ctype_base_mask = 256;
        pub const ctype_base_punct: root::std::ctype_base_mask = 512;
        pub const ctype_base_alnum: root::std::ctype_base_mask = 12;
        #[test]
        fn bindgen_test_layout_ctype_base() {
            assert_eq!(::std::mem::size_of::<ctype_base>() , 1usize , concat !
                       ( "Size of: " , stringify ! ( ctype_base ) ));
            assert_eq! (::std::mem::align_of::<ctype_base>() , 1usize , concat
                        ! ( "Alignment of " , stringify ! ( ctype_base ) ));
        }
        impl Clone for ctype_base {
            fn clone(&self) -> Self { *self }
        }
        #[repr(C)]
        #[derive(Debug)]
        pub struct ctype {
            pub _base: root::std::__ctype_abstract_base,
        }
        pub type ctype_char_type<_CharT> = _CharT;
        pub type ctype_mask = root::std::__ctype_abstract_base;
        #[repr(C)]
        #[derive(Debug)]
        pub struct num_get {
            pub _base: root::std::locale_facet,
        }
        pub type num_get_char_type<_CharT> = _CharT;
        pub type num_get_iter_type<_InIter> = _InIter;
        #[repr(C)]
        #[derive(Debug)]
        pub struct num_put {
            pub _base: root::std::locale_facet,
        }
        pub type num_put_char_type<_CharT> = _CharT;
        pub type num_put_iter_type<_OutIter> = _OutIter;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct unary_function {
            pub _address: u8,
        }
        pub type unary_function_argument_type<_Arg> = _Arg;
        pub type unary_function_result_type<_Result> = _Result;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct binary_function {
            pub _address: u8,
        }
        pub type binary_function_first_argument_type<_Arg1> = _Arg1;
        pub type binary_function_second_argument_type<_Arg2> = _Arg2;
        pub type binary_function_result_type<_Result> = _Result;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct less {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct _Select1st {
            pub _address: u8,
        }
        #[test]
        fn __bindgen_test_layout_basic_string_instantiation_24961() {
            assert_eq!(::std::mem::size_of::<root::std::basic_string<::std::os::raw::c_char,
                                              root::std::allocator>>()
                       , 8usize , concat ! (
                       "Size of template specialization: " , stringify ! (
                       root::std::basic_string<::std::os::raw::c_char, root::std::allocator>
                       ) ));
            assert_eq!(::std::mem::align_of::<root::std::basic_string<::std::os::raw::c_char,
                                               root::std::allocator>>()
                       , 8usize , concat ! (
                       "Alignment of template specialization: " , stringify !
                       (
                       root::std::basic_string<::std::os::raw::c_char, root::std::allocator>
                       ) ));
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct allocator_traits {
            pub _address: u8,
        }
        pub type allocator_traits_allocator_type<_Alloc> = _Alloc;
        pub type allocator_traits_value_type = [u8; 0usize];
        pub type allocator_traits___pointer<_Alloc> = _Alloc;
        pub type allocator_traits_pointer<_Alloc> =
            root::std::allocator_traits___pointer<_Alloc>;
        pub type allocator_traits___const_pointer<_Alloc> = _Alloc;
        pub type allocator_traits_const_pointer<_Alloc> =
            root::std::allocator_traits___const_pointer<_Alloc>;
        pub type allocator_traits___void_pointer<_Alloc> = _Alloc;
        pub type allocator_traits_void_pointer<_Alloc> =
            root::std::allocator_traits___void_pointer<_Alloc>;
        pub type allocator_traits___const_void_pointer<_Alloc> = _Alloc;
        pub type allocator_traits_const_void_pointer<_Alloc> =
            root::std::allocator_traits___const_void_pointer<_Alloc>;
        pub type allocator_traits___difference_type<_Alloc> = _Alloc;
        pub type allocator_traits_difference_type<_Alloc> =
            root::std::allocator_traits___difference_type<_Alloc>;
        pub type allocator_traits___size_type<_Alloc> = _Alloc;
        pub type allocator_traits_size_type<_Alloc> =
            root::std::allocator_traits___size_type<_Alloc>;
        pub type allocator_traits___propagate_on_container_copy_assignment<_Alloc>
            = _Alloc;
        pub type allocator_traits_propagate_on_container_copy_assignment<_Alloc>
            =
            root::std::allocator_traits___propagate_on_container_copy_assignment<_Alloc>;
        pub type allocator_traits___propagate_on_container_move_assignment<_Alloc>
            = _Alloc;
        pub type allocator_traits_propagate_on_container_move_assignment<_Alloc>
            =
            root::std::allocator_traits___propagate_on_container_move_assignment<_Alloc>;
        pub type allocator_traits___propagate_on_container_swap<_Alloc> =
            _Alloc;
        pub type allocator_traits_propagate_on_container_swap<_Alloc> =
            root::std::allocator_traits___propagate_on_container_swap<_Alloc>;
        pub type allocator_traits_rebind_alloc = u8;
        pub type allocator_traits_rebind_traits = root::std::allocator_traits;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct allocator_traits___allocate_helper {
            pub _address: u8,
        }
        pub type allocator_traits___allocate_helper_type<_Alloc> = _Alloc;
        pub type allocator_traits___has_allocate =
            root::std::allocator_traits___allocate_helper;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct allocator_traits___construct_helper {
            pub _address: u8,
        }
        pub type allocator_traits___construct_helper_type<_Alloc> = _Alloc;
        pub type allocator_traits___has_construct =
            root::std::allocator_traits___construct_helper;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct allocator_traits___destroy_helper {
            pub _address: u8,
        }
        pub type allocator_traits___destroy_helper_type<_Alloc> = _Alloc;
        pub type allocator_traits___has_destroy =
            root::std::allocator_traits___destroy_helper;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct allocator_traits___maxsize_helper {
            pub _address: u8,
        }
        pub type allocator_traits___maxsize_helper_type<_Alloc2> = _Alloc2;
        pub type allocator_traits___has_max_size =
            root::std::allocator_traits___maxsize_helper;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct allocator_traits___select_helper {
            pub _address: u8,
        }
        pub type allocator_traits___select_helper_type<_Alloc2> = _Alloc2;
        pub type allocator_traits___has_soccc =
            root::std::allocator_traits___select_helper;
        #[repr(C)]
        #[derive(Debug)]
        pub struct _Vector_base {
            pub _M_impl: root::std::_Vector_base__Vector_impl,
        }
        pub type _Vector_base__Tp_alloc_type =
            root::__gnu_cxx::__alloc_traits;
        pub type _Vector_base_pointer = root::__gnu_cxx::__alloc_traits;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct _Vector_base__Vector_impl {
            pub _M_start: root::std::_Vector_base_pointer,
            pub _M_finish: root::std::_Vector_base_pointer,
            pub _M_end_of_storage: root::std::_Vector_base_pointer,
        }
        pub type _Vector_base_allocator_type<_Alloc> = _Alloc;
        #[repr(C)]
        #[derive(Debug)]
        pub struct vector {
            pub _base: root::std::_Vector_base,
        }
        pub type vector__Alloc_value_type = [u8; 0usize];
        pub type vector__Base = root::std::_Vector_base;
        pub type vector__Tp_alloc_type = root::std::vector__Base;
        pub type vector__Alloc_traits = root::__gnu_cxx::__alloc_traits;
        pub type vector_value_type<_Tp> = _Tp;
        pub type vector_pointer = root::std::vector__Base;
        pub type vector_const_pointer = root::std::vector__Alloc_traits;
        pub type vector_reference = root::std::vector__Alloc_traits;
        pub type vector_const_reference = root::std::vector__Alloc_traits;
        pub type vector_iterator =
            root::__gnu_cxx::__normal_iterator<root::std::vector_pointer>;
        pub type vector_const_iterator =
            root::__gnu_cxx::__normal_iterator<root::std::vector_const_pointer>;
        pub type vector_const_reverse_iterator =
            root::std::reverse_iterator<root::std::vector_const_iterator>;
        pub type vector_reverse_iterator =
            root::std::reverse_iterator<root::std::vector_iterator>;
        pub type vector_size_type = usize;
        pub type vector_difference_type = isize;
        pub type vector_allocator_type<_Alloc> = _Alloc;
        pub mod __detail {
            #[allow(unused_imports)]
            use self::super::super::super::root;
            #[repr(C)]
            #[derive(Debug, Copy)]
            pub struct _List_node_base {
                pub _M_next: *mut root::std::__detail::_List_node_base,
                pub _M_prev: *mut root::std::__detail::_List_node_base,
            }
            #[test]
            fn bindgen_test_layout__List_node_base() {
                assert_eq!(::std::mem::size_of::<_List_node_base>() , 16usize
                           , concat ! (
                           "Size of: " , stringify ! ( _List_node_base ) ));
                assert_eq! (::std::mem::align_of::<_List_node_base>() , 8usize
                            , concat ! (
                            "Alignment of " , stringify ! ( _List_node_base )
                            ));
                assert_eq! (unsafe {
                            & ( * ( 0 as * const _List_node_base ) ) . _M_next
                            as * const _ as usize } , 0usize , concat ! (
                            "Alignment of field: " , stringify ! (
                            _List_node_base ) , "::" , stringify ! ( _M_next )
                            ));
                assert_eq! (unsafe {
                            & ( * ( 0 as * const _List_node_base ) ) . _M_prev
                            as * const _ as usize } , 8usize , concat ! (
                            "Alignment of field: " , stringify ! (
                            _List_node_base ) , "::" , stringify ! ( _M_prev )
                            ));
            }
            extern "C" {
                #[link_name = "_ZNSt8__detail15_List_node_base4swapERS0_S1_"]
                pub fn _List_node_base_swap(__x:
                                                *mut root::std::__detail::_List_node_base,
                                            __y:
                                                *mut root::std::__detail::_List_node_base);
            }
            extern "C" {
                #[link_name =
                      "_ZNSt8__detail15_List_node_base11_M_transferEPS0_S1_"]
                pub fn _List_node_base__M_transfer(this:
                                                       *mut root::std::__detail::_List_node_base,
                                                   __first:
                                                       *const root::std::__detail::_List_node_base,
                                                   __last:
                                                       *const root::std::__detail::_List_node_base);
            }
            extern "C" {
                #[link_name = "_ZNSt8__detail15_List_node_base10_M_reverseEv"]
                pub fn _List_node_base__M_reverse(this:
                                                      *mut root::std::__detail::_List_node_base);
            }
            extern "C" {
                #[link_name = "_ZNSt8__detail15_List_node_base7_M_hookEPS0_"]
                pub fn _List_node_base__M_hook(this:
                                                   *mut root::std::__detail::_List_node_base,
                                               __position:
                                                   *const root::std::__detail::_List_node_base);
            }
            extern "C" {
                #[link_name = "_ZNSt8__detail15_List_node_base9_M_unhookEv"]
                pub fn _List_node_base__M_unhook(this:
                                                     *mut root::std::__detail::_List_node_base);
            }
            impl Clone for _List_node_base {
                fn clone(&self) -> Self { *self }
            }
            impl _List_node_base {
                #[inline]
                pub unsafe fn swap(__x:
                                       *mut root::std::__detail::_List_node_base,
                                   __y:
                                       *mut root::std::__detail::_List_node_base) {
                    _List_node_base_swap(__x, __y)
                }
                #[inline]
                pub unsafe fn _M_transfer(&mut self,
                                          __first:
                                              *const root::std::__detail::_List_node_base,
                                          __last:
                                              *const root::std::__detail::_List_node_base) {
                    _List_node_base__M_transfer(self, __first, __last)
                }
                #[inline]
                pub unsafe fn _M_reverse(&mut self) {
                    _List_node_base__M_reverse(self)
                }
                #[inline]
                pub unsafe fn _M_hook(&mut self,
                                      __position:
                                          *const root::std::__detail::_List_node_base) {
                    _List_node_base__M_hook(self, __position)
                }
                #[inline]
                pub unsafe fn _M_unhook(&mut self) {
                    _List_node_base__M_unhook(self)
                }
            }
        }
        #[repr(u32)]
        #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
        pub enum _Ios_Fmtflags {
            _S_boolalpha = 1,
            _S_dec = 2,
            _S_fixed = 4,
            _S_hex = 8,
            _S_internal = 16,
            _S_left = 32,
            _S_oct = 64,
            _S_right = 128,
            _S_scientific = 256,
            _S_showbase = 512,
            _S_showpoint = 1024,
            _S_showpos = 2048,
            _S_skipws = 4096,
            _S_unitbuf = 8192,
            _S_uppercase = 16384,
            _S_adjustfield = 176,
            _S_basefield = 74,
            _S_floatfield = 260,
            _S_ios_fmtflags_end = 65536,
        }
        #[repr(u32)]
        #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
        pub enum _Ios_Openmode {
            _S_app = 1,
            _S_ate = 2,
            _S_bin = 4,
            _S_in = 8,
            _S_out = 16,
            _S_trunc = 32,
            _S_ios_openmode_end = 65536,
        }
        #[repr(u32)]
        #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
        pub enum _Ios_Iostate {
            _S_goodbit = 0,
            _S_badbit = 1,
            _S_eofbit = 2,
            _S_failbit = 4,
            _S_ios_iostate_end = 65536,
        }
        #[repr(u32)]
        #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
        pub enum _Ios_Seekdir {
            _S_beg = 0,
            _S_cur = 1,
            _S_end = 2,
            _S_ios_seekdir_end = 65536,
        }
        #[repr(C)]
        #[derive(Debug)]
        pub struct __ctype_abstract_base {
            pub _base: root::std::locale_facet,
        }
        pub type __ctype_abstract_base_char_type<_CharT> = _CharT;
        #[test]
        fn __bindgen_test_layout_basic_ostream_instantiation_34197() {
            assert_eq!(::std::mem::size_of::<root::std::basic_ostream<::std::os::raw::c_char>>()
                       , 272usize , concat ! (
                       "Size of template specialization: " , stringify ! (
                       root::std::basic_ostream<::std::os::raw::c_char> ) ));
            assert_eq!(::std::mem::align_of::<root::std::basic_ostream<::std::os::raw::c_char>>()
                       , 8usize , concat ! (
                       "Alignment of template specialization: " , stringify !
                       ( root::std::basic_ostream<::std::os::raw::c_char> )
                       ));
        }
        #[test]
        fn __bindgen_test_layout_basic_istream_instantiation_34348() {
            assert_eq!(::std::mem::size_of::<root::std::basic_istream<::std::os::raw::c_char>>()
                       , 280usize , concat ! (
                       "Size of template specialization: " , stringify ! (
                       root::std::basic_istream<::std::os::raw::c_char> ) ));
            assert_eq!(::std::mem::align_of::<root::std::basic_istream<::std::os::raw::c_char>>()
                       , 8usize , concat ! (
                       "Alignment of template specialization: " , stringify !
                       ( root::std::basic_istream<::std::os::raw::c_char> )
                       ));
        }
        #[test]
        fn __bindgen_test_layout_basic_stringbuf_instantiation_34475() {
            assert_eq!(::std::mem::size_of::<root::std::basic_stringbuf<::std::os::raw::c_char,
                                                 root::std::allocator>>()
                       , 80usize , concat ! (
                       "Size of template specialization: " , stringify ! (
                       root::std::basic_stringbuf<::std::os::raw::c_char, root::std::allocator>
                       ) ));
            assert_eq!(::std::mem::align_of::<root::std::basic_stringbuf<::std::os::raw::c_char,
                                                  root::std::allocator>>()
                       , 8usize , concat ! (
                       "Alignment of template specialization: " , stringify !
                       (
                       root::std::basic_stringbuf<::std::os::raw::c_char, root::std::allocator>
                       ) ));
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct complex<_Tp> {
            pub _M_real: _Tp,
            pub _M_imag: _Tp,
        }
        pub type complex_value_type<_Tp> = _Tp;
        #[test]
        fn __bindgen_test_layout_complex_instantiation_34529() {
            assert_eq!(::std::mem::size_of::<root::std::complex<f32>>() ,
                       8usize , concat ! (
                       "Size of template specialization: " , stringify ! (
                       root::std::complex<f32> ) ));
            assert_eq!(::std::mem::align_of::<root::std::complex<f32>>() ,
                       4usize , concat ! (
                       "Alignment of template specialization: " , stringify !
                       ( root::std::complex<f32> ) ));
        }
        #[test]
        fn __bindgen_test_layout_complex_instantiation_34533() {
            assert_eq!(::std::mem::size_of::<root::std::complex<f64>>() ,
                       16usize , concat ! (
                       "Size of template specialization: " , stringify ! (
                       root::std::complex<f64> ) ));
            assert_eq!(::std::mem::align_of::<root::std::complex<f64>>() ,
                       8usize , concat ! (
                       "Alignment of template specialization: " , stringify !
                       ( root::std::complex<f64> ) ));
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct _List_node<_Tp> {
            pub _base: root::std::__detail::_List_node_base,
            pub _M_data: _Tp,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct _List_iterator {
            pub _M_node: *mut root::std::__detail::_List_node_base,
        }
        pub type _List_iterator__Self = root::std::_List_iterator;
        pub type _List_iterator__Node<_Tp> = root::std::_List_node<_Tp>;
        pub type _List_iterator_difference_type = isize;
        pub type _List_iterator_iterator_category =
            root::std::bidirectional_iterator_tag;
        pub type _List_iterator_value_type<_Tp> = _Tp;
        pub type _List_iterator_pointer<_Tp> = *mut _Tp;
        pub type _List_iterator_reference<_Tp> = *mut _Tp;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct _List_const_iterator {
            pub _M_node: *const root::std::__detail::_List_node_base,
        }
        pub type _List_const_iterator__Self = root::std::_List_const_iterator;
        pub type _List_const_iterator__Node<_Tp> = root::std::_List_node<_Tp>;
        pub type _List_const_iterator_iterator = root::std::_List_iterator;
        pub type _List_const_iterator_difference_type = isize;
        pub type _List_const_iterator_iterator_category =
            root::std::bidirectional_iterator_tag;
        pub type _List_const_iterator_value_type<_Tp> = _Tp;
        pub type _List_const_iterator_pointer<_Tp> = *mut _Tp;
        pub type _List_const_iterator_reference<_Tp> = *mut _Tp;
        #[repr(C)]
        pub struct _List_base {
            pub _M_impl: root::std::_List_base__List_impl,
        }
        pub type _List_base__Node_alloc_type = [u8; 0usize];
        pub type _List_base__Tp_alloc_type = [u8; 0usize];
        #[repr(C)]
        pub struct _List_base__List_impl {
            pub _M_node: root::std::__detail::_List_node_base,
        }
        pub type _List_base_allocator_type<_Alloc> = _Alloc;
        #[repr(C)]
        pub struct list {
            pub _base: root::std::_List_base,
        }
        pub type list__Alloc_value_type = [u8; 0usize];
        pub type list__Base = root::std::_List_base;
        pub type list__Tp_alloc_type = root::std::list__Base;
        pub type list__Node_alloc_type = root::std::list__Base;
        pub type list_value_type<_Tp> = _Tp;
        pub type list_pointer = root::std::list__Tp_alloc_type;
        pub type list_const_pointer = root::std::list__Tp_alloc_type;
        pub type list_reference = root::std::list__Tp_alloc_type;
        pub type list_const_reference = root::std::list__Tp_alloc_type;
        pub type list_iterator = root::std::_List_iterator;
        pub type list_const_iterator = root::std::_List_const_iterator;
        pub type list_const_reverse_iterator =
            root::std::reverse_iterator<root::std::list_const_iterator>;
        pub type list_reverse_iterator =
            root::std::reverse_iterator<root::std::list_iterator>;
        pub type list_size_type = usize;
        pub type list_difference_type = isize;
        pub type list_allocator_type<_Alloc> = _Alloc;
        pub type list__Node<_Tp> = root::std::_List_node<_Tp>;
        #[repr(u32)]
        #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
        pub enum _Rb_tree_color { _S_red = 0, _S_black = 1, }
        #[repr(C)]
        #[derive(Debug, Copy)]
        pub struct _Rb_tree_node_base {
            pub _M_color: root::std::_Rb_tree_color,
            pub _M_parent: root::std::_Rb_tree_node_base__Base_ptr,
            pub _M_left: root::std::_Rb_tree_node_base__Base_ptr,
            pub _M_right: root::std::_Rb_tree_node_base__Base_ptr,
        }
        pub type _Rb_tree_node_base__Base_ptr =
            *mut root::std::_Rb_tree_node_base;
        pub type _Rb_tree_node_base__Const_Base_ptr =
            *const root::std::_Rb_tree_node_base;
        #[test]
        fn bindgen_test_layout__Rb_tree_node_base() {
            assert_eq!(::std::mem::size_of::<_Rb_tree_node_base>() , 32usize ,
                       concat ! (
                       "Size of: " , stringify ! ( _Rb_tree_node_base ) ));
            assert_eq! (::std::mem::align_of::<_Rb_tree_node_base>() , 8usize
                        , concat ! (
                        "Alignment of " , stringify ! ( _Rb_tree_node_base )
                        ));
            assert_eq! (unsafe {
                        & ( * ( 0 as * const _Rb_tree_node_base ) ) . _M_color
                        as * const _ as usize } , 0usize , concat ! (
                        "Alignment of field: " , stringify ! (
                        _Rb_tree_node_base ) , "::" , stringify ! ( _M_color )
                        ));
            assert_eq! (unsafe {
                        & ( * ( 0 as * const _Rb_tree_node_base ) ) .
                        _M_parent as * const _ as usize } , 8usize , concat !
                        (
                        "Alignment of field: " , stringify ! (
                        _Rb_tree_node_base ) , "::" , stringify ! ( _M_parent
                        ) ));
            assert_eq! (unsafe {
                        & ( * ( 0 as * const _Rb_tree_node_base ) ) . _M_left
                        as * const _ as usize } , 16usize , concat ! (
                        "Alignment of field: " , stringify ! (
                        _Rb_tree_node_base ) , "::" , stringify ! ( _M_left )
                        ));
            assert_eq! (unsafe {
                        & ( * ( 0 as * const _Rb_tree_node_base ) ) . _M_right
                        as * const _ as usize } , 24usize , concat ! (
                        "Alignment of field: " , stringify ! (
                        _Rb_tree_node_base ) , "::" , stringify ! ( _M_right )
                        ));
        }
        impl Clone for _Rb_tree_node_base {
            fn clone(&self) -> Self { *self }
        }
        #[repr(C)]
        pub struct _Rb_tree_node {
            pub _base: root::std::_Rb_tree_node_base,
            pub _M_storage: root::__gnu_cxx::__aligned_buffer,
        }
        pub type _Rb_tree_node__Link_type = *mut root::std::_Rb_tree_node;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct _Rb_tree_iterator {
            pub _M_node: root::std::_Rb_tree_iterator__Base_ptr,
        }
        pub type _Rb_tree_iterator_value_type<_Tp> = _Tp;
        pub type _Rb_tree_iterator_reference<_Tp> = *mut _Tp;
        pub type _Rb_tree_iterator_pointer<_Tp> = *mut _Tp;
        pub type _Rb_tree_iterator_iterator_category =
            root::std::bidirectional_iterator_tag;
        pub type _Rb_tree_iterator_difference_type = isize;
        pub type _Rb_tree_iterator__Self = root::std::_Rb_tree_iterator;
        pub type _Rb_tree_iterator__Base_ptr =
            root::std::_Rb_tree_node_base__Base_ptr;
        pub type _Rb_tree_iterator__Link_type = *mut root::std::_Rb_tree_node;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct _Rb_tree_const_iterator {
            pub _M_node: root::std::_Rb_tree_const_iterator__Base_ptr,
        }
        pub type _Rb_tree_const_iterator_value_type<_Tp> = _Tp;
        pub type _Rb_tree_const_iterator_reference<_Tp> = *mut _Tp;
        pub type _Rb_tree_const_iterator_pointer<_Tp> = *mut _Tp;
        pub type _Rb_tree_const_iterator_iterator =
            root::std::_Rb_tree_iterator;
        pub type _Rb_tree_const_iterator_iterator_category =
            root::std::bidirectional_iterator_tag;
        pub type _Rb_tree_const_iterator_difference_type = isize;
        pub type _Rb_tree_const_iterator__Self =
            root::std::_Rb_tree_const_iterator;
        pub type _Rb_tree_const_iterator__Base_ptr =
            root::std::_Rb_tree_node_base__Const_Base_ptr;
        pub type _Rb_tree_const_iterator__Link_type =
            *const root::std::_Rb_tree_node;
        #[repr(C)]
        pub struct _Rb_tree<_Compare> {
            pub _M_impl: u8,
        }
        pub type _Rb_tree__Node_allocator = root::__gnu_cxx::__alloc_traits;
        pub type _Rb_tree__Alloc_traits = root::__gnu_cxx::__alloc_traits;
        pub type _Rb_tree__Base_ptr = *mut root::std::_Rb_tree_node_base;
        pub type _Rb_tree__Const_Base_ptr =
            *const root::std::_Rb_tree_node_base;
        pub type _Rb_tree_key_type<_Key> = _Key;
        pub type _Rb_tree_value_type<_Val> = _Val;
        pub type _Rb_tree_pointer<_Val> =
            *mut root::std::_Rb_tree_value_type<_Val>;
        pub type _Rb_tree_const_pointer<_Val> =
            *const root::std::_Rb_tree_value_type<_Val>;
        pub type _Rb_tree_reference<_Val> =
            *mut root::std::_Rb_tree_value_type<_Val>;
        pub type _Rb_tree_const_reference<_Val> =
            *const root::std::_Rb_tree_value_type<_Val>;
        pub type _Rb_tree__Link_type = *mut root::std::_Rb_tree_node;
        pub type _Rb_tree__Const_Link_type = *const root::std::_Rb_tree_node;
        pub type _Rb_tree_size_type = usize;
        pub type _Rb_tree_difference_type = isize;
        pub type _Rb_tree_allocator_type<_Alloc> = _Alloc;
        pub type _Rb_tree_reverse_iterator =
            root::std::reverse_iterator<root::std::_Rb_tree_iterator>;
        pub type _Rb_tree_const_reverse_iterator =
            root::std::reverse_iterator<root::std::_Rb_tree_const_iterator>;
        #[repr(C)]
        pub struct map {
            pub _M_t: root::std::map__Rep_type,
        }
        pub type map_key_type<_Key> = _Key;
        pub type map_mapped_type<_Tp> = _Tp;
        pub type map_value_type<_Key, _Tp> = root::std::pair<_Key, _Tp>;
        pub type map_key_compare<_Compare> = _Compare;
        pub type map_allocator_type<_Alloc> = _Alloc;
        pub type map__Alloc_value_type = [u8; 0usize];
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct map_value_compare<_Compare> {
            pub comp: _Compare,
        }
        pub type map__Pair_alloc_type = root::__gnu_cxx::__alloc_traits;
        pub type map__Rep_type =
            root::std::_Rb_tree<root::std::map_key_compare<_Compare>>;
        pub type map__Alloc_traits = root::__gnu_cxx::__alloc_traits;
        pub type map_pointer = root::std::map__Alloc_traits;
        pub type map_const_pointer = root::std::map__Alloc_traits;
        pub type map_reference = root::std::map__Alloc_traits;
        pub type map_const_reference = root::std::map__Alloc_traits;
        pub type map_iterator = root::std::map__Rep_type;
        pub type map_const_iterator = root::std::map__Rep_type;
        pub type map_size_type = root::std::map__Rep_type;
        pub type map_difference_type = root::std::map__Rep_type;
        pub type map_reverse_iterator = root::std::map__Rep_type;
        pub type map_const_reverse_iterator = root::std::map__Rep_type;
    }
    pub type __time64_t = ::std::os::raw::c_longlong;
    pub type time_t = root::__time64_t;
    pub type octave_idx_type = ::std::os::raw::c_int;
    #[repr(C)]
    #[derive(Debug, Copy)]
    pub struct _SETJMP_FLOAT128 {
        pub Part: [::std::os::raw::c_ulonglong; 2usize],
    }
    #[test]
    fn bindgen_test_layout__SETJMP_FLOAT128() {
        assert_eq!(::std::mem::size_of::<_SETJMP_FLOAT128>() , 16usize ,
                   concat ! ( "Size of: " , stringify ! ( _SETJMP_FLOAT128 )
                   ));
        assert_eq! (::std::mem::align_of::<_SETJMP_FLOAT128>() , 8usize ,
                    concat ! (
                    "Alignment of " , stringify ! ( _SETJMP_FLOAT128 ) ));
        assert_eq! (unsafe {
                    & ( * ( 0 as * const _SETJMP_FLOAT128 ) ) . Part as *
                    const _ as usize } , 0usize , concat ! (
                    "Alignment of field: " , stringify ! ( _SETJMP_FLOAT128 )
                    , "::" , stringify ! ( Part ) ));
    }
    impl Clone for _SETJMP_FLOAT128 {
        fn clone(&self) -> Self { *self }
    }
    pub type SETJMP_FLOAT128 = root::_SETJMP_FLOAT128;
    pub type _JBTYPE = root::SETJMP_FLOAT128;
    pub type jmp_buf = [root::_JBTYPE; 16usize];
    pub mod __gnu_cxx {
        #[allow(unused_imports)]
        use self::super::super::root;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __normal_iterator<_Iterator> {
            pub _M_current: _Iterator,
        }
        pub type __normal_iterator___traits_type = root::std::iterator_traits;
        pub type __normal_iterator_iterator_type<_Iterator> = _Iterator;
        pub type __normal_iterator_iterator_category =
            root::__gnu_cxx::__normal_iterator___traits_type;
        pub type __normal_iterator_value_type =
            root::__gnu_cxx::__normal_iterator___traits_type;
        pub type __normal_iterator_difference_type =
            root::__gnu_cxx::__normal_iterator___traits_type;
        pub type __normal_iterator_reference =
            root::__gnu_cxx::__normal_iterator___traits_type;
        pub type __normal_iterator_pointer =
            root::__gnu_cxx::__normal_iterator___traits_type;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct _Char_types {
            pub _address: u8,
        }
        pub type _Char_types_int_type = ::std::os::raw::c_ulong;
        pub type _Char_types_pos_type = root::std::streampos;
        pub type _Char_types_off_type = root::std::streamoff;
        pub type _Char_types_state_type = root::mbstate_t;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct char_traits {
            pub _address: u8,
        }
        pub type char_traits_char_type<_CharT> = _CharT;
        pub type char_traits_int_type = root::__gnu_cxx::_Char_types;
        pub type char_traits_pos_type = root::__gnu_cxx::_Char_types;
        pub type char_traits_off_type = root::__gnu_cxx::_Char_types;
        pub type char_traits_state_type = root::__gnu_cxx::_Char_types;
        #[repr(C)]
        #[derive(Debug)]
        pub struct new_allocator {
            pub _address: u8,
        }
        pub type new_allocator_size_type = usize;
        pub type new_allocator_difference_type = isize;
        pub type new_allocator_pointer<_Tp> = *mut _Tp;
        pub type new_allocator_const_pointer<_Tp> = *mut _Tp;
        pub type new_allocator_reference<_Tp> = *mut _Tp;
        pub type new_allocator_const_reference<_Tp> = *mut _Tp;
        pub type new_allocator_value_type<_Tp> = _Tp;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct new_allocator_rebind {
            pub _address: u8,
        }
        pub type new_allocator_rebind_other = root::__gnu_cxx::new_allocator;
        pub type new_allocator_propagate_on_container_move_assignment =
            root::std::true_type;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __alloc_traits {
            pub _address: u8,
        }
        pub type __alloc_traits_allocator_type<_Alloc> = _Alloc;
        pub type __alloc_traits__Base_type = root::std::allocator_traits;
        pub type __alloc_traits_value_type =
            root::__gnu_cxx::__alloc_traits__Base_type;
        pub type __alloc_traits_pointer =
            root::__gnu_cxx::__alloc_traits__Base_type;
        pub type __alloc_traits_const_pointer =
            root::__gnu_cxx::__alloc_traits__Base_type;
        pub type __alloc_traits_size_type =
            root::__gnu_cxx::__alloc_traits__Base_type;
        pub type __alloc_traits_difference_type =
            root::__gnu_cxx::__alloc_traits__Base_type;
        pub type __alloc_traits_reference =
            *mut root::__gnu_cxx::__alloc_traits_value_type;
        pub type __alloc_traits_const_reference =
            *const root::__gnu_cxx::__alloc_traits_value_type;
        pub type __alloc_traits___is_custom_pointer = root::std::__and_;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __alloc_traits_rebind {
            pub _address: u8,
        }
        pub type __alloc_traits_rebind_other =
            root::__gnu_cxx::__alloc_traits__Base_type;
        #[repr(C)]
        pub struct __aligned_buffer {
            pub _M_storage: u8,
        }
    }
    pub type mbstate_t = ::std::os::raw::c_int;
    #[repr(C)]
    #[derive(Debug, Copy)]
    pub struct __gthread_once_t {
        pub done: ::std::os::raw::c_int,
        pub started: ::std::os::raw::c_long,
    }
    #[test]
    fn bindgen_test_layout___gthread_once_t() {
        assert_eq!(::std::mem::size_of::<__gthread_once_t>() , 8usize , concat
                   ! ( "Size of: " , stringify ! ( __gthread_once_t ) ));
        assert_eq! (::std::mem::align_of::<__gthread_once_t>() , 4usize ,
                    concat ! (
                    "Alignment of " , stringify ! ( __gthread_once_t ) ));
        assert_eq! (unsafe {
                    & ( * ( 0 as * const __gthread_once_t ) ) . done as *
                    const _ as usize } , 0usize , concat ! (
                    "Alignment of field: " , stringify ! ( __gthread_once_t )
                    , "::" , stringify ! ( done ) ));
        assert_eq! (unsafe {
                    & ( * ( 0 as * const __gthread_once_t ) ) . started as *
                    const _ as usize } , 4usize , concat ! (
                    "Alignment of field: " , stringify ! ( __gthread_once_t )
                    , "::" , stringify ! ( started ) ));
    }
    impl Clone for __gthread_once_t {
        fn clone(&self) -> Self { *self }
    }
    pub type octave_jmp_buf = root::jmp_buf;
    pub mod octave {
        #[allow(unused_imports)]
        use self::super::super::root;
        #[repr(C)]
        #[derive(Debug)]
        pub struct exit_exception {
            pub m_exit_status: ::std::os::raw::c_int,
            pub m_safe_to_return: bool,
        }
        #[test]
        fn bindgen_test_layout_exit_exception() {
            assert_eq!(::std::mem::size_of::<exit_exception>() , 8usize ,
                       concat ! ( "Size of: " , stringify ! ( exit_exception )
                       ));
            assert_eq! (::std::mem::align_of::<exit_exception>() , 4usize ,
                        concat ! (
                        "Alignment of " , stringify ! ( exit_exception ) ));
            assert_eq! (unsafe {
                        & ( * ( 0 as * const exit_exception ) ) .
                        m_exit_status as * const _ as usize } , 0usize ,
                        concat ! (
                        "Alignment of field: " , stringify ! ( exit_exception
                        ) , "::" , stringify ! ( m_exit_status ) ));
            assert_eq! (unsafe {
                        & ( * ( 0 as * const exit_exception ) ) .
                        m_safe_to_return as * const _ as usize } , 4usize ,
                        concat ! (
                        "Alignment of field: " , stringify ! ( exit_exception
                        ) , "::" , stringify ! ( m_safe_to_return ) ));
        }
        #[repr(C)]
        #[derive(Debug, Copy)]
        pub struct interrupt_exception {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_interrupt_exception() {
            assert_eq!(::std::mem::size_of::<interrupt_exception>() , 1usize ,
                       concat ! (
                       "Size of: " , stringify ! ( interrupt_exception ) ));
            assert_eq! (::std::mem::align_of::<interrupt_exception>() , 1usize
                        , concat ! (
                        "Alignment of " , stringify ! ( interrupt_exception )
                        ));
        }
        impl Clone for interrupt_exception {
            fn clone(&self) -> Self { *self }
        }
        pub mod sys {
            #[allow(unused_imports)]
            use self::super::super::super::root;
            #[repr(C)]
            pub struct base_tm__bindgen_vtable(::std::os::raw::c_void);
            #[repr(C)]
            #[derive(Debug)]
            pub struct base_tm {
                pub vtable_: *const base_tm__bindgen_vtable,
                pub m_usec: ::std::os::raw::c_int,
                pub m_sec: ::std::os::raw::c_int,
                pub m_min: ::std::os::raw::c_int,
                pub m_hour: ::std::os::raw::c_int,
                pub m_mday: ::std::os::raw::c_int,
                pub m_mon: ::std::os::raw::c_int,
                pub m_year: ::std::os::raw::c_int,
                pub m_wday: ::std::os::raw::c_int,
                pub m_yday: ::std::os::raw::c_int,
                pub m_isdst: ::std::os::raw::c_int,
                pub m_gmtoff: ::std::os::raw::c_long,
                pub m_zone: root::std::string,
            }
            #[test]
            fn bindgen_test_layout_base_tm() {
                assert_eq!(::std::mem::size_of::<base_tm>() , 64usize , concat
                           ! ( "Size of: " , stringify ! ( base_tm ) ));
                assert_eq! (::std::mem::align_of::<base_tm>() , 8usize ,
                            concat ! (
                            "Alignment of " , stringify ! ( base_tm ) ));
                assert_eq! (unsafe {
                            & ( * ( 0 as * const base_tm ) ) . m_usec as *
                            const _ as usize } , 8usize , concat ! (
                            "Alignment of field: " , stringify ! ( base_tm ) ,
                            "::" , stringify ! ( m_usec ) ));
                assert_eq! (unsafe {
                            & ( * ( 0 as * const base_tm ) ) . m_sec as *
                            const _ as usize } , 12usize , concat ! (
                            "Alignment of field: " , stringify ! ( base_tm ) ,
                            "::" , stringify ! ( m_sec ) ));
                assert_eq! (unsafe {
                            & ( * ( 0 as * const base_tm ) ) . m_min as *
                            const _ as usize } , 16usize , concat ! (
                            "Alignment of field: " , stringify ! ( base_tm ) ,
                            "::" , stringify ! ( m_min ) ));
                assert_eq! (unsafe {
                            & ( * ( 0 as * const base_tm ) ) . m_hour as *
                            const _ as usize } , 20usize , concat ! (
                            "Alignment of field: " , stringify ! ( base_tm ) ,
                            "::" , stringify ! ( m_hour ) ));
                assert_eq! (unsafe {
                            & ( * ( 0 as * const base_tm ) ) . m_mday as *
                            const _ as usize } , 24usize , concat ! (
                            "Alignment of field: " , stringify ! ( base_tm ) ,
                            "::" , stringify ! ( m_mday ) ));
                assert_eq! (unsafe {
                            & ( * ( 0 as * const base_tm ) ) . m_mon as *
                            const _ as usize } , 28usize , concat ! (
                            "Alignment of field: " , stringify ! ( base_tm ) ,
                            "::" , stringify ! ( m_mon ) ));
                assert_eq! (unsafe {
                            & ( * ( 0 as * const base_tm ) ) . m_year as *
                            const _ as usize } , 32usize , concat ! (
                            "Alignment of field: " , stringify ! ( base_tm ) ,
                            "::" , stringify ! ( m_year ) ));
                assert_eq! (unsafe {
                            & ( * ( 0 as * const base_tm ) ) . m_wday as *
                            const _ as usize } , 36usize , concat ! (
                            "Alignment of field: " , stringify ! ( base_tm ) ,
                            "::" , stringify ! ( m_wday ) ));
                assert_eq! (unsafe {
                            & ( * ( 0 as * const base_tm ) ) . m_yday as *
                            const _ as usize } , 40usize , concat ! (
                            "Alignment of field: " , stringify ! ( base_tm ) ,
                            "::" , stringify ! ( m_yday ) ));
                assert_eq! (unsafe {
                            & ( * ( 0 as * const base_tm ) ) . m_isdst as *
                            const _ as usize } , 44usize , concat ! (
                            "Alignment of field: " , stringify ! ( base_tm ) ,
                            "::" , stringify ! ( m_isdst ) ));
                assert_eq! (unsafe {
                            & ( * ( 0 as * const base_tm ) ) . m_gmtoff as *
                            const _ as usize } , 48usize , concat ! (
                            "Alignment of field: " , stringify ! ( base_tm ) ,
                            "::" , stringify ! ( m_gmtoff ) ));
                assert_eq! (unsafe {
                            & ( * ( 0 as * const base_tm ) ) . m_zone as *
                            const _ as usize } , 56usize , concat ! (
                            "Alignment of field: " , stringify ! ( base_tm ) ,
                            "::" , stringify ! ( m_zone ) ));
            }
            extern "C" {
                #[link_name = "_ZN6octave3sys7base_tm4usecEi"]
                pub fn base_tm_usec(this: *mut root::octave::sys::base_tm,
                                    v: ::std::os::raw::c_int)
                 -> *mut root::octave::sys::base_tm;
            }
            extern "C" {
                #[link_name = "_ZN6octave3sys7base_tm3secEi"]
                pub fn base_tm_sec(this: *mut root::octave::sys::base_tm,
                                   v: ::std::os::raw::c_int)
                 -> *mut root::octave::sys::base_tm;
            }
            extern "C" {
                #[link_name = "_ZN6octave3sys7base_tm3minEi"]
                pub fn base_tm_min(this: *mut root::octave::sys::base_tm,
                                   v: ::std::os::raw::c_int)
                 -> *mut root::octave::sys::base_tm;
            }
            extern "C" {
                #[link_name = "_ZN6octave3sys7base_tm4hourEi"]
                pub fn base_tm_hour(this: *mut root::octave::sys::base_tm,
                                    v: ::std::os::raw::c_int)
                 -> *mut root::octave::sys::base_tm;
            }
            extern "C" {
                #[link_name = "_ZN6octave3sys7base_tm4mdayEi"]
                pub fn base_tm_mday(this: *mut root::octave::sys::base_tm,
                                    v: ::std::os::raw::c_int)
                 -> *mut root::octave::sys::base_tm;
            }
            extern "C" {
                #[link_name = "_ZN6octave3sys7base_tm3monEi"]
                pub fn base_tm_mon(this: *mut root::octave::sys::base_tm,
                                   v: ::std::os::raw::c_int)
                 -> *mut root::octave::sys::base_tm;
            }
            extern "C" {
                #[link_name = "_ZN6octave3sys7base_tm4yearEi"]
                pub fn base_tm_year(this: *mut root::octave::sys::base_tm,
                                    v: ::std::os::raw::c_int)
                 -> *mut root::octave::sys::base_tm;
            }
            extern "C" {
                #[link_name = "_ZN6octave3sys7base_tm4wdayEi"]
                pub fn base_tm_wday(this: *mut root::octave::sys::base_tm,
                                    v: ::std::os::raw::c_int)
                 -> *mut root::octave::sys::base_tm;
            }
            extern "C" {
                #[link_name = "_ZN6octave3sys7base_tm4ydayEi"]
                pub fn base_tm_yday(this: *mut root::octave::sys::base_tm,
                                    v: ::std::os::raw::c_int)
                 -> *mut root::octave::sys::base_tm;
            }
            extern "C" {
                #[link_name = "_ZN6octave3sys7base_tm5isdstEi"]
                pub fn base_tm_isdst(this: *mut root::octave::sys::base_tm,
                                     v: ::std::os::raw::c_int)
                 -> *mut root::octave::sys::base_tm;
            }
            extern "C" {
                #[link_name = "_ZN6octave3sys7base_tm6gmtoffEl"]
                pub fn base_tm_gmtoff(this: *mut root::octave::sys::base_tm,
                                      v: ::std::os::raw::c_long)
                 -> *mut root::octave::sys::base_tm;
            }
            extern "C" {
                #[link_name = "_ZN6octave3sys7base_tm4zoneERKSs"]
                pub fn base_tm_zone(this: *mut root::octave::sys::base_tm,
                                    s: *const root::std::string)
                 -> *mut root::octave::sys::base_tm;
            }
            extern "C" {
                #[link_name = "_ZNK6octave3sys7base_tm8strftimeERKSs"]
                pub fn base_tm_strftime(this:
                                            *const root::octave::sys::base_tm,
                                        fmt: *const root::std::string)
                 -> root::std::string;
            }
            extern "C" {
                #[link_name = "_ZN6octave3sys7base_tm4initEPv"]
                pub fn base_tm_init(this: *mut root::octave::sys::base_tm,
                                    p: *mut ::std::os::raw::c_void);
            }
            impl base_tm {
                #[inline]
                pub unsafe fn usec(&mut self, v: ::std::os::raw::c_int)
                 -> *mut root::octave::sys::base_tm {
                    base_tm_usec(self, v)
                }
                #[inline]
                pub unsafe fn sec(&mut self, v: ::std::os::raw::c_int)
                 -> *mut root::octave::sys::base_tm {
                    base_tm_sec(self, v)
                }
                #[inline]
                pub unsafe fn min(&mut self, v: ::std::os::raw::c_int)
                 -> *mut root::octave::sys::base_tm {
                    base_tm_min(self, v)
                }
                #[inline]
                pub unsafe fn hour(&mut self, v: ::std::os::raw::c_int)
                 -> *mut root::octave::sys::base_tm {
                    base_tm_hour(self, v)
                }
                #[inline]
                pub unsafe fn mday(&mut self, v: ::std::os::raw::c_int)
                 -> *mut root::octave::sys::base_tm {
                    base_tm_mday(self, v)
                }
                #[inline]
                pub unsafe fn mon(&mut self, v: ::std::os::raw::c_int)
                 -> *mut root::octave::sys::base_tm {
                    base_tm_mon(self, v)
                }
                #[inline]
                pub unsafe fn year(&mut self, v: ::std::os::raw::c_int)
                 -> *mut root::octave::sys::base_tm {
                    base_tm_year(self, v)
                }
                #[inline]
                pub unsafe fn wday(&mut self, v: ::std::os::raw::c_int)
                 -> *mut root::octave::sys::base_tm {
                    base_tm_wday(self, v)
                }
                #[inline]
                pub unsafe fn yday(&mut self, v: ::std::os::raw::c_int)
                 -> *mut root::octave::sys::base_tm {
                    base_tm_yday(self, v)
                }
                #[inline]
                pub unsafe fn isdst(&mut self, v: ::std::os::raw::c_int)
                 -> *mut root::octave::sys::base_tm {
                    base_tm_isdst(self, v)
                }
                #[inline]
                pub unsafe fn gmtoff(&mut self, v: ::std::os::raw::c_long)
                 -> *mut root::octave::sys::base_tm {
                    base_tm_gmtoff(self, v)
                }
                #[inline]
                pub unsafe fn zone(&mut self, s: *const root::std::string)
                 -> *mut root::octave::sys::base_tm {
                    base_tm_zone(self, s)
                }
                #[inline]
                pub unsafe fn strftime(&self, fmt: *const root::std::string)
                 -> root::std::string {
                    base_tm_strftime(self, fmt)
                }
                #[inline]
                pub unsafe fn init(&mut self,
                                   p: *mut ::std::os::raw::c_void) {
                    base_tm_init(self, p)
                }
            }
            #[repr(C)]
            #[derive(Debug)]
            pub struct time {
                pub ot_unix_time: root::time_t,
                pub ot_usec: ::std::os::raw::c_long,
            }
            #[test]
            fn bindgen_test_layout_time() {
                assert_eq!(::std::mem::size_of::<time>() , 16usize , concat !
                           ( "Size of: " , stringify ! ( time ) ));
                assert_eq! (::std::mem::align_of::<time>() , 8usize , concat !
                            ( "Alignment of " , stringify ! ( time ) ));
                assert_eq! (unsafe {
                            & ( * ( 0 as * const time ) ) . ot_unix_time as *
                            const _ as usize } , 0usize , concat ! (
                            "Alignment of field: " , stringify ! ( time ) ,
                            "::" , stringify ! ( ot_unix_time ) ));
                assert_eq! (unsafe {
                            & ( * ( 0 as * const time ) ) . ot_usec as * const
                            _ as usize } , 8usize , concat ! (
                            "Alignment of field: " , stringify ! ( time ) ,
                            "::" , stringify ! ( ot_usec ) ));
            }
            extern "C" {
                #[link_name = "_ZN6octave3sys4time5stampEv"]
                pub fn time_stamp(this: *mut root::octave::sys::time);
            }
            extern "C" {
                #[link_name = "_ZNK6octave3sys4time5ctimeEv"]
                pub fn time_ctime(this: *const root::octave::sys::time)
                 -> root::std::string;
            }
            extern "C" {
                #[link_name = "_ZN6octave3sys4timeC1Ed"]
                pub fn time_time(this: *mut root::octave::sys::time, d: f64);
            }
            extern "C" {
                #[link_name = "_ZN6octave3sys4timeC1ERKNS0_7base_tmE"]
                pub fn time_time1(this: *mut root::octave::sys::time,
                                  tm: *const root::octave::sys::base_tm);
            }
            impl time {
                #[inline]
                pub unsafe fn stamp(&mut self) { time_stamp(self) }
                #[inline]
                pub unsafe fn ctime(&self) -> root::std::string {
                    time_ctime(self)
                }
                #[inline]
                pub unsafe fn new(d: f64) -> Self {
                    let mut __bindgen_tmp = ::std::mem::uninitialized();
                    time_time(&mut __bindgen_tmp, d);
                    __bindgen_tmp
                }
                #[inline]
                pub unsafe fn new1(tm: *const root::octave::sys::base_tm)
                 -> Self {
                    let mut __bindgen_tmp = ::std::mem::uninitialized();
                    time_time1(&mut __bindgen_tmp, tm);
                    __bindgen_tmp
                }
            }
            #[repr(C)]
            #[derive(Debug)]
            pub struct localtime {
                pub _base: root::octave::sys::base_tm,
            }
            #[test]
            fn bindgen_test_layout_localtime() {
                assert_eq!(::std::mem::size_of::<localtime>() , 64usize ,
                           concat ! ( "Size of: " , stringify ! ( localtime )
                           ));
                assert_eq! (::std::mem::align_of::<localtime>() , 8usize ,
                            concat ! (
                            "Alignment of " , stringify ! ( localtime ) ));
            }
            #[repr(C)]
            #[derive(Debug)]
            pub struct gmtime {
                pub _base: root::octave::sys::base_tm,
            }
            #[test]
            fn bindgen_test_layout_gmtime() {
                assert_eq!(::std::mem::size_of::<gmtime>() , 64usize , concat
                           ! ( "Size of: " , stringify ! ( gmtime ) ));
                assert_eq! (::std::mem::align_of::<gmtime>() , 8usize , concat
                            ! ( "Alignment of " , stringify ! ( gmtime ) ));
            }
            #[repr(C)]
            #[derive(Debug)]
            pub struct strptime {
                pub _base: root::octave::sys::base_tm,
                pub nchars: ::std::os::raw::c_int,
            }
            #[test]
            fn bindgen_test_layout_strptime() {
                assert_eq!(::std::mem::size_of::<strptime>() , 72usize ,
                           concat ! ( "Size of: " , stringify ! ( strptime )
                           ));
                assert_eq! (::std::mem::align_of::<strptime>() , 8usize ,
                            concat ! (
                            "Alignment of " , stringify ! ( strptime ) ));
                assert_eq! (unsafe {
                            & ( * ( 0 as * const strptime ) ) . nchars as *
                            const _ as usize } , 64usize , concat ! (
                            "Alignment of field: " , stringify ! ( strptime )
                            , "::" , stringify ! ( nchars ) ));
            }
        }
        #[test]
        fn __bindgen_test_layout_map_instantiation_83990() {
            assert_eq!(::std::mem::size_of::<root::std::map>() , 48usize ,
                       concat ! (
                       "Size of template specialization: " , stringify ! (
                       root::std::map ) ));
            assert_eq!(::std::mem::align_of::<root::std::map>() , 8usize ,
                       concat ! (
                       "Alignment of template specialization: " , stringify !
                       ( root::std::map ) ));
        }
        #[repr(C)]
        #[derive(Debug)]
        pub struct dynamic_library {
            pub rep: *mut root::octave::dynamic_library_dynlib_rep,
        }
        pub type dynamic_library_name_mangler =
            ::std::option::Option<unsafe extern "C" fn(arg1:
                                                           *const root::std::string)
                                      -> root::std::string>;
        pub type dynamic_library_close_hook =
            ::std::option::Option<unsafe extern "C" fn(arg1:
                                                           *const root::std::string)>;
        #[repr(C)]
        pub struct dynamic_library_dynlib_rep__bindgen_vtable(::std::os::raw::c_void);
        #[repr(C)]
        pub struct dynamic_library_dynlib_rep {
            pub vtable_: *const dynamic_library_dynlib_rep__bindgen_vtable,
            pub count: root::octave_refcount<::std::os::raw::c_int>,
            pub file: root::std::string,
            pub tm_loaded: root::octave::sys::time,
            pub fcn_names: root::std::map,
        }
        pub type dynamic_library_dynlib_rep_fcn_names_iterator = u8;
        pub type dynamic_library_dynlib_rep_fcn_names_const_iterator = u8;
        extern "C" {
            #[link_name =
                  "_ZN6octave15dynamic_library10dynlib_rep9instancesE"]
            pub static mut dynamic_library_dynlib_rep_instances:
                       root::std::map;
        }
        #[test]
        fn bindgen_test_layout_dynamic_library_dynlib_rep() {
            assert_eq!(::std::mem::size_of::<dynamic_library_dynlib_rep>() ,
                       88usize , concat ! (
                       "Size of: " , stringify ! ( dynamic_library_dynlib_rep
                       ) ));
            assert_eq! (::std::mem::align_of::<dynamic_library_dynlib_rep>() ,
                        8usize , concat ! (
                        "Alignment of " , stringify ! (
                        dynamic_library_dynlib_rep ) ));
            assert_eq! (unsafe {
                        & ( * ( 0 as * const dynamic_library_dynlib_rep ) ) .
                        count as * const _ as usize } , 8usize , concat ! (
                        "Alignment of field: " , stringify ! (
                        dynamic_library_dynlib_rep ) , "::" , stringify ! (
                        count ) ));
            assert_eq! (unsafe {
                        & ( * ( 0 as * const dynamic_library_dynlib_rep ) ) .
                        file as * const _ as usize } , 16usize , concat ! (
                        "Alignment of field: " , stringify ! (
                        dynamic_library_dynlib_rep ) , "::" , stringify ! (
                        file ) ));
            assert_eq! (unsafe {
                        & ( * ( 0 as * const dynamic_library_dynlib_rep ) ) .
                        tm_loaded as * const _ as usize } , 24usize , concat !
                        (
                        "Alignment of field: " , stringify ! (
                        dynamic_library_dynlib_rep ) , "::" , stringify ! (
                        tm_loaded ) ));
            assert_eq! (unsafe {
                        & ( * ( 0 as * const dynamic_library_dynlib_rep ) ) .
                        fcn_names as * const _ as usize } , 40usize , concat !
                        (
                        "Alignment of field: " , stringify ! (
                        dynamic_library_dynlib_rep ) , "::" , stringify ! (
                        fcn_names ) ));
        }
        extern "C" {
            #[link_name =
                  "_ZNK6octave15dynamic_library10dynlib_rep14is_out_of_dateEv"]
            pub fn dynamic_library_dynlib_rep_is_out_of_date(this:
                                                                 *const root::octave::dynamic_library_dynlib_rep)
             -> bool;
        }
        extern "C" {
            #[link_name =
                  "_ZN6octave15dynamic_library10dynlib_rep12new_instanceERKSs"]
            pub fn dynamic_library_dynlib_rep_new_instance(f:
                                                               *const root::std::string)
             -> *mut root::octave::dynamic_library_dynlib_rep;
        }
        extern "C" {
            #[link_name =
                  "_ZN6octave15dynamic_library10dynlib_rep12get_instanceERKSsb"]
            pub fn dynamic_library_dynlib_rep_get_instance(f:
                                                               *const root::std::string,
                                                           fake: bool)
             -> *mut root::octave::dynamic_library_dynlib_rep;
        }
        extern "C" {
            #[link_name =
                  "_ZN6octave15dynamic_library10dynlib_rep12add_fcn_nameERKSs"]
            pub fn dynamic_library_dynlib_rep_add_fcn_name(this:
                                                               *mut root::octave::dynamic_library_dynlib_rep,
                                                           arg1:
                                                               *const root::std::string);
        }
        extern "C" {
            #[link_name =
                  "_ZN6octave15dynamic_library10dynlib_rep15remove_fcn_nameERKSs"]
            pub fn dynamic_library_dynlib_rep_remove_fcn_name(this:
                                                                  *mut root::octave::dynamic_library_dynlib_rep,
                                                              arg1:
                                                                  *const root::std::string)
             -> bool;
        }
        extern "C" {
            #[link_name =
                  "_ZN6octave15dynamic_library10dynlib_rep13do_close_hookEPFvRKSsE"]
            pub fn dynamic_library_dynlib_rep_do_close_hook(this:
                                                                *mut root::octave::dynamic_library_dynlib_rep,
                                                            cl_hook:
                                                                root::octave::dynamic_library_close_hook);
        }
        extern "C" {
            #[link_name =
                  "_ZN6octave15dynamic_library10dynlib_rep11fake_reloadEv"]
            pub fn dynamic_library_dynlib_rep_fake_reload(this:
                                                              *mut root::octave::dynamic_library_dynlib_rep);
        }
        extern "C" {
            #[link_name = "_ZN6octave15dynamic_library10dynlib_repC1ERKSs"]
            pub fn dynamic_library_dynlib_rep_dynlib_rep(this:
                                                             *mut root::octave::dynamic_library_dynlib_rep,
                                                         f:
                                                             *const root::std::string);
        }
        impl dynamic_library_dynlib_rep {
            #[inline]
            pub unsafe fn is_out_of_date(&self) -> bool {
                dynamic_library_dynlib_rep_is_out_of_date(self)
            }
            #[inline]
            pub unsafe fn new_instance(f: *const root::std::string)
             -> *mut root::octave::dynamic_library_dynlib_rep {
                dynamic_library_dynlib_rep_new_instance(f)
            }
            #[inline]
            pub unsafe fn get_instance(f: *const root::std::string,
                                       fake: bool)
             -> *mut root::octave::dynamic_library_dynlib_rep {
                dynamic_library_dynlib_rep_get_instance(f, fake)
            }
            #[inline]
            pub unsafe fn add_fcn_name(&mut self,
                                       arg1: *const root::std::string) {
                dynamic_library_dynlib_rep_add_fcn_name(self, arg1)
            }
            #[inline]
            pub unsafe fn remove_fcn_name(&mut self,
                                          arg1: *const root::std::string)
             -> bool {
                dynamic_library_dynlib_rep_remove_fcn_name(self, arg1)
            }
            #[inline]
            pub unsafe fn do_close_hook(&mut self,
                                        cl_hook:
                                            root::octave::dynamic_library_close_hook) {
                dynamic_library_dynlib_rep_do_close_hook(self, cl_hook)
            }
            #[inline]
            pub unsafe fn fake_reload(&mut self) {
                dynamic_library_dynlib_rep_fake_reload(self)
            }
            #[inline]
            pub unsafe fn new(f: *const root::std::string) -> Self {
                let mut __bindgen_tmp = ::std::mem::uninitialized();
                dynamic_library_dynlib_rep_dynlib_rep(&mut __bindgen_tmp, f);
                __bindgen_tmp
            }
        }
        extern "C" {
            #[link_name = "_ZN6octave15dynamic_library7nil_repE"]
            pub static mut dynamic_library_nil_rep:
                       root::octave::dynamic_library_dynlib_rep;
        }
        #[test]
        fn bindgen_test_layout_dynamic_library() {
            assert_eq!(::std::mem::size_of::<dynamic_library>() , 8usize ,
                       concat ! (
                       "Size of: " , stringify ! ( dynamic_library ) ));
            assert_eq! (::std::mem::align_of::<dynamic_library>() , 8usize ,
                        concat ! (
                        "Alignment of " , stringify ! ( dynamic_library ) ));
            assert_eq! (unsafe {
                        & ( * ( 0 as * const dynamic_library ) ) . rep as *
                        const _ as usize } , 0usize , concat ! (
                        "Alignment of field: " , stringify ! ( dynamic_library
                        ) , "::" , stringify ! ( rep ) ));
        }
    }
    pub type octave_execution_exception = root::octave::exit_exception;
    pub type octave_exit_exception = root::octave::exit_exception;
    pub type octave_interrupt_exception = root::octave::interrupt_exception;
    #[repr(u32)]
    #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
    pub enum octave_exception {
        octave_no_exception = 0,
        octave_exec_exception = 1,
        octave_alloc_exception = 3,
        octave_quit_exception = 4,
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct octave_refcount<T> {
        pub count: root::octave_refcount_count_type<T>,
    }
    pub type octave_refcount_count_type<T> = T;
    #[repr(C)]
    #[derive(Debug)]
    pub struct dim_vector {
        pub rep: *mut root::octave_idx_type,
    }
    #[test]
    fn bindgen_test_layout_dim_vector() {
        assert_eq!(::std::mem::size_of::<dim_vector>() , 8usize , concat ! (
                   "Size of: " , stringify ! ( dim_vector ) ));
        assert_eq! (::std::mem::align_of::<dim_vector>() , 8usize , concat ! (
                    "Alignment of " , stringify ! ( dim_vector ) ));
        assert_eq! (unsafe {
                    & ( * ( 0 as * const dim_vector ) ) . rep as * const _ as
                    usize } , 0usize , concat ! (
                    "Alignment of field: " , stringify ! ( dim_vector ) , "::"
                    , stringify ! ( rep ) ));
    }
    extern "C" {
        #[link_name = "_ZN10dim_vector19chop_all_singletonsEv"]
        pub fn dim_vector_chop_all_singletons(this: *mut root::dim_vector);
    }
    extern "C" {
        #[link_name = "_ZN10dim_vector7dim_maxEv"]
        pub fn dim_vector_dim_max() -> root::octave_idx_type;
    }
    extern "C" {
        #[link_name = "_ZNK10dim_vector3strEc"]
        pub fn dim_vector_str(this: *const root::dim_vector,
                              sep: ::std::os::raw::c_char)
         -> root::std::string;
    }
    extern "C" {
        #[link_name = "_ZNK10dim_vector8num_onesEv"]
        pub fn dim_vector_num_ones(this: *const root::dim_vector)
         -> ::std::os::raw::c_int;
    }
    extern "C" {
        #[link_name = "_ZNK10dim_vector10safe_numelEv"]
        pub fn dim_vector_safe_numel(this: *const root::dim_vector)
         -> root::octave_idx_type;
    }
    extern "C" {
        #[link_name = "_ZNK10dim_vector7squeezeEv"]
        pub fn dim_vector_squeeze(this: *const root::dim_vector)
         -> root::dim_vector;
    }
    extern "C" {
        #[link_name = "_ZN10dim_vector6concatERKS_i"]
        pub fn dim_vector_concat(this: *mut root::dim_vector,
                                 dvb: *const root::dim_vector,
                                 dim: ::std::os::raw::c_int) -> bool;
    }
    extern "C" {
        #[link_name = "_ZN10dim_vector5hvcatERKS_i"]
        pub fn dim_vector_hvcat(this: *mut root::dim_vector,
                                dvb: *const root::dim_vector,
                                dim: ::std::os::raw::c_int) -> bool;
    }
    extern "C" {
        #[link_name = "_ZNK10dim_vector5redimEi"]
        pub fn dim_vector_redim(this: *const root::dim_vector,
                                n: ::std::os::raw::c_int) -> root::dim_vector;
    }
    impl dim_vector {
        #[inline]
        pub unsafe fn chop_all_singletons(&mut self) {
            dim_vector_chop_all_singletons(self)
        }
        #[inline]
        pub unsafe fn dim_max() -> root::octave_idx_type {
            dim_vector_dim_max()
        }
        #[inline]
        pub unsafe fn str(&self, sep: ::std::os::raw::c_char)
         -> root::std::string {
            dim_vector_str(self, sep)
        }
        #[inline]
        pub unsafe fn num_ones(&self) -> ::std::os::raw::c_int {
            dim_vector_num_ones(self)
        }
        #[inline]
        pub unsafe fn safe_numel(&self) -> root::octave_idx_type {
            dim_vector_safe_numel(self)
        }
        #[inline]
        pub unsafe fn squeeze(&self) -> root::dim_vector {
            dim_vector_squeeze(self)
        }
        #[inline]
        pub unsafe fn concat(&mut self, dvb: *const root::dim_vector,
                             dim: ::std::os::raw::c_int) -> bool {
            dim_vector_concat(self, dvb, dim)
        }
        #[inline]
        pub unsafe fn hvcat(&mut self, dvb: *const root::dim_vector,
                            dim: ::std::os::raw::c_int) -> bool {
            dim_vector_hvcat(self, dvb, dim)
        }
        #[inline]
        pub unsafe fn redim(&self, n: ::std::os::raw::c_int)
         -> root::dim_vector {
            dim_vector_redim(self, n)
        }
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct octave_int<T> {
        pub ival: T,
    }
    pub type octave_int_val_type<T> = T;
    pub type octave_int8 = root::octave_int<::std::os::raw::c_schar>;
    pub type octave_int16 = root::octave_int<::std::os::raw::c_short>;
    pub type octave_int32 = root::octave_int<::std::os::raw::c_int>;
    pub type octave_int64 = root::octave_int<::std::os::raw::c_longlong>;
    pub type octave_uint8 = root::octave_int<::std::os::raw::c_uchar>;
    pub type octave_uint16 = root::octave_int<::std::os::raw::c_ushort>;
    pub type octave_uint32 = root::octave_int<::std::os::raw::c_uint>;
    pub type octave_uint64 = root::octave_int<::std::os::raw::c_ulonglong>;
    #[repr(C)]
    pub struct Array__bindgen_vtable(::std::os::raw::c_void);
    #[repr(C)]
    #[derive(Debug)]
    pub struct Array<T> {
        pub vtable_: *const Array__bindgen_vtable,
        pub dimensions: root::dim_vector,
        pub rep: *mut root::Array_ArrayRep<T>,
        pub slice_data: *mut T,
        pub slice_len: root::octave_idx_type,
    }
    #[repr(C)]
    #[derive(Debug)]
    pub struct Array_ArrayRep<T> {
        pub data: *mut T,
        pub len: root::octave_idx_type,
        pub count: root::octave_refcount<::std::os::raw::c_int>,
    }
    pub type Array_element_type<T> = T;
    pub type Array_value_type<T> = T;
    pub type Array_size_type = root::octave_idx_type;
    pub type Array_crefT = root::ref_param;
    pub type Array_compare_fcn_type =
        ::std::option::Option<unsafe extern "C" fn(arg1: root::ref_param,
                                                   arg2: root::ref_param)
                                  -> bool>;
    #[repr(C)]
    pub struct Sparse__bindgen_vtable(::std::os::raw::c_void);
    #[repr(C)]
    #[derive(Debug)]
    pub struct Sparse<T> {
        pub vtable_: *const Sparse__bindgen_vtable,
        pub rep: *mut root::Sparse_SparseRep<T>,
        pub dimensions: root::dim_vector,
    }
    pub type Sparse_element_type<T> = T;
    #[repr(C)]
    #[derive(Debug)]
    pub struct Sparse_SparseRep<T> {
        pub d: *mut T,
        pub r: *mut root::octave_idx_type,
        pub c: *mut root::octave_idx_type,
        pub nzmx: root::octave_idx_type,
        pub nrows: root::octave_idx_type,
        pub ncols: root::octave_idx_type,
        pub count: root::octave_refcount<::std::os::raw::c_int>,
    }
    #[repr(C)]
    #[derive(Debug)]
    pub struct Range {
        pub rng_base: f64,
        pub rng_limit: f64,
        pub rng_inc: f64,
        pub rng_numel: root::octave_idx_type,
        pub cache: root::Matrix,
    }
    #[test]
    fn bindgen_test_layout_Range() {
        assert_eq!(::std::mem::size_of::<Range>() , 72usize , concat ! (
                   "Size of: " , stringify ! ( Range ) ));
        assert_eq! (::std::mem::align_of::<Range>() , 8usize , concat ! (
                    "Alignment of " , stringify ! ( Range ) ));
        assert_eq! (unsafe {
                    & ( * ( 0 as * const Range ) ) . rng_base as * const _ as
                    usize } , 0usize , concat ! (
                    "Alignment of field: " , stringify ! ( Range ) , "::" ,
                    stringify ! ( rng_base ) ));
        assert_eq! (unsafe {
                    & ( * ( 0 as * const Range ) ) . rng_limit as * const _ as
                    usize } , 8usize , concat ! (
                    "Alignment of field: " , stringify ! ( Range ) , "::" ,
                    stringify ! ( rng_limit ) ));
        assert_eq! (unsafe {
                    & ( * ( 0 as * const Range ) ) . rng_inc as * const _ as
                    usize } , 16usize , concat ! (
                    "Alignment of field: " , stringify ! ( Range ) , "::" ,
                    stringify ! ( rng_inc ) ));
        assert_eq! (unsafe {
                    & ( * ( 0 as * const Range ) ) . rng_numel as * const _ as
                    usize } , 24usize , concat ! (
                    "Alignment of field: " , stringify ! ( Range ) , "::" ,
                    stringify ! ( rng_numel ) ));
        assert_eq! (unsafe {
                    & ( * ( 0 as * const Range ) ) . cache as * const _ as
                    usize } , 32usize , concat ! (
                    "Alignment of field: " , stringify ! ( Range ) , "::" ,
                    stringify ! ( cache ) ));
    }
    extern "C" {
        #[link_name = "_ZNK5Range21all_elements_are_intsEv"]
        pub fn Range_all_elements_are_ints(this: *const root::Range) -> bool;
    }
    extern "C" {
        #[link_name = "_ZNK5Range12matrix_valueEv"]
        pub fn Range_matrix_value(this: *const root::Range) -> root::Matrix;
    }
    extern "C" {
        #[link_name = "_ZNK5Range3minEv"]
        pub fn Range_min(this: *const root::Range) -> f64;
    }
    extern "C" {
        #[link_name = "_ZNK5Range3maxEv"]
        pub fn Range_max(this: *const root::Range) -> f64;
    }
    extern "C" {
        #[link_name = "_ZN5Range13sort_internalEb"]
        pub fn Range_sort_internal(this: *mut root::Range, ascending: bool);
    }
    extern "C" {
        #[link_name = "_ZN5Range13sort_internalER5ArrayIiEb"]
        pub fn Range_sort_internal1(this: *mut root::Range,
                                    sidx:
                                        *mut root::Array<::std::os::raw::c_int>,
                                    ascending: bool);
    }
    extern "C" {
        #[link_name = "_ZNK5Range4diagEi"]
        pub fn Range_diag(this: *const root::Range, k: root::octave_idx_type)
         -> root::Matrix;
    }
    extern "C" {
        #[link_name = "_ZNK5Range4sortEi8sortmode"]
        pub fn Range_sort(this: *const root::Range,
                          dim: root::octave_idx_type, mode: root::sortmode)
         -> root::Range;
    }
    extern "C" {
        #[link_name = "_ZNK5Range4sortER5ArrayIiEi8sortmode"]
        pub fn Range_sort1(this: *const root::Range,
                           sidx: *mut root::Array<::std::os::raw::c_int>,
                           dim: root::octave_idx_type, mode: root::sortmode)
         -> root::Range;
    }
    extern "C" {
        #[link_name = "_ZNK5Range9is_sortedE8sortmode"]
        pub fn Range_is_sorted(this: *const root::Range, mode: root::sortmode)
         -> root::sortmode;
    }
    extern "C" {
        #[link_name = "_ZNK5Range9checkelemEi"]
        pub fn Range_checkelem(this: *const root::Range,
                               i: root::octave_idx_type) -> f64;
    }
    extern "C" {
        #[link_name = "_ZNK5Range4elemEi"]
        pub fn Range_elem(this: *const root::Range, i: root::octave_idx_type)
         -> f64;
    }
    extern "C" {
        #[link_name = "_ZNK5Range5indexERK10idx_vector"]
        pub fn Range_index(this: *const root::Range,
                           i: *const root::idx_vector) -> root::Array<f64>;
    }
    extern "C" {
        #[link_name = "_ZN5Range8set_baseEd"]
        pub fn Range_set_base(this: *mut root::Range, b: f64);
    }
    extern "C" {
        #[link_name = "_ZN5Range9set_limitEd"]
        pub fn Range_set_limit(this: *mut root::Range, l: f64);
    }
    extern "C" {
        #[link_name = "_ZN5Range7set_incEd"]
        pub fn Range_set_inc(this: *mut root::Range, i: f64);
    }
    impl Range {
        #[inline]
        pub unsafe fn all_elements_are_ints(&self) -> bool {
            Range_all_elements_are_ints(self)
        }
        #[inline]
        pub unsafe fn matrix_value(&self) -> root::Matrix {
            Range_matrix_value(self)
        }
        #[inline]
        pub unsafe fn min(&self) -> f64 { Range_min(self) }
        #[inline]
        pub unsafe fn max(&self) -> f64 { Range_max(self) }
        #[inline]
        pub unsafe fn sort_internal(&mut self, ascending: bool) {
            Range_sort_internal(self, ascending)
        }
        #[inline]
        pub unsafe fn sort_internal1(&mut self,
                                     sidx:
                                         *mut root::Array<::std::os::raw::c_int>,
                                     ascending: bool) {
            Range_sort_internal1(self, sidx, ascending)
        }
        #[inline]
        pub unsafe fn diag(&self, k: root::octave_idx_type) -> root::Matrix {
            Range_diag(self, k)
        }
        #[inline]
        pub unsafe fn sort(&self, dim: root::octave_idx_type,
                           mode: root::sortmode) -> root::Range {
            Range_sort(self, dim, mode)
        }
        #[inline]
        pub unsafe fn sort1(&self,
                            sidx: *mut root::Array<::std::os::raw::c_int>,
                            dim: root::octave_idx_type, mode: root::sortmode)
         -> root::Range {
            Range_sort1(self, sidx, dim, mode)
        }
        #[inline]
        pub unsafe fn is_sorted(&self, mode: root::sortmode)
         -> root::sortmode {
            Range_is_sorted(self, mode)
        }
        #[inline]
        pub unsafe fn checkelem(&self, i: root::octave_idx_type) -> f64 {
            Range_checkelem(self, i)
        }
        #[inline]
        pub unsafe fn elem(&self, i: root::octave_idx_type) -> f64 {
            Range_elem(self, i)
        }
        #[inline]
        pub unsafe fn index(&self, i: *const root::idx_vector)
         -> root::Array<f64> {
            Range_index(self, i)
        }
        #[inline]
        pub unsafe fn set_base(&mut self, b: f64) { Range_set_base(self, b) }
        #[inline]
        pub unsafe fn set_limit(&mut self, l: f64) {
            Range_set_limit(self, l)
        }
        #[inline]
        pub unsafe fn set_inc(&mut self, i: f64) { Range_set_inc(self, i) }
    }
    #[repr(C)]
    #[derive(Debug)]
    pub struct idx_vector {
        pub rep: *mut root::idx_vector_idx_base_rep,
    }
    #[repr(i32)]
    #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
    pub enum idx_vector_idx_class_type {
        class_invalid = -1,
        class_colon = 0,
        class_range = 1,
        class_scalar = 2,
        class_vector = 3,
        class_mask = 4,
    }
    #[repr(C)]
    pub struct idx_vector_idx_base_rep__bindgen_vtable(::std::os::raw::c_void);
    #[repr(C)]
    #[derive(Debug)]
    pub struct idx_vector_idx_base_rep {
        pub vtable_: *const idx_vector_idx_base_rep__bindgen_vtable,
        pub count: root::octave_refcount<::std::os::raw::c_int>,
        pub err: bool,
    }
    #[test]
    fn bindgen_test_layout_idx_vector_idx_base_rep() {
        assert_eq!(::std::mem::size_of::<idx_vector_idx_base_rep>() , 16usize
                   , concat ! (
                   "Size of: " , stringify ! ( idx_vector_idx_base_rep ) ));
        assert_eq! (::std::mem::align_of::<idx_vector_idx_base_rep>() , 8usize
                    , concat ! (
                    "Alignment of " , stringify ! ( idx_vector_idx_base_rep )
                    ));
        assert_eq! (unsafe {
                    & ( * ( 0 as * const idx_vector_idx_base_rep ) ) . count
                    as * const _ as usize } , 8usize , concat ! (
                    "Alignment of field: " , stringify ! (
                    idx_vector_idx_base_rep ) , "::" , stringify ! ( count )
                    ));
        assert_eq! (unsafe {
                    & ( * ( 0 as * const idx_vector_idx_base_rep ) ) . err as
                    * const _ as usize } , 12usize , concat ! (
                    "Alignment of field: " , stringify ! (
                    idx_vector_idx_base_rep ) , "::" , stringify ! ( err ) ));
    }
    #[repr(C)]
    #[derive(Debug)]
    pub struct idx_vector_idx_colon_rep {
        pub _base: root::idx_vector_idx_base_rep,
    }
    #[test]
    fn bindgen_test_layout_idx_vector_idx_colon_rep() {
        assert_eq!(::std::mem::size_of::<idx_vector_idx_colon_rep>() , 16usize
                   , concat ! (
                   "Size of: " , stringify ! ( idx_vector_idx_colon_rep ) ));
        assert_eq! (::std::mem::align_of::<idx_vector_idx_colon_rep>() ,
                    8usize , concat ! (
                    "Alignment of " , stringify ! ( idx_vector_idx_colon_rep )
                    ));
    }
    extern "C" {
        #[link_name = "_ZN10idx_vector13idx_colon_repC1Ec"]
        pub fn idx_vector_idx_colon_rep_idx_colon_rep(this:
                                                          *mut root::idx_vector_idx_colon_rep,
                                                      c:
                                                          ::std::os::raw::c_char);
    }
    impl idx_vector_idx_colon_rep {
        #[inline]
        pub unsafe fn new(c: ::std::os::raw::c_char) -> Self {
            let mut __bindgen_tmp = ::std::mem::uninitialized();
            idx_vector_idx_colon_rep_idx_colon_rep(&mut __bindgen_tmp, c);
            __bindgen_tmp
        }
    }
    #[repr(u32)]
    #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
    pub enum idx_vector_direct { DIRECT = 0, }
    #[repr(C)]
    #[derive(Debug)]
    pub struct idx_vector_idx_range_rep {
        pub _base: root::idx_vector_idx_base_rep,
        pub start: root::octave_idx_type,
        pub len: root::octave_idx_type,
        pub step: root::octave_idx_type,
    }
    #[test]
    fn bindgen_test_layout_idx_vector_idx_range_rep() {
        assert_eq!(::std::mem::size_of::<idx_vector_idx_range_rep>() , 32usize
                   , concat ! (
                   "Size of: " , stringify ! ( idx_vector_idx_range_rep ) ));
        assert_eq! (::std::mem::align_of::<idx_vector_idx_range_rep>() ,
                    8usize , concat ! (
                    "Alignment of " , stringify ! ( idx_vector_idx_range_rep )
                    ));
        assert_eq! (unsafe {
                    & ( * ( 0 as * const idx_vector_idx_range_rep ) ) . start
                    as * const _ as usize } , 16usize , concat ! (
                    "Alignment of field: " , stringify ! (
                    idx_vector_idx_range_rep ) , "::" , stringify ! ( start )
                    ));
        assert_eq! (unsafe {
                    & ( * ( 0 as * const idx_vector_idx_range_rep ) ) . len as
                    * const _ as usize } , 20usize , concat ! (
                    "Alignment of field: " , stringify ! (
                    idx_vector_idx_range_rep ) , "::" , stringify ! ( len )
                    ));
        assert_eq! (unsafe {
                    & ( * ( 0 as * const idx_vector_idx_range_rep ) ) . step
                    as * const _ as usize } , 24usize , concat ! (
                    "Alignment of field: " , stringify ! (
                    idx_vector_idx_range_rep ) , "::" , stringify ! ( step )
                    ));
    }
    extern "C" {
        #[link_name = "_ZNK10idx_vector13idx_range_rep9unconvertEv"]
        pub fn idx_vector_idx_range_rep_unconvert(this:
                                                      *const root::idx_vector_idx_range_rep)
         -> root::Range;
    }
    extern "C" {
        #[link_name = "_ZN10idx_vector13idx_range_repC1Eiii"]
        pub fn idx_vector_idx_range_rep_idx_range_rep(this:
                                                          *mut root::idx_vector_idx_range_rep,
                                                      _start:
                                                          root::octave_idx_type,
                                                      _limit:
                                                          root::octave_idx_type,
                                                      _step:
                                                          root::octave_idx_type);
    }
    extern "C" {
        #[link_name = "_ZN10idx_vector13idx_range_repC1ERK5Range"]
        pub fn idx_vector_idx_range_rep_idx_range_rep1(this:
                                                           *mut root::idx_vector_idx_range_rep,
                                                       arg1:
                                                           *const root::Range);
    }
    impl idx_vector_idx_range_rep {
        #[inline]
        pub unsafe fn unconvert(&self) -> root::Range {
            idx_vector_idx_range_rep_unconvert(self)
        }
        #[inline]
        pub unsafe fn new(_start: root::octave_idx_type,
                          _limit: root::octave_idx_type,
                          _step: root::octave_idx_type) -> Self {
            let mut __bindgen_tmp = ::std::mem::uninitialized();
            idx_vector_idx_range_rep_idx_range_rep(&mut __bindgen_tmp, _start,
                                                   _limit, _step);
            __bindgen_tmp
        }
        #[inline]
        pub unsafe fn new1(arg1: *const root::Range) -> Self {
            let mut __bindgen_tmp = ::std::mem::uninitialized();
            idx_vector_idx_range_rep_idx_range_rep1(&mut __bindgen_tmp, arg1);
            __bindgen_tmp
        }
    }
    #[repr(C)]
    #[derive(Debug)]
    pub struct idx_vector_idx_scalar_rep {
        pub _base: root::idx_vector_idx_base_rep,
        pub data: root::octave_idx_type,
    }
    #[test]
    fn bindgen_test_layout_idx_vector_idx_scalar_rep() {
        assert_eq!(::std::mem::size_of::<idx_vector_idx_scalar_rep>() ,
                   24usize , concat ! (
                   "Size of: " , stringify ! ( idx_vector_idx_scalar_rep ) ));
        assert_eq! (::std::mem::align_of::<idx_vector_idx_scalar_rep>() ,
                    8usize , concat ! (
                    "Alignment of " , stringify ! ( idx_vector_idx_scalar_rep
                    ) ));
        assert_eq! (unsafe {
                    & ( * ( 0 as * const idx_vector_idx_scalar_rep ) ) . data
                    as * const _ as usize } , 16usize , concat ! (
                    "Alignment of field: " , stringify ! (
                    idx_vector_idx_scalar_rep ) , "::" , stringify ! ( data )
                    ));
    }
    extern "C" {
        #[link_name = "_ZNK10idx_vector14idx_scalar_rep9unconvertEv"]
        pub fn idx_vector_idx_scalar_rep_unconvert(this:
                                                       *const root::idx_vector_idx_scalar_rep)
         -> f64;
    }
    extern "C" {
        #[link_name = "_ZN10idx_vector14idx_scalar_repC1Ei"]
        pub fn idx_vector_idx_scalar_rep_idx_scalar_rep(this:
                                                            *mut root::idx_vector_idx_scalar_rep,
                                                        i:
                                                            root::octave_idx_type);
    }
    impl idx_vector_idx_scalar_rep {
        #[inline]
        pub unsafe fn unconvert(&self) -> f64 {
            idx_vector_idx_scalar_rep_unconvert(self)
        }
        #[inline]
        pub unsafe fn new(i: root::octave_idx_type) -> Self {
            let mut __bindgen_tmp = ::std::mem::uninitialized();
            idx_vector_idx_scalar_rep_idx_scalar_rep(&mut __bindgen_tmp, i);
            __bindgen_tmp
        }
    }
    #[repr(C)]
    #[derive(Debug)]
    pub struct idx_vector_idx_vector_rep {
        pub _base: root::idx_vector_idx_base_rep,
        pub data: *const root::octave_idx_type,
        pub len: root::octave_idx_type,
        pub ext: root::octave_idx_type,
        pub aowner: *mut root::Array<::std::os::raw::c_int>,
        pub orig_dims: root::dim_vector,
    }
    #[test]
    fn bindgen_test_layout_idx_vector_idx_vector_rep() {
        assert_eq!(::std::mem::size_of::<idx_vector_idx_vector_rep>() ,
                   48usize , concat ! (
                   "Size of: " , stringify ! ( idx_vector_idx_vector_rep ) ));
        assert_eq! (::std::mem::align_of::<idx_vector_idx_vector_rep>() ,
                    8usize , concat ! (
                    "Alignment of " , stringify ! ( idx_vector_idx_vector_rep
                    ) ));
        assert_eq! (unsafe {
                    & ( * ( 0 as * const idx_vector_idx_vector_rep ) ) . data
                    as * const _ as usize } , 16usize , concat ! (
                    "Alignment of field: " , stringify ! (
                    idx_vector_idx_vector_rep ) , "::" , stringify ! ( data )
                    ));
        assert_eq! (unsafe {
                    & ( * ( 0 as * const idx_vector_idx_vector_rep ) ) . len
                    as * const _ as usize } , 24usize , concat ! (
                    "Alignment of field: " , stringify ! (
                    idx_vector_idx_vector_rep ) , "::" , stringify ! ( len )
                    ));
        assert_eq! (unsafe {
                    & ( * ( 0 as * const idx_vector_idx_vector_rep ) ) . ext
                    as * const _ as usize } , 28usize , concat ! (
                    "Alignment of field: " , stringify ! (
                    idx_vector_idx_vector_rep ) , "::" , stringify ! ( ext )
                    ));
        assert_eq! (unsafe {
                    & ( * ( 0 as * const idx_vector_idx_vector_rep ) ) .
                    aowner as * const _ as usize } , 32usize , concat ! (
                    "Alignment of field: " , stringify ! (
                    idx_vector_idx_vector_rep ) , "::" , stringify ! ( aowner
                    ) ));
        assert_eq! (unsafe {
                    & ( * ( 0 as * const idx_vector_idx_vector_rep ) ) .
                    orig_dims as * const _ as usize } , 40usize , concat ! (
                    "Alignment of field: " , stringify ! (
                    idx_vector_idx_vector_rep ) , "::" , stringify ! (
                    orig_dims ) ));
    }
    extern "C" {
        #[link_name = "_ZNK10idx_vector14idx_vector_rep9unconvertEv"]
        pub fn idx_vector_idx_vector_rep_unconvert(this:
                                                       *const root::idx_vector_idx_vector_rep)
         -> root::Array<f64>;
    }
    extern "C" {
        #[link_name = "_ZN10idx_vector14idx_vector_repC1ERK5ArrayIiE"]
        pub fn idx_vector_idx_vector_rep_idx_vector_rep(this:
                                                            *mut root::idx_vector_idx_vector_rep,
                                                        inda:
                                                            *const root::Array<::std::os::raw::c_int>);
    }
    extern "C" {
        #[link_name =
              "_ZN10idx_vector14idx_vector_repC1ERK5ArrayIiEiNS_6directE"]
        pub fn idx_vector_idx_vector_rep_idx_vector_rep1(this:
                                                             *mut root::idx_vector_idx_vector_rep,
                                                         inda:
                                                             *const root::Array<::std::os::raw::c_int>,
                                                         _ext:
                                                             root::octave_idx_type,
                                                         arg1:
                                                             root::idx_vector_direct);
    }
    extern "C" {
        #[link_name = "_ZN10idx_vector14idx_vector_repC1Eb"]
        pub fn idx_vector_idx_vector_rep_idx_vector_rep2(this:
                                                             *mut root::idx_vector_idx_vector_rep,
                                                         arg1: bool);
    }
    extern "C" {
        #[link_name = "_ZN10idx_vector14idx_vector_repC1ERK5ArrayIbEi"]
        pub fn idx_vector_idx_vector_rep_idx_vector_rep3(this:
                                                             *mut root::idx_vector_idx_vector_rep,
                                                         arg1:
                                                             *const root::Array<bool>,
                                                         arg2:
                                                             root::octave_idx_type);
    }
    extern "C" {
        #[link_name = "_ZN10idx_vector14idx_vector_repC1ERK6SparseIbE"]
        pub fn idx_vector_idx_vector_rep_idx_vector_rep4(this:
                                                             *mut root::idx_vector_idx_vector_rep,
                                                         arg1:
                                                             *const root::Sparse<bool>);
    }
    impl idx_vector_idx_vector_rep {
        #[inline]
        pub unsafe fn unconvert(&self) -> root::Array<f64> {
            idx_vector_idx_vector_rep_unconvert(self)
        }
        #[inline]
        pub unsafe fn new(inda: *const root::Array<::std::os::raw::c_int>)
         -> Self {
            let mut __bindgen_tmp = ::std::mem::uninitialized();
            idx_vector_idx_vector_rep_idx_vector_rep(&mut __bindgen_tmp,
                                                     inda);
            __bindgen_tmp
        }
        #[inline]
        pub unsafe fn new1(inda: *const root::Array<::std::os::raw::c_int>,
                           _ext: root::octave_idx_type,
                           arg1: root::idx_vector_direct) -> Self {
            let mut __bindgen_tmp = ::std::mem::uninitialized();
            idx_vector_idx_vector_rep_idx_vector_rep1(&mut __bindgen_tmp,
                                                      inda, _ext, arg1);
            __bindgen_tmp
        }
        #[inline]
        pub unsafe fn new2(arg1: bool) -> Self {
            let mut __bindgen_tmp = ::std::mem::uninitialized();
            idx_vector_idx_vector_rep_idx_vector_rep2(&mut __bindgen_tmp,
                                                      arg1);
            __bindgen_tmp
        }
        #[inline]
        pub unsafe fn new3(arg1: *const root::Array<bool>,
                           arg2: root::octave_idx_type) -> Self {
            let mut __bindgen_tmp = ::std::mem::uninitialized();
            idx_vector_idx_vector_rep_idx_vector_rep3(&mut __bindgen_tmp,
                                                      arg1, arg2);
            __bindgen_tmp
        }
        #[inline]
        pub unsafe fn new4(arg1: *const root::Sparse<bool>) -> Self {
            let mut __bindgen_tmp = ::std::mem::uninitialized();
            idx_vector_idx_vector_rep_idx_vector_rep4(&mut __bindgen_tmp,
                                                      arg1);
            __bindgen_tmp
        }
    }
    #[repr(C)]
    #[derive(Debug)]
    pub struct idx_vector_idx_mask_rep {
        pub _base: root::idx_vector_idx_base_rep,
        pub data: *const bool,
        pub len: root::octave_idx_type,
        pub ext: root::octave_idx_type,
        pub lsti: root::octave_idx_type,
        pub lste: root::octave_idx_type,
        pub aowner: *mut root::Array<bool>,
        pub orig_dims: root::dim_vector,
    }
    #[test]
    fn bindgen_test_layout_idx_vector_idx_mask_rep() {
        assert_eq!(::std::mem::size_of::<idx_vector_idx_mask_rep>() , 56usize
                   , concat ! (
                   "Size of: " , stringify ! ( idx_vector_idx_mask_rep ) ));
        assert_eq! (::std::mem::align_of::<idx_vector_idx_mask_rep>() , 8usize
                    , concat ! (
                    "Alignment of " , stringify ! ( idx_vector_idx_mask_rep )
                    ));
        assert_eq! (unsafe {
                    & ( * ( 0 as * const idx_vector_idx_mask_rep ) ) . data as
                    * const _ as usize } , 16usize , concat ! (
                    "Alignment of field: " , stringify ! (
                    idx_vector_idx_mask_rep ) , "::" , stringify ! ( data )
                    ));
        assert_eq! (unsafe {
                    & ( * ( 0 as * const idx_vector_idx_mask_rep ) ) . len as
                    * const _ as usize } , 24usize , concat ! (
                    "Alignment of field: " , stringify ! (
                    idx_vector_idx_mask_rep ) , "::" , stringify ! ( len ) ));
        assert_eq! (unsafe {
                    & ( * ( 0 as * const idx_vector_idx_mask_rep ) ) . ext as
                    * const _ as usize } , 28usize , concat ! (
                    "Alignment of field: " , stringify ! (
                    idx_vector_idx_mask_rep ) , "::" , stringify ! ( ext ) ));
        assert_eq! (unsafe {
                    & ( * ( 0 as * const idx_vector_idx_mask_rep ) ) . lsti as
                    * const _ as usize } , 32usize , concat ! (
                    "Alignment of field: " , stringify ! (
                    idx_vector_idx_mask_rep ) , "::" , stringify ! ( lsti )
                    ));
        assert_eq! (unsafe {
                    & ( * ( 0 as * const idx_vector_idx_mask_rep ) ) . lste as
                    * const _ as usize } , 36usize , concat ! (
                    "Alignment of field: " , stringify ! (
                    idx_vector_idx_mask_rep ) , "::" , stringify ! ( lste )
                    ));
        assert_eq! (unsafe {
                    & ( * ( 0 as * const idx_vector_idx_mask_rep ) ) . aowner
                    as * const _ as usize } , 40usize , concat ! (
                    "Alignment of field: " , stringify ! (
                    idx_vector_idx_mask_rep ) , "::" , stringify ! ( aowner )
                    ));
        assert_eq! (unsafe {
                    & ( * ( 0 as * const idx_vector_idx_mask_rep ) ) .
                    orig_dims as * const _ as usize } , 48usize , concat ! (
                    "Alignment of field: " , stringify ! (
                    idx_vector_idx_mask_rep ) , "::" , stringify ! ( orig_dims
                    ) ));
    }
    extern "C" {
        #[link_name = "_ZNK10idx_vector12idx_mask_rep9unconvertEv"]
        pub fn idx_vector_idx_mask_rep_unconvert(this:
                                                     *const root::idx_vector_idx_mask_rep)
         -> root::Array<bool>;
    }
    extern "C" {
        #[link_name = "_ZN10idx_vector12idx_mask_repC1Eb"]
        pub fn idx_vector_idx_mask_rep_idx_mask_rep(this:
                                                        *mut root::idx_vector_idx_mask_rep,
                                                    arg1: bool);
    }
    extern "C" {
        #[link_name = "_ZN10idx_vector12idx_mask_repC1ERK5ArrayIbEi"]
        pub fn idx_vector_idx_mask_rep_idx_mask_rep1(this:
                                                         *mut root::idx_vector_idx_mask_rep,
                                                     arg1:
                                                         *const root::Array<bool>,
                                                     arg2:
                                                         root::octave_idx_type);
    }
    impl idx_vector_idx_mask_rep {
        #[inline]
        pub unsafe fn unconvert(&self) -> root::Array<bool> {
            idx_vector_idx_mask_rep_unconvert(self)
        }
        #[inline]
        pub unsafe fn new(arg1: bool) -> Self {
            let mut __bindgen_tmp = ::std::mem::uninitialized();
            idx_vector_idx_mask_rep_idx_mask_rep(&mut __bindgen_tmp, arg1);
            __bindgen_tmp
        }
        #[inline]
        pub unsafe fn new1(arg1: *const root::Array<bool>,
                           arg2: root::octave_idx_type) -> Self {
            let mut __bindgen_tmp = ::std::mem::uninitialized();
            idx_vector_idx_mask_rep_idx_mask_rep1(&mut __bindgen_tmp, arg1,
                                                  arg2);
            __bindgen_tmp
        }
    }
    extern "C" {
        #[link_name = "_ZN10idx_vector5colonE"]
        pub static idx_vector_colon: root::idx_vector;
    }
    #[test]
    fn bindgen_test_layout_idx_vector() {
        assert_eq!(::std::mem::size_of::<idx_vector>() , 8usize , concat ! (
                   "Size of: " , stringify ! ( idx_vector ) ));
        assert_eq! (::std::mem::align_of::<idx_vector>() , 8usize , concat ! (
                    "Alignment of " , stringify ! ( idx_vector ) ));
        assert_eq! (unsafe {
                    & ( * ( 0 as * const idx_vector ) ) . rep as * const _ as
                    usize } , 0usize , concat ! (
                    "Alignment of field: " , stringify ! ( idx_vector ) , "::"
                    , stringify ! ( rep ) ));
    }
    extern "C" {
        #[link_name = "_ZN10idx_vector12maybe_reduceEiRKS_i"]
        pub fn idx_vector_maybe_reduce(this: *mut root::idx_vector,
                                       n: root::octave_idx_type,
                                       j: *const root::idx_vector,
                                       nj: root::octave_idx_type) -> bool;
    }
    extern "C" {
        #[link_name = "_ZNK10idx_vector13is_cont_rangeEiRiS0_"]
        pub fn idx_vector_is_cont_range(this: *const root::idx_vector,
                                        n: root::octave_idx_type,
                                        l: *mut root::octave_idx_type,
                                        u: *mut root::octave_idx_type)
         -> bool;
    }
    extern "C" {
        #[link_name = "_ZNK10idx_vector9incrementEv"]
        pub fn idx_vector_increment(this: *const root::idx_vector)
         -> root::octave_idx_type;
    }
    extern "C" {
        #[link_name = "_ZNK10idx_vector10complementEi"]
        pub fn idx_vector_complement(this: *const root::idx_vector,
                                     n: root::octave_idx_type)
         -> root::idx_vector;
    }
    extern "C" {
        #[link_name = "_ZNK10idx_vector14is_permutationEi"]
        pub fn idx_vector_is_permutation(this: *const root::idx_vector,
                                         n: root::octave_idx_type) -> bool;
    }
    extern "C" {
        #[link_name = "_ZNK10idx_vector19inverse_permutationEi"]
        pub fn idx_vector_inverse_permutation(this: *const root::idx_vector,
                                              n: root::octave_idx_type)
         -> root::idx_vector;
    }
    extern "C" {
        #[link_name = "_ZNK10idx_vector9copy_dataEPi"]
        pub fn idx_vector_copy_data(this: *const root::idx_vector,
                                    data: *mut root::octave_idx_type);
    }
    extern "C" {
        #[link_name = "_ZNK10idx_vector6unmaskEv"]
        pub fn idx_vector_unmask(this: *const root::idx_vector)
         -> root::idx_vector;
    }
    extern "C" {
        #[link_name =
              "_ZNK10idx_vector9unconvertERNS_14idx_class_typeERdR5RangeR5ArrayIdERS5_IbE"]
        pub fn idx_vector_unconvert(this: *const root::idx_vector,
                                    iclass:
                                        *mut root::idx_vector_idx_class_type,
                                    scalar: *mut f64, range: *mut root::Range,
                                    array: *mut root::Array<f64>,
                                    mask: *mut root::Array<bool>);
    }
    extern "C" {
        #[link_name = "_ZNK10idx_vector8as_arrayEv"]
        pub fn idx_vector_as_array(this: *const root::idx_vector)
         -> root::Array<::std::os::raw::c_int>;
    }
    extern "C" {
        #[link_name = "_ZN10idx_vector3rawEv"]
        pub fn idx_vector_raw(this: *mut root::idx_vector)
         -> *const root::octave_idx_type;
    }
    extern "C" {
        #[link_name = "_ZNK10idx_vector9is_vectorEv"]
        pub fn idx_vector_is_vector(this: *const root::idx_vector) -> bool;
    }
    extern "C" {
        #[link_name = "_ZN10idx_vector6freezeEiPKcb"]
        pub fn idx_vector_freeze(this: *mut root::idx_vector,
                                 z_len: root::octave_idx_type,
                                 tag: *const ::std::os::raw::c_char,
                                 resize_ok: bool) -> root::octave_idx_type;
    }
    extern "C" {
        #[link_name = "_ZNK10idx_vector10ones_countEv"]
        pub fn idx_vector_ones_count(this: *const root::idx_vector)
         -> root::octave_idx_type;
    }
    extern "C" {
        #[link_name = "_ZN10idx_vectorC1ERK5ArrayIbE"]
        pub fn idx_vector_idx_vector(this: *mut root::idx_vector,
                                     nda: *const root::Array<bool>);
    }
    impl idx_vector {
        #[inline]
        pub unsafe fn maybe_reduce(&mut self, n: root::octave_idx_type,
                                   j: *const root::idx_vector,
                                   nj: root::octave_idx_type) -> bool {
            idx_vector_maybe_reduce(self, n, j, nj)
        }
        #[inline]
        pub unsafe fn is_cont_range(&self, n: root::octave_idx_type,
                                    l: *mut root::octave_idx_type,
                                    u: *mut root::octave_idx_type) -> bool {
            idx_vector_is_cont_range(self, n, l, u)
        }
        #[inline]
        pub unsafe fn increment(&self) -> root::octave_idx_type {
            idx_vector_increment(self)
        }
        #[inline]
        pub unsafe fn complement(&self, n: root::octave_idx_type)
         -> root::idx_vector {
            idx_vector_complement(self, n)
        }
        #[inline]
        pub unsafe fn is_permutation(&self, n: root::octave_idx_type)
         -> bool {
            idx_vector_is_permutation(self, n)
        }
        #[inline]
        pub unsafe fn inverse_permutation(&self, n: root::octave_idx_type)
         -> root::idx_vector {
            idx_vector_inverse_permutation(self, n)
        }
        #[inline]
        pub unsafe fn copy_data(&self, data: *mut root::octave_idx_type) {
            idx_vector_copy_data(self, data)
        }
        #[inline]
        pub unsafe fn unmask(&self) -> root::idx_vector {
            idx_vector_unmask(self)
        }
        #[inline]
        pub unsafe fn unconvert(&self,
                                iclass: *mut root::idx_vector_idx_class_type,
                                scalar: *mut f64, range: *mut root::Range,
                                array: *mut root::Array<f64>,
                                mask: *mut root::Array<bool>) {
            idx_vector_unconvert(self, iclass, scalar, range, array, mask)
        }
        #[inline]
        pub unsafe fn as_array(&self) -> root::Array<::std::os::raw::c_int> {
            idx_vector_as_array(self)
        }
        #[inline]
        pub unsafe fn raw(&mut self) -> *const root::octave_idx_type {
            idx_vector_raw(self)
        }
        #[inline]
        pub unsafe fn is_vector(&self) -> bool { idx_vector_is_vector(self) }
        #[inline]
        pub unsafe fn freeze(&mut self, z_len: root::octave_idx_type,
                             tag: *const ::std::os::raw::c_char,
                             resize_ok: bool) -> root::octave_idx_type {
            idx_vector_freeze(self, z_len, tag, resize_ok)
        }
        #[inline]
        pub unsafe fn ones_count(&self) -> root::octave_idx_type {
            idx_vector_ones_count(self)
        }
        #[inline]
        pub unsafe fn new(nda: *const root::Array<bool>) -> Self {
            let mut __bindgen_tmp = ::std::mem::uninitialized();
            idx_vector_idx_vector(&mut __bindgen_tmp, nda);
            __bindgen_tmp
        }
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct ref_param {
        pub _address: u8,
    }
    pub type ref_param_type = u8;
    pub type Complex = root::std::complex<f64>;
    pub type FloatComplex = root::std::complex<f32>;
    #[repr(u32)]
    #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
    pub enum sortmode { UNSORTED = 0, ASCENDING = 1, DESCENDING = 2, }
    #[repr(C)]
    #[derive(Debug)]
    pub struct octave_sort<T> {
        pub compare: root::octave_sort_compare_fcn_type,
        pub ms: *mut root::octave_sort_MergeState<T>,
    }
    pub type octave_sort_compare_fcn_type =
        ::std::option::Option<unsafe extern "C" fn(arg1: root::ref_param,
                                                   arg2: root::ref_param)
                                  -> bool>;
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct octave_sort_s_slice {
        pub base: root::octave_idx_type,
        pub len: root::octave_idx_type,
    }
    #[repr(C)]
    pub struct octave_sort_MergeState<T> {
        pub min_gallop: root::octave_idx_type,
        pub a: *mut T,
        pub ia: *mut root::octave_idx_type,
        pub alloced: root::octave_idx_type,
        pub n: root::octave_idx_type,
        pub pending: [root::octave_sort_s_slice; 85usize],
    }
    #[repr(C)]
    #[derive(Debug)]
    pub struct PermMatrix {
        pub _base: root::Array<::std::os::raw::c_int>,
    }
    #[test]
    fn bindgen_test_layout_PermMatrix() {
        assert_eq!(::std::mem::size_of::<PermMatrix>() , 40usize , concat ! (
                   "Size of: " , stringify ! ( PermMatrix ) ));
        assert_eq! (::std::mem::align_of::<PermMatrix>() , 8usize , concat ! (
                    "Alignment of " , stringify ! ( PermMatrix ) ));
    }
    extern "C" {
        #[link_name = "_ZNK10PermMatrix9checkelemEii"]
        pub fn PermMatrix_checkelem(this: *const root::PermMatrix,
                                    i: root::octave_idx_type,
                                    j: root::octave_idx_type)
         -> root::octave_idx_type;
    }
    extern "C" {
        #[link_name = "_ZNK10PermMatrix9transposeEv"]
        pub fn PermMatrix_transpose(this: *const root::PermMatrix)
         -> root::PermMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK10PermMatrix7inverseEv"]
        pub fn PermMatrix_inverse(this: *const root::PermMatrix)
         -> root::PermMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK10PermMatrix11determinantEv"]
        pub fn PermMatrix_determinant(this: *const root::PermMatrix)
         -> root::octave_idx_type;
    }
    extern "C" {
        #[link_name = "_ZNK10PermMatrix5powerEi"]
        pub fn PermMatrix_power(this: *const root::PermMatrix,
                                n: root::octave_idx_type) -> root::PermMatrix;
    }
    extern "C" {
        #[link_name = "_ZN10PermMatrix3eyeEi"]
        pub fn PermMatrix_eye(n: root::octave_idx_type) -> root::PermMatrix;
    }
    extern "C" {
        #[link_name = "_ZN10PermMatrixC1Ei"]
        pub fn PermMatrix_PermMatrix(this: *mut root::PermMatrix,
                                     n: root::octave_idx_type);
    }
    extern "C" {
        #[link_name = "_ZN10PermMatrixC1ERK5ArrayIiE"]
        pub fn PermMatrix_PermMatrix1(this: *mut root::PermMatrix,
                                      p:
                                          *const root::Array<::std::os::raw::c_int>);
    }
    extern "C" {
        #[link_name = "_ZN10PermMatrixC1ERK5ArrayIiEbb"]
        pub fn PermMatrix_PermMatrix2(this: *mut root::PermMatrix,
                                      p:
                                          *const root::Array<::std::os::raw::c_int>,
                                      colp: bool, check: bool);
    }
    extern "C" {
        #[link_name = "_ZN10PermMatrixC1ERK10idx_vector"]
        pub fn PermMatrix_PermMatrix3(this: *mut root::PermMatrix,
                                      idx: *const root::idx_vector);
    }
    extern "C" {
        #[link_name = "_ZN10PermMatrixC1ERK10idx_vectorbi"]
        pub fn PermMatrix_PermMatrix4(this: *mut root::PermMatrix,
                                      idx: *const root::idx_vector,
                                      colp: bool, n: root::octave_idx_type);
    }
    impl PermMatrix {
        #[inline]
        pub unsafe fn checkelem(&self, i: root::octave_idx_type,
                                j: root::octave_idx_type)
         -> root::octave_idx_type {
            PermMatrix_checkelem(self, i, j)
        }
        #[inline]
        pub unsafe fn transpose(&self) -> root::PermMatrix {
            PermMatrix_transpose(self)
        }
        #[inline]
        pub unsafe fn inverse(&self) -> root::PermMatrix {
            PermMatrix_inverse(self)
        }
        #[inline]
        pub unsafe fn determinant(&self) -> root::octave_idx_type {
            PermMatrix_determinant(self)
        }
        #[inline]
        pub unsafe fn power(&self, n: root::octave_idx_type)
         -> root::PermMatrix {
            PermMatrix_power(self, n)
        }
        #[inline]
        pub unsafe fn eye(n: root::octave_idx_type) -> root::PermMatrix {
            PermMatrix_eye(n)
        }
        #[inline]
        pub unsafe fn new(n: root::octave_idx_type) -> Self {
            let mut __bindgen_tmp = ::std::mem::uninitialized();
            PermMatrix_PermMatrix(&mut __bindgen_tmp, n);
            __bindgen_tmp
        }
        #[inline]
        pub unsafe fn new1(p: *const root::Array<::std::os::raw::c_int>)
         -> Self {
            let mut __bindgen_tmp = ::std::mem::uninitialized();
            PermMatrix_PermMatrix1(&mut __bindgen_tmp, p);
            __bindgen_tmp
        }
        #[inline]
        pub unsafe fn new2(p: *const root::Array<::std::os::raw::c_int>,
                           colp: bool, check: bool) -> Self {
            let mut __bindgen_tmp = ::std::mem::uninitialized();
            PermMatrix_PermMatrix2(&mut __bindgen_tmp, p, colp, check);
            __bindgen_tmp
        }
        #[inline]
        pub unsafe fn new3(idx: *const root::idx_vector) -> Self {
            let mut __bindgen_tmp = ::std::mem::uninitialized();
            PermMatrix_PermMatrix3(&mut __bindgen_tmp, idx);
            __bindgen_tmp
        }
        #[inline]
        pub unsafe fn new4(idx: *const root::idx_vector, colp: bool,
                           n: root::octave_idx_type) -> Self {
            let mut __bindgen_tmp = ::std::mem::uninitialized();
            PermMatrix_PermMatrix4(&mut __bindgen_tmp, idx, colp, n);
            __bindgen_tmp
        }
    }
    #[repr(C)]
    #[derive(Debug)]
    pub struct octave_local_buffer<T> {
        pub data: *mut T,
    }
    #[repr(C)]
    pub struct octave_chunk_buffer__bindgen_vtable(::std::os::raw::c_void);
    #[repr(C)]
    #[derive(Debug)]
    pub struct octave_chunk_buffer {
        pub vtable_: *const octave_chunk_buffer__bindgen_vtable,
        pub cnk: *mut ::std::os::raw::c_char,
        pub dat: *mut ::std::os::raw::c_char,
    }
    extern "C" {
        #[link_name = "_ZN19octave_chunk_buffer10chunk_sizeE"]
        pub static octave_chunk_buffer_chunk_size: usize;
    }
    extern "C" {
        #[link_name = "_ZN19octave_chunk_buffer3topE"]
        pub static mut octave_chunk_buffer_top: *mut ::std::os::raw::c_char;
    }
    extern "C" {
        #[link_name = "_ZN19octave_chunk_buffer5chunkE"]
        pub static mut octave_chunk_buffer_chunk: *mut ::std::os::raw::c_char;
    }
    extern "C" {
        #[link_name = "_ZN19octave_chunk_buffer4leftE"]
        pub static mut octave_chunk_buffer_left: usize;
    }
    extern "C" {
        #[link_name = "_ZN19octave_chunk_buffer6activeE"]
        pub static mut octave_chunk_buffer_active: usize;
    }
    #[test]
    fn bindgen_test_layout_octave_chunk_buffer() {
        assert_eq!(::std::mem::size_of::<octave_chunk_buffer>() , 24usize ,
                   concat ! (
                   "Size of: " , stringify ! ( octave_chunk_buffer ) ));
        assert_eq! (::std::mem::align_of::<octave_chunk_buffer>() , 8usize ,
                    concat ! (
                    "Alignment of " , stringify ! ( octave_chunk_buffer ) ));
        assert_eq! (unsafe {
                    & ( * ( 0 as * const octave_chunk_buffer ) ) . cnk as *
                    const _ as usize } , 8usize , concat ! (
                    "Alignment of field: " , stringify ! ( octave_chunk_buffer
                    ) , "::" , stringify ! ( cnk ) ));
        assert_eq! (unsafe {
                    & ( * ( 0 as * const octave_chunk_buffer ) ) . dat as *
                    const _ as usize } , 16usize , concat ! (
                    "Alignment of field: " , stringify ! ( octave_chunk_buffer
                    ) , "::" , stringify ! ( dat ) ));
    }
    extern "C" {
        #[link_name = "_ZN19octave_chunk_buffer5clearEv"]
        pub fn octave_chunk_buffer_clear();
    }
    extern "C" {
        #[link_name = "_ZN19octave_chunk_bufferC1Ey"]
        pub fn octave_chunk_buffer_octave_chunk_buffer(this:
                                                           *mut root::octave_chunk_buffer,
                                                       size: usize);
    }
    impl octave_chunk_buffer {
        #[inline]
        pub unsafe fn clear() { octave_chunk_buffer_clear() }
        #[inline]
        pub unsafe fn new(size: usize) -> Self {
            let mut __bindgen_tmp = ::std::mem::uninitialized();
            octave_chunk_buffer_octave_chunk_buffer(&mut __bindgen_tmp, size);
            __bindgen_tmp
        }
    }
    #[test]
    fn __bindgen_test_layout_octave_local_buffer_instantiation_35406() {
        assert_eq!(::std::mem::size_of::<root::octave_local_buffer<bool>>() ,
                   24usize , concat ! (
                   "Size of template specialization: " , stringify ! (
                   root::octave_local_buffer<bool> ) ));
        assert_eq!(::std::mem::align_of::<root::octave_local_buffer<bool>>() ,
                   8usize , concat ! (
                   "Alignment of template specialization: " , stringify ! (
                   root::octave_local_buffer<bool> ) ));
    }
    #[test]
    fn __bindgen_test_layout_octave_local_buffer_instantiation_35410() {
        assert_eq!(::std::mem::size_of::<root::octave_local_buffer<::std::os::raw::c_char>>()
                   , 24usize , concat ! (
                   "Size of template specialization: " , stringify ! (
                   root::octave_local_buffer<::std::os::raw::c_char> ) ));
        assert_eq!(::std::mem::align_of::<root::octave_local_buffer<::std::os::raw::c_char>>()
                   , 8usize , concat ! (
                   "Alignment of template specialization: " , stringify ! (
                   root::octave_local_buffer<::std::os::raw::c_char> ) ));
    }
    #[test]
    fn __bindgen_test_layout_octave_local_buffer_instantiation_35414() {
        assert_eq!(::std::mem::size_of::<root::octave_local_buffer<::std::os::raw::c_ushort>>()
                   , 24usize , concat ! (
                   "Size of template specialization: " , stringify ! (
                   root::octave_local_buffer<::std::os::raw::c_ushort> ) ));
        assert_eq!(::std::mem::align_of::<root::octave_local_buffer<::std::os::raw::c_ushort>>()
                   , 8usize , concat ! (
                   "Alignment of template specialization: " , stringify ! (
                   root::octave_local_buffer<::std::os::raw::c_ushort> ) ));
    }
    #[test]
    fn __bindgen_test_layout_octave_local_buffer_instantiation_35418() {
        assert_eq!(::std::mem::size_of::<root::octave_local_buffer<::std::os::raw::c_short>>()
                   , 24usize , concat ! (
                   "Size of template specialization: " , stringify ! (
                   root::octave_local_buffer<::std::os::raw::c_short> ) ));
        assert_eq!(::std::mem::align_of::<root::octave_local_buffer<::std::os::raw::c_short>>()
                   , 8usize , concat ! (
                   "Alignment of template specialization: " , stringify ! (
                   root::octave_local_buffer<::std::os::raw::c_short> ) ));
    }
    #[test]
    fn __bindgen_test_layout_octave_local_buffer_instantiation_35422() {
        assert_eq!(::std::mem::size_of::<root::octave_local_buffer<::std::os::raw::c_int>>()
                   , 24usize , concat ! (
                   "Size of template specialization: " , stringify ! (
                   root::octave_local_buffer<::std::os::raw::c_int> ) ));
        assert_eq!(::std::mem::align_of::<root::octave_local_buffer<::std::os::raw::c_int>>()
                   , 8usize , concat ! (
                   "Alignment of template specialization: " , stringify ! (
                   root::octave_local_buffer<::std::os::raw::c_int> ) ));
    }
    #[test]
    fn __bindgen_test_layout_octave_local_buffer_instantiation_35426() {
        assert_eq!(::std::mem::size_of::<root::octave_local_buffer<::std::os::raw::c_uint>>()
                   , 24usize , concat ! (
                   "Size of template specialization: " , stringify ! (
                   root::octave_local_buffer<::std::os::raw::c_uint> ) ));
        assert_eq!(::std::mem::align_of::<root::octave_local_buffer<::std::os::raw::c_uint>>()
                   , 8usize , concat ! (
                   "Alignment of template specialization: " , stringify ! (
                   root::octave_local_buffer<::std::os::raw::c_uint> ) ));
    }
    #[test]
    fn __bindgen_test_layout_octave_local_buffer_instantiation_35430() {
        assert_eq!(::std::mem::size_of::<root::octave_local_buffer<::std::os::raw::c_long>>()
                   , 24usize , concat ! (
                   "Size of template specialization: " , stringify ! (
                   root::octave_local_buffer<::std::os::raw::c_long> ) ));
        assert_eq!(::std::mem::align_of::<root::octave_local_buffer<::std::os::raw::c_long>>()
                   , 8usize , concat ! (
                   "Alignment of template specialization: " , stringify ! (
                   root::octave_local_buffer<::std::os::raw::c_long> ) ));
    }
    #[test]
    fn __bindgen_test_layout_octave_local_buffer_instantiation_35434() {
        assert_eq!(::std::mem::size_of::<root::octave_local_buffer<::std::os::raw::c_ulong>>()
                   , 24usize , concat ! (
                   "Size of template specialization: " , stringify ! (
                   root::octave_local_buffer<::std::os::raw::c_ulong> ) ));
        assert_eq!(::std::mem::align_of::<root::octave_local_buffer<::std::os::raw::c_ulong>>()
                   , 8usize , concat ! (
                   "Alignment of template specialization: " , stringify ! (
                   root::octave_local_buffer<::std::os::raw::c_ulong> ) ));
    }
    #[test]
    fn __bindgen_test_layout_octave_local_buffer_instantiation_35438() {
        assert_eq!(::std::mem::size_of::<root::octave_local_buffer<f32>>() ,
                   24usize , concat ! (
                   "Size of template specialization: " , stringify ! (
                   root::octave_local_buffer<f32> ) ));
        assert_eq!(::std::mem::align_of::<root::octave_local_buffer<f32>>() ,
                   8usize , concat ! (
                   "Alignment of template specialization: " , stringify ! (
                   root::octave_local_buffer<f32> ) ));
    }
    #[test]
    fn __bindgen_test_layout_octave_local_buffer_instantiation_35442() {
        assert_eq!(::std::mem::size_of::<root::octave_local_buffer<f64>>() ,
                   24usize , concat ! (
                   "Size of template specialization: " , stringify ! (
                   root::octave_local_buffer<f64> ) ));
        assert_eq!(::std::mem::align_of::<root::octave_local_buffer<f64>>() ,
                   8usize , concat ! (
                   "Alignment of template specialization: " , stringify ! (
                   root::octave_local_buffer<f64> ) ));
    }
    #[test]
    fn __bindgen_test_layout_octave_local_buffer_instantiation_35446() {
        assert_eq!(::std::mem::size_of::<root::octave_local_buffer<root::std::complex<f64>>>()
                   , 24usize , concat ! (
                   "Size of template specialization: " , stringify ! (
                   root::octave_local_buffer<root::std::complex<f64>> ) ));
        assert_eq!(::std::mem::align_of::<root::octave_local_buffer<root::std::complex<f64>>>()
                   , 8usize , concat ! (
                   "Alignment of template specialization: " , stringify ! (
                   root::octave_local_buffer<root::std::complex<f64>> ) ));
    }
    #[test]
    fn __bindgen_test_layout_octave_local_buffer_instantiation_35449() {
        assert_eq!(::std::mem::size_of::<root::octave_local_buffer<root::std::complex<f32>>>()
                   , 24usize , concat ! (
                   "Size of template specialization: " , stringify ! (
                   root::octave_local_buffer<root::std::complex<f32>> ) ));
        assert_eq!(::std::mem::align_of::<root::octave_local_buffer<root::std::complex<f32>>>()
                   , 8usize , concat ! (
                   "Alignment of template specialization: " , stringify ! (
                   root::octave_local_buffer<root::std::complex<f32>> ) ));
    }
    #[repr(C)]
    #[derive(Debug, Copy)]
    pub struct octave_int_cmp_op {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct octave_int_cmp_op_prom {
        pub _address: u8,
    }
    pub type octave_int_cmp_op_prom_type = u8;
    #[repr(C)]
    #[derive(Debug, Copy)]
    pub struct octave_int_cmp_op_lt {
        pub _address: u8,
    }
    pub const octave_int_cmp_op_lt_ltval: bool = true;
    pub const octave_int_cmp_op_lt_gtval: bool = false;
    #[test]
    fn bindgen_test_layout_octave_int_cmp_op_lt() {
        assert_eq!(::std::mem::size_of::<octave_int_cmp_op_lt>() , 1usize ,
                   concat ! (
                   "Size of: " , stringify ! ( octave_int_cmp_op_lt ) ));
        assert_eq! (::std::mem::align_of::<octave_int_cmp_op_lt>() , 1usize ,
                    concat ! (
                    "Alignment of " , stringify ! ( octave_int_cmp_op_lt ) ));
    }
    impl Clone for octave_int_cmp_op_lt {
        fn clone(&self) -> Self { *self }
    }
    #[repr(C)]
    #[derive(Debug, Copy)]
    pub struct octave_int_cmp_op_le {
        pub _address: u8,
    }
    pub const octave_int_cmp_op_le_ltval: bool = true;
    pub const octave_int_cmp_op_le_gtval: bool = false;
    #[test]
    fn bindgen_test_layout_octave_int_cmp_op_le() {
        assert_eq!(::std::mem::size_of::<octave_int_cmp_op_le>() , 1usize ,
                   concat ! (
                   "Size of: " , stringify ! ( octave_int_cmp_op_le ) ));
        assert_eq! (::std::mem::align_of::<octave_int_cmp_op_le>() , 1usize ,
                    concat ! (
                    "Alignment of " , stringify ! ( octave_int_cmp_op_le ) ));
    }
    impl Clone for octave_int_cmp_op_le {
        fn clone(&self) -> Self { *self }
    }
    #[repr(C)]
    #[derive(Debug, Copy)]
    pub struct octave_int_cmp_op_gt {
        pub _address: u8,
    }
    pub const octave_int_cmp_op_gt_ltval: bool = false;
    pub const octave_int_cmp_op_gt_gtval: bool = true;
    #[test]
    fn bindgen_test_layout_octave_int_cmp_op_gt() {
        assert_eq!(::std::mem::size_of::<octave_int_cmp_op_gt>() , 1usize ,
                   concat ! (
                   "Size of: " , stringify ! ( octave_int_cmp_op_gt ) ));
        assert_eq! (::std::mem::align_of::<octave_int_cmp_op_gt>() , 1usize ,
                    concat ! (
                    "Alignment of " , stringify ! ( octave_int_cmp_op_gt ) ));
    }
    impl Clone for octave_int_cmp_op_gt {
        fn clone(&self) -> Self { *self }
    }
    #[repr(C)]
    #[derive(Debug, Copy)]
    pub struct octave_int_cmp_op_ge {
        pub _address: u8,
    }
    pub const octave_int_cmp_op_ge_ltval: bool = false;
    pub const octave_int_cmp_op_ge_gtval: bool = true;
    #[test]
    fn bindgen_test_layout_octave_int_cmp_op_ge() {
        assert_eq!(::std::mem::size_of::<octave_int_cmp_op_ge>() , 1usize ,
                   concat ! (
                   "Size of: " , stringify ! ( octave_int_cmp_op_ge ) ));
        assert_eq! (::std::mem::align_of::<octave_int_cmp_op_ge>() , 1usize ,
                    concat ! (
                    "Alignment of " , stringify ! ( octave_int_cmp_op_ge ) ));
    }
    impl Clone for octave_int_cmp_op_ge {
        fn clone(&self) -> Self { *self }
    }
    #[repr(C)]
    #[derive(Debug, Copy)]
    pub struct octave_int_cmp_op_eq {
        pub _address: u8,
    }
    pub const octave_int_cmp_op_eq_ltval: bool = false;
    pub const octave_int_cmp_op_eq_gtval: bool = false;
    #[test]
    fn bindgen_test_layout_octave_int_cmp_op_eq() {
        assert_eq!(::std::mem::size_of::<octave_int_cmp_op_eq>() , 1usize ,
                   concat ! (
                   "Size of: " , stringify ! ( octave_int_cmp_op_eq ) ));
        assert_eq! (::std::mem::align_of::<octave_int_cmp_op_eq>() , 1usize ,
                    concat ! (
                    "Alignment of " , stringify ! ( octave_int_cmp_op_eq ) ));
    }
    impl Clone for octave_int_cmp_op_eq {
        fn clone(&self) -> Self { *self }
    }
    #[repr(C)]
    #[derive(Debug, Copy)]
    pub struct octave_int_cmp_op_ne {
        pub _address: u8,
    }
    pub const octave_int_cmp_op_ne_ltval: bool = true;
    pub const octave_int_cmp_op_ne_gtval: bool = true;
    #[test]
    fn bindgen_test_layout_octave_int_cmp_op_ne() {
        assert_eq!(::std::mem::size_of::<octave_int_cmp_op_ne>() , 1usize ,
                   concat ! (
                   "Size of: " , stringify ! ( octave_int_cmp_op_ne ) ));
        assert_eq! (::std::mem::align_of::<octave_int_cmp_op_ne>() , 1usize ,
                    concat ! (
                    "Alignment of " , stringify ! ( octave_int_cmp_op_ne ) ));
    }
    impl Clone for octave_int_cmp_op_ne {
        fn clone(&self) -> Self { *self }
    }
    #[repr(C)]
    #[derive(Debug, Copy)]
    pub struct octave_int_cmp_op_ct {
        pub _address: u8,
    }
    pub const octave_int_cmp_op_ct_ltval: bool = true;
    pub const octave_int_cmp_op_ct_gtval: bool = true;
    #[test]
    fn bindgen_test_layout_octave_int_cmp_op_ct() {
        assert_eq!(::std::mem::size_of::<octave_int_cmp_op_ct>() , 1usize ,
                   concat ! (
                   "Size of: " , stringify ! ( octave_int_cmp_op_ct ) ));
        assert_eq! (::std::mem::align_of::<octave_int_cmp_op_ct>() , 1usize ,
                    concat ! (
                    "Alignment of " , stringify ! ( octave_int_cmp_op_ct ) ));
    }
    impl Clone for octave_int_cmp_op_ct {
        fn clone(&self) -> Self { *self }
    }
    #[repr(C)]
    #[derive(Debug, Copy)]
    pub struct octave_int_cmp_op_cf {
        pub _address: u8,
    }
    pub const octave_int_cmp_op_cf_ltval: bool = false;
    pub const octave_int_cmp_op_cf_gtval: bool = false;
    #[test]
    fn bindgen_test_layout_octave_int_cmp_op_cf() {
        assert_eq!(::std::mem::size_of::<octave_int_cmp_op_cf>() , 1usize ,
                   concat ! (
                   "Size of: " , stringify ! ( octave_int_cmp_op_cf ) ));
        assert_eq! (::std::mem::align_of::<octave_int_cmp_op_cf>() , 1usize ,
                    concat ! (
                    "Alignment of " , stringify ! ( octave_int_cmp_op_cf ) ));
    }
    impl Clone for octave_int_cmp_op_cf {
        fn clone(&self) -> Self { *self }
    }
    #[test]
    fn bindgen_test_layout_octave_int_cmp_op() {
        assert_eq!(::std::mem::size_of::<octave_int_cmp_op>() , 1usize ,
                   concat ! ( "Size of: " , stringify ! ( octave_int_cmp_op )
                   ));
        assert_eq! (::std::mem::align_of::<octave_int_cmp_op>() , 1usize ,
                    concat ! (
                    "Alignment of " , stringify ! ( octave_int_cmp_op ) ));
    }
    impl Clone for octave_int_cmp_op {
        fn clone(&self) -> Self { *self }
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct octave_int_base {
        pub _address: u8,
    }
    #[repr(C)]
    pub struct octave_int_arith {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug)]
    pub struct MArray<T> {
        pub _base: root::Array<T>,
    }
    #[repr(C)]
    #[derive(Debug)]
    pub struct MSparse<T> {
        pub _base: root::Sparse<T>,
    }
    #[repr(C)]
    #[derive(Debug)]
    pub struct Matrix {
        pub _base: root::NDArray,
    }
    pub type Matrix_column_vector_type = root::ColumnVector;
    pub type Matrix_row_vector_type = root::RowVector;
    pub type Matrix_real_column_vector_type = root::ColumnVector;
    pub type Matrix_real_row_vector_type = root::RowVector;
    pub type Matrix_real_matrix_type = root::Matrix;
    pub type Matrix_complex_matrix_type = root::ComplexMatrix;
    pub type Matrix_real_diag_matrix_type = root::DiagMatrix;
    pub type Matrix_complex_diag_matrix_type = root::ComplexDiagMatrix;
    pub type Matrix_real_elt_type = f64;
    pub type Matrix_complex_elt_type = root::Complex;
    pub type Matrix_solve_singularity_handler =
        ::std::option::Option<unsafe extern "C" fn(rcon: f64)>;
    #[test]
    fn bindgen_test_layout_Matrix() {
        assert_eq!(::std::mem::size_of::<Matrix>() , 40usize , concat ! (
                   "Size of: " , stringify ! ( Matrix ) ));
        assert_eq! (::std::mem::align_of::<Matrix>() , 8usize , concat ! (
                    "Alignment of " , stringify ! ( Matrix ) ));
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix12is_symmetricEv"]
        pub fn Matrix_is_symmetric(this: *const root::Matrix) -> bool;
    }
    extern "C" {
        #[link_name = "_ZN6Matrix6insertERKS_ii"]
        pub fn Matrix_insert(this: *mut root::Matrix, a: *const root::Matrix,
                             r: root::octave_idx_type,
                             c: root::octave_idx_type) -> *mut root::Matrix;
    }
    extern "C" {
        #[link_name = "_ZN6Matrix6insertERK9RowVectorii"]
        pub fn Matrix_insert1(this: *mut root::Matrix,
                              a: *const root::RowVector,
                              r: root::octave_idx_type,
                              c: root::octave_idx_type) -> *mut root::Matrix;
    }
    extern "C" {
        #[link_name = "_ZN6Matrix6insertERK12ColumnVectorii"]
        pub fn Matrix_insert2(this: *mut root::Matrix,
                              a: *const root::ColumnVector,
                              r: root::octave_idx_type,
                              c: root::octave_idx_type) -> *mut root::Matrix;
    }
    extern "C" {
        #[link_name = "_ZN6Matrix6insertERK10DiagMatrixii"]
        pub fn Matrix_insert3(this: *mut root::Matrix,
                              a: *const root::DiagMatrix,
                              r: root::octave_idx_type,
                              c: root::octave_idx_type) -> *mut root::Matrix;
    }
    extern "C" {
        #[link_name = "_ZN6Matrix4fillEd"]
        pub fn Matrix_fill(this: *mut root::Matrix, val: f64)
         -> *mut root::Matrix;
    }
    extern "C" {
        #[link_name = "_ZN6Matrix4fillEdiiii"]
        pub fn Matrix_fill1(this: *mut root::Matrix, val: f64,
                            r1: root::octave_idx_type,
                            c1: root::octave_idx_type,
                            r2: root::octave_idx_type,
                            c2: root::octave_idx_type) -> *mut root::Matrix;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix6appendERKS_"]
        pub fn Matrix_append(this: *const root::Matrix,
                             a: *const root::Matrix) -> root::Matrix;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix6appendERK9RowVector"]
        pub fn Matrix_append1(this: *const root::Matrix,
                              a: *const root::RowVector) -> root::Matrix;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix6appendERK12ColumnVector"]
        pub fn Matrix_append2(this: *const root::Matrix,
                              a: *const root::ColumnVector) -> root::Matrix;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix6appendERK10DiagMatrix"]
        pub fn Matrix_append3(this: *const root::Matrix,
                              a: *const root::DiagMatrix) -> root::Matrix;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix5stackERKS_"]
        pub fn Matrix_stack(this: *const root::Matrix, a: *const root::Matrix)
         -> root::Matrix;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix5stackERK9RowVector"]
        pub fn Matrix_stack1(this: *const root::Matrix,
                             a: *const root::RowVector) -> root::Matrix;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix5stackERK12ColumnVector"]
        pub fn Matrix_stack2(this: *const root::Matrix,
                             a: *const root::ColumnVector) -> root::Matrix;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix5stackERK10DiagMatrix"]
        pub fn Matrix_stack3(this: *const root::Matrix,
                             a: *const root::DiagMatrix) -> root::Matrix;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix7extractEiiii"]
        pub fn Matrix_extract(this: *const root::Matrix,
                              r1: root::octave_idx_type,
                              c1: root::octave_idx_type,
                              r2: root::octave_idx_type,
                              c2: root::octave_idx_type) -> root::Matrix;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix9extract_nEiiii"]
        pub fn Matrix_extract_n(this: *const root::Matrix,
                                r1: root::octave_idx_type,
                                c1: root::octave_idx_type,
                                nr: root::octave_idx_type,
                                nc: root::octave_idx_type) -> root::Matrix;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix3rowEi"]
        pub fn Matrix_row(this: *const root::Matrix, i: root::octave_idx_type)
         -> root::RowVector;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix6columnEi"]
        pub fn Matrix_column(this: *const root::Matrix,
                             i: root::octave_idx_type) -> root::ColumnVector;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix7inverseEv"]
        pub fn Matrix_inverse(this: *const root::Matrix) -> root::Matrix;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix7inverseERi"]
        pub fn Matrix_inverse1(this: *const root::Matrix,
                               info: *mut root::octave_idx_type)
         -> root::Matrix;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix7inverseERiRdbb"]
        pub fn Matrix_inverse2(this: *const root::Matrix,
                               info: *mut root::octave_idx_type,
                               rcon: *mut f64, force: bool, calc_cond: bool)
         -> root::Matrix;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix7inverseER10MatrixType"]
        pub fn Matrix_inverse3(this: *const root::Matrix,
                               mattype: *mut root::MatrixType)
         -> root::Matrix;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix7inverseER10MatrixTypeRi"]
        pub fn Matrix_inverse4(this: *const root::Matrix,
                               mattype: *mut root::MatrixType,
                               info: *mut root::octave_idx_type)
         -> root::Matrix;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix7inverseER10MatrixTypeRiRdbb"]
        pub fn Matrix_inverse5(this: *const root::Matrix,
                               mattype: *mut root::MatrixType,
                               info: *mut root::octave_idx_type,
                               rcon: *mut f64, force: bool, calc_cond: bool)
         -> root::Matrix;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix14pseudo_inverseEd"]
        pub fn Matrix_pseudo_inverse(this: *const root::Matrix, tol: f64)
         -> root::Matrix;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix7fourierEv"]
        pub fn Matrix_fourier(this: *const root::Matrix)
         -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix8ifourierEv"]
        pub fn Matrix_ifourier(this: *const root::Matrix)
         -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix9fourier2dEv"]
        pub fn Matrix_fourier2d(this: *const root::Matrix)
         -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix10ifourier2dEv"]
        pub fn Matrix_ifourier2d(this: *const root::Matrix)
         -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix11determinantEv"]
        pub fn Matrix_determinant(this: *const root::Matrix) -> root::DET;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix11determinantERi"]
        pub fn Matrix_determinant1(this: *const root::Matrix,
                                   info: *mut root::octave_idx_type)
         -> root::DET;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix11determinantERiRdb"]
        pub fn Matrix_determinant2(this: *const root::Matrix,
                                   info: *mut root::octave_idx_type,
                                   rcon: *mut f64, calc_cond: bool)
         -> root::DET;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix11determinantER10MatrixTypeRiRdb"]
        pub fn Matrix_determinant3(this: *const root::Matrix,
                                   mattype: *mut root::MatrixType,
                                   info: *mut root::octave_idx_type,
                                   rcon: *mut f64, calc_cond: bool)
         -> root::DET;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix5rcondEv"]
        pub fn Matrix_rcond(this: *const root::Matrix) -> f64;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix5rcondER10MatrixType"]
        pub fn Matrix_rcond1(this: *const root::Matrix,
                             mattype: *mut root::MatrixType) -> f64;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix5solveER10MatrixTypeRKS_"]
        pub fn Matrix_solve(this: *const root::Matrix,
                            typ: *mut root::MatrixType,
                            b: *const root::Matrix) -> root::Matrix;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix5solveER10MatrixTypeRKS_Ri"]
        pub fn Matrix_solve1(this: *const root::Matrix,
                             typ: *mut root::MatrixType,
                             b: *const root::Matrix,
                             info: *mut root::octave_idx_type)
         -> root::Matrix;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix5solveER10MatrixTypeRKS_RiRd"]
        pub fn Matrix_solve2(this: *const root::Matrix,
                             typ: *mut root::MatrixType,
                             b: *const root::Matrix,
                             info: *mut root::octave_idx_type, rcon: *mut f64)
         -> root::Matrix;
    }
    extern "C" {
        #[link_name =
              "_ZNK6Matrix5solveER10MatrixTypeRKS_RiRdPFvdEb15blas_trans_type"]
        pub fn Matrix_solve3(this: *const root::Matrix,
                             typ: *mut root::MatrixType,
                             b: *const root::Matrix,
                             info: *mut root::octave_idx_type, rcon: *mut f64,
                             sing_handler:
                                 root::Matrix_solve_singularity_handler,
                             singular_fallback: bool,
                             transt: root::blas_trans_type) -> root::Matrix;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix5solveER10MatrixTypeRK13ComplexMatrix"]
        pub fn Matrix_solve4(this: *const root::Matrix,
                             typ: *mut root::MatrixType,
                             b: *const root::ComplexMatrix)
         -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix5solveER10MatrixTypeRK13ComplexMatrixRi"]
        pub fn Matrix_solve5(this: *const root::Matrix,
                             typ: *mut root::MatrixType,
                             b: *const root::ComplexMatrix,
                             info: *mut root::octave_idx_type)
         -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix5solveER10MatrixTypeRK13ComplexMatrixRiRd"]
        pub fn Matrix_solve6(this: *const root::Matrix,
                             typ: *mut root::MatrixType,
                             b: *const root::ComplexMatrix,
                             info: *mut root::octave_idx_type, rcon: *mut f64)
         -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name =
              "_ZNK6Matrix5solveER10MatrixTypeRK13ComplexMatrixRiRdPFvdEb15blas_trans_type"]
        pub fn Matrix_solve7(this: *const root::Matrix,
                             typ: *mut root::MatrixType,
                             b: *const root::ComplexMatrix,
                             info: *mut root::octave_idx_type, rcon: *mut f64,
                             sing_handler:
                                 root::Matrix_solve_singularity_handler,
                             singular_fallback: bool,
                             transt: root::blas_trans_type)
         -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix5solveER10MatrixTypeRK12ColumnVector"]
        pub fn Matrix_solve8(this: *const root::Matrix,
                             typ: *mut root::MatrixType,
                             b: *const root::ColumnVector)
         -> root::ColumnVector;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix5solveER10MatrixTypeRK12ColumnVectorRi"]
        pub fn Matrix_solve9(this: *const root::Matrix,
                             typ: *mut root::MatrixType,
                             b: *const root::ColumnVector,
                             info: *mut root::octave_idx_type)
         -> root::ColumnVector;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix5solveER10MatrixTypeRK12ColumnVectorRiRd"]
        pub fn Matrix_solve10(this: *const root::Matrix,
                              typ: *mut root::MatrixType,
                              b: *const root::ColumnVector,
                              info: *mut root::octave_idx_type,
                              rcon: *mut f64) -> root::ColumnVector;
    }
    extern "C" {
        #[link_name =
              "_ZNK6Matrix5solveER10MatrixTypeRK12ColumnVectorRiRdPFvdE15blas_trans_type"]
        pub fn Matrix_solve11(this: *const root::Matrix,
                              typ: *mut root::MatrixType,
                              b: *const root::ColumnVector,
                              info: *mut root::octave_idx_type,
                              rcon: *mut f64,
                              sing_handler:
                                  root::Matrix_solve_singularity_handler,
                              transt: root::blas_trans_type)
         -> root::ColumnVector;
    }
    extern "C" {
        #[link_name =
              "_ZNK6Matrix5solveER10MatrixTypeRK19ComplexColumnVector"]
        pub fn Matrix_solve12(this: *const root::Matrix,
                              typ: *mut root::MatrixType,
                              b: *const root::ComplexColumnVector)
         -> root::ComplexColumnVector;
    }
    extern "C" {
        #[link_name =
              "_ZNK6Matrix5solveER10MatrixTypeRK19ComplexColumnVectorRi"]
        pub fn Matrix_solve13(this: *const root::Matrix,
                              typ: *mut root::MatrixType,
                              b: *const root::ComplexColumnVector,
                              info: *mut root::octave_idx_type)
         -> root::ComplexColumnVector;
    }
    extern "C" {
        #[link_name =
              "_ZNK6Matrix5solveER10MatrixTypeRK19ComplexColumnVectorRiRd"]
        pub fn Matrix_solve14(this: *const root::Matrix,
                              typ: *mut root::MatrixType,
                              b: *const root::ComplexColumnVector,
                              info: *mut root::octave_idx_type,
                              rcon: *mut f64) -> root::ComplexColumnVector;
    }
    extern "C" {
        #[link_name =
              "_ZNK6Matrix5solveER10MatrixTypeRK19ComplexColumnVectorRiRdPFvdE15blas_trans_type"]
        pub fn Matrix_solve15(this: *const root::Matrix,
                              typ: *mut root::MatrixType,
                              b: *const root::ComplexColumnVector,
                              info: *mut root::octave_idx_type,
                              rcon: *mut f64,
                              sing_handler:
                                  root::Matrix_solve_singularity_handler,
                              transt: root::blas_trans_type)
         -> root::ComplexColumnVector;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix5solveERKS_"]
        pub fn Matrix_solve16(this: *const root::Matrix,
                              b: *const root::Matrix) -> root::Matrix;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix5solveERKS_Ri"]
        pub fn Matrix_solve17(this: *const root::Matrix,
                              b: *const root::Matrix,
                              info: *mut root::octave_idx_type)
         -> root::Matrix;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix5solveERKS_RiRd"]
        pub fn Matrix_solve18(this: *const root::Matrix,
                              b: *const root::Matrix,
                              info: *mut root::octave_idx_type,
                              rcon: *mut f64) -> root::Matrix;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix5solveERKS_RiRdPFvdE15blas_trans_type"]
        pub fn Matrix_solve19(this: *const root::Matrix,
                              b: *const root::Matrix,
                              info: *mut root::octave_idx_type,
                              rcon: *mut f64,
                              sing_handler:
                                  root::Matrix_solve_singularity_handler,
                              transt: root::blas_trans_type) -> root::Matrix;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix5solveERK13ComplexMatrix"]
        pub fn Matrix_solve20(this: *const root::Matrix,
                              b: *const root::ComplexMatrix)
         -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix5solveERK13ComplexMatrixRi"]
        pub fn Matrix_solve21(this: *const root::Matrix,
                              b: *const root::ComplexMatrix,
                              info: *mut root::octave_idx_type)
         -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix5solveERK13ComplexMatrixRiRd"]
        pub fn Matrix_solve22(this: *const root::Matrix,
                              b: *const root::ComplexMatrix,
                              info: *mut root::octave_idx_type,
                              rcon: *mut f64) -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name =
              "_ZNK6Matrix5solveERK13ComplexMatrixRiRdPFvdE15blas_trans_type"]
        pub fn Matrix_solve23(this: *const root::Matrix,
                              b: *const root::ComplexMatrix,
                              info: *mut root::octave_idx_type,
                              rcon: *mut f64,
                              sing_handler:
                                  root::Matrix_solve_singularity_handler,
                              transt: root::blas_trans_type)
         -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix5solveERK12ColumnVector"]
        pub fn Matrix_solve24(this: *const root::Matrix,
                              b: *const root::ColumnVector)
         -> root::ColumnVector;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix5solveERK12ColumnVectorRi"]
        pub fn Matrix_solve25(this: *const root::Matrix,
                              b: *const root::ColumnVector,
                              info: *mut root::octave_idx_type)
         -> root::ColumnVector;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix5solveERK12ColumnVectorRiRd"]
        pub fn Matrix_solve26(this: *const root::Matrix,
                              b: *const root::ColumnVector,
                              info: *mut root::octave_idx_type,
                              rcon: *mut f64) -> root::ColumnVector;
    }
    extern "C" {
        #[link_name =
              "_ZNK6Matrix5solveERK12ColumnVectorRiRdPFvdE15blas_trans_type"]
        pub fn Matrix_solve27(this: *const root::Matrix,
                              b: *const root::ColumnVector,
                              info: *mut root::octave_idx_type,
                              rcon: *mut f64,
                              sing_handler:
                                  root::Matrix_solve_singularity_handler,
                              transt: root::blas_trans_type)
         -> root::ColumnVector;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix5solveERK19ComplexColumnVector"]
        pub fn Matrix_solve28(this: *const root::Matrix,
                              b: *const root::ComplexColumnVector)
         -> root::ComplexColumnVector;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix5solveERK19ComplexColumnVectorRi"]
        pub fn Matrix_solve29(this: *const root::Matrix,
                              b: *const root::ComplexColumnVector,
                              info: *mut root::octave_idx_type)
         -> root::ComplexColumnVector;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix5solveERK19ComplexColumnVectorRiRd"]
        pub fn Matrix_solve30(this: *const root::Matrix,
                              b: *const root::ComplexColumnVector,
                              info: *mut root::octave_idx_type,
                              rcon: *mut f64) -> root::ComplexColumnVector;
    }
    extern "C" {
        #[link_name =
              "_ZNK6Matrix5solveERK19ComplexColumnVectorRiRdPFvdE15blas_trans_type"]
        pub fn Matrix_solve31(this: *const root::Matrix,
                              b: *const root::ComplexColumnVector,
                              info: *mut root::octave_idx_type,
                              rcon: *mut f64,
                              sing_handler:
                                  root::Matrix_solve_singularity_handler,
                              transt: root::blas_trans_type)
         -> root::ComplexColumnVector;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix7lssolveERKS_"]
        pub fn Matrix_lssolve(this: *const root::Matrix,
                              b: *const root::Matrix) -> root::Matrix;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix7lssolveERKS_Ri"]
        pub fn Matrix_lssolve1(this: *const root::Matrix,
                               b: *const root::Matrix,
                               info: *mut root::octave_idx_type)
         -> root::Matrix;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix7lssolveERKS_RiS2_"]
        pub fn Matrix_lssolve2(this: *const root::Matrix,
                               b: *const root::Matrix,
                               info: *mut root::octave_idx_type,
                               rank: *mut root::octave_idx_type)
         -> root::Matrix;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix7lssolveERKS_RiS2_Rd"]
        pub fn Matrix_lssolve3(this: *const root::Matrix,
                               b: *const root::Matrix,
                               info: *mut root::octave_idx_type,
                               rank: *mut root::octave_idx_type,
                               rcon: *mut f64) -> root::Matrix;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix7lssolveERK13ComplexMatrix"]
        pub fn Matrix_lssolve4(this: *const root::Matrix,
                               b: *const root::ComplexMatrix)
         -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix7lssolveERK13ComplexMatrixRi"]
        pub fn Matrix_lssolve5(this: *const root::Matrix,
                               b: *const root::ComplexMatrix,
                               info: *mut root::octave_idx_type)
         -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix7lssolveERK13ComplexMatrixRiS3_"]
        pub fn Matrix_lssolve6(this: *const root::Matrix,
                               b: *const root::ComplexMatrix,
                               info: *mut root::octave_idx_type,
                               rank: *mut root::octave_idx_type)
         -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix7lssolveERK13ComplexMatrixRiS3_Rd"]
        pub fn Matrix_lssolve7(this: *const root::Matrix,
                               b: *const root::ComplexMatrix,
                               info: *mut root::octave_idx_type,
                               rank: *mut root::octave_idx_type,
                               rcon: *mut f64) -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix7lssolveERK12ColumnVector"]
        pub fn Matrix_lssolve8(this: *const root::Matrix,
                               b: *const root::ColumnVector)
         -> root::ColumnVector;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix7lssolveERK12ColumnVectorRi"]
        pub fn Matrix_lssolve9(this: *const root::Matrix,
                               b: *const root::ColumnVector,
                               info: *mut root::octave_idx_type)
         -> root::ColumnVector;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix7lssolveERK12ColumnVectorRiS3_"]
        pub fn Matrix_lssolve10(this: *const root::Matrix,
                                b: *const root::ColumnVector,
                                info: *mut root::octave_idx_type,
                                rank: *mut root::octave_idx_type)
         -> root::ColumnVector;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix7lssolveERK12ColumnVectorRiS3_Rd"]
        pub fn Matrix_lssolve11(this: *const root::Matrix,
                                b: *const root::ColumnVector,
                                info: *mut root::octave_idx_type,
                                rank: *mut root::octave_idx_type,
                                rcon: *mut f64) -> root::ColumnVector;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix7lssolveERK19ComplexColumnVector"]
        pub fn Matrix_lssolve12(this: *const root::Matrix,
                                b: *const root::ComplexColumnVector)
         -> root::ComplexColumnVector;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix7lssolveERK19ComplexColumnVectorRi"]
        pub fn Matrix_lssolve13(this: *const root::Matrix,
                                b: *const root::ComplexColumnVector,
                                info: *mut root::octave_idx_type)
         -> root::ComplexColumnVector;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix7lssolveERK19ComplexColumnVectorRiS3_"]
        pub fn Matrix_lssolve14(this: *const root::Matrix,
                                b: *const root::ComplexColumnVector,
                                info: *mut root::octave_idx_type,
                                rank: *mut root::octave_idx_type)
         -> root::ComplexColumnVector;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix7lssolveERK19ComplexColumnVectorRiS3_Rd"]
        pub fn Matrix_lssolve15(this: *const root::Matrix,
                                b: *const root::ComplexColumnVector,
                                info: *mut root::octave_idx_type,
                                rank: *mut root::octave_idx_type,
                                rcon: *mut f64) -> root::ComplexColumnVector;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix3allEi"]
        pub fn Matrix_all(this: *const root::Matrix,
                          dim: ::std::os::raw::c_int) -> root::boolMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix3anyEi"]
        pub fn Matrix_any(this: *const root::Matrix,
                          dim: ::std::os::raw::c_int) -> root::boolMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix7cumprodEi"]
        pub fn Matrix_cumprod(this: *const root::Matrix,
                              dim: ::std::os::raw::c_int) -> root::Matrix;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix6cumsumEi"]
        pub fn Matrix_cumsum(this: *const root::Matrix,
                             dim: ::std::os::raw::c_int) -> root::Matrix;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix4prodEi"]
        pub fn Matrix_prod(this: *const root::Matrix,
                           dim: ::std::os::raw::c_int) -> root::Matrix;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix3sumEi"]
        pub fn Matrix_sum(this: *const root::Matrix,
                          dim: ::std::os::raw::c_int) -> root::Matrix;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix5sumsqEi"]
        pub fn Matrix_sumsq(this: *const root::Matrix,
                            dim: ::std::os::raw::c_int) -> root::Matrix;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix3absEv"]
        pub fn Matrix_abs(this: *const root::Matrix) -> root::Matrix;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix4diagEi"]
        pub fn Matrix_diag(this: *const root::Matrix,
                           k: root::octave_idx_type) -> root::Matrix;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix4diagEii"]
        pub fn Matrix_diag1(this: *const root::Matrix,
                            m: root::octave_idx_type,
                            n: root::octave_idx_type) -> root::DiagMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix7row_minEv"]
        pub fn Matrix_row_min(this: *const root::Matrix)
         -> root::ColumnVector;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix7row_maxEv"]
        pub fn Matrix_row_max(this: *const root::Matrix)
         -> root::ColumnVector;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix7row_minER5ArrayIiE"]
        pub fn Matrix_row_min1(this: *const root::Matrix,
                               index: *mut root::Array<::std::os::raw::c_int>)
         -> root::ColumnVector;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix7row_maxER5ArrayIiE"]
        pub fn Matrix_row_max1(this: *const root::Matrix,
                               index: *mut root::Array<::std::os::raw::c_int>)
         -> root::ColumnVector;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix10column_minEv"]
        pub fn Matrix_column_min(this: *const root::Matrix)
         -> root::RowVector;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix10column_maxEv"]
        pub fn Matrix_column_max(this: *const root::Matrix)
         -> root::RowVector;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix10column_minER5ArrayIiE"]
        pub fn Matrix_column_min1(this: *const root::Matrix,
                                  index:
                                      *mut root::Array<::std::os::raw::c_int>)
         -> root::RowVector;
    }
    extern "C" {
        #[link_name = "_ZNK6Matrix10column_maxER5ArrayIiE"]
        pub fn Matrix_column_max1(this: *const root::Matrix,
                                  index:
                                      *mut root::Array<::std::os::raw::c_int>)
         -> root::RowVector;
    }
    extern "C" {
        #[link_name = "_ZN6MatrixC1ERK9RowVector"]
        pub fn Matrix_Matrix(this: *mut root::Matrix,
                             rv: *const root::RowVector);
    }
    extern "C" {
        #[link_name = "_ZN6MatrixC1ERK12ColumnVector"]
        pub fn Matrix_Matrix1(this: *mut root::Matrix,
                              cv: *const root::ColumnVector);
    }
    extern "C" {
        #[link_name = "_ZN6MatrixC1ERK10DiagMatrix"]
        pub fn Matrix_Matrix2(this: *mut root::Matrix,
                              a: *const root::DiagMatrix);
    }
    extern "C" {
        #[link_name = "_ZN6MatrixC1ERK11MDiagArray2IdE"]
        pub fn Matrix_Matrix3(this: *mut root::Matrix,
                              a: *const root::MDiagArray2<f64>);
    }
    extern "C" {
        #[link_name = "_ZN6MatrixC1ERK10DiagArray2IdE"]
        pub fn Matrix_Matrix4(this: *mut root::Matrix,
                              a: *const root::DiagArray2<f64>);
    }
    extern "C" {
        #[link_name = "_ZN6MatrixC1ERK10PermMatrix"]
        pub fn Matrix_Matrix5(this: *mut root::Matrix,
                              a: *const root::PermMatrix);
    }
    extern "C" {
        #[link_name = "_ZN6MatrixC1ERK10boolMatrix"]
        pub fn Matrix_Matrix6(this: *mut root::Matrix,
                              a: *const root::boolMatrix);
    }
    extern "C" {
        #[link_name = "_ZN6MatrixC1ERK10charMatrix"]
        pub fn Matrix_Matrix7(this: *mut root::Matrix,
                              a: *const root::charMatrix);
    }
    impl Matrix {
        #[inline]
        pub unsafe fn is_symmetric(&self) -> bool {
            Matrix_is_symmetric(self)
        }
        #[inline]
        pub unsafe fn insert(&mut self, a: *const root::Matrix,
                             r: root::octave_idx_type,
                             c: root::octave_idx_type) -> *mut root::Matrix {
            Matrix_insert(self, a, r, c)
        }
        #[inline]
        pub unsafe fn insert1(&mut self, a: *const root::RowVector,
                              r: root::octave_idx_type,
                              c: root::octave_idx_type) -> *mut root::Matrix {
            Matrix_insert1(self, a, r, c)
        }
        #[inline]
        pub unsafe fn insert2(&mut self, a: *const root::ColumnVector,
                              r: root::octave_idx_type,
                              c: root::octave_idx_type) -> *mut root::Matrix {
            Matrix_insert2(self, a, r, c)
        }
        #[inline]
        pub unsafe fn insert3(&mut self, a: *const root::DiagMatrix,
                              r: root::octave_idx_type,
                              c: root::octave_idx_type) -> *mut root::Matrix {
            Matrix_insert3(self, a, r, c)
        }
        #[inline]
        pub unsafe fn fill(&mut self, val: f64) -> *mut root::Matrix {
            Matrix_fill(self, val)
        }
        #[inline]
        pub unsafe fn fill1(&mut self, val: f64, r1: root::octave_idx_type,
                            c1: root::octave_idx_type,
                            r2: root::octave_idx_type,
                            c2: root::octave_idx_type) -> *mut root::Matrix {
            Matrix_fill1(self, val, r1, c1, r2, c2)
        }
        #[inline]
        pub unsafe fn append(&self, a: *const root::Matrix) -> root::Matrix {
            Matrix_append(self, a)
        }
        #[inline]
        pub unsafe fn append1(&self, a: *const root::RowVector)
         -> root::Matrix {
            Matrix_append1(self, a)
        }
        #[inline]
        pub unsafe fn append2(&self, a: *const root::ColumnVector)
         -> root::Matrix {
            Matrix_append2(self, a)
        }
        #[inline]
        pub unsafe fn append3(&self, a: *const root::DiagMatrix)
         -> root::Matrix {
            Matrix_append3(self, a)
        }
        #[inline]
        pub unsafe fn stack(&self, a: *const root::Matrix) -> root::Matrix {
            Matrix_stack(self, a)
        }
        #[inline]
        pub unsafe fn stack1(&self, a: *const root::RowVector)
         -> root::Matrix {
            Matrix_stack1(self, a)
        }
        #[inline]
        pub unsafe fn stack2(&self, a: *const root::ColumnVector)
         -> root::Matrix {
            Matrix_stack2(self, a)
        }
        #[inline]
        pub unsafe fn stack3(&self, a: *const root::DiagMatrix)
         -> root::Matrix {
            Matrix_stack3(self, a)
        }
        #[inline]
        pub unsafe fn extract(&self, r1: root::octave_idx_type,
                              c1: root::octave_idx_type,
                              r2: root::octave_idx_type,
                              c2: root::octave_idx_type) -> root::Matrix {
            Matrix_extract(self, r1, c1, r2, c2)
        }
        #[inline]
        pub unsafe fn extract_n(&self, r1: root::octave_idx_type,
                                c1: root::octave_idx_type,
                                nr: root::octave_idx_type,
                                nc: root::octave_idx_type) -> root::Matrix {
            Matrix_extract_n(self, r1, c1, nr, nc)
        }
        #[inline]
        pub unsafe fn row(&self, i: root::octave_idx_type)
         -> root::RowVector {
            Matrix_row(self, i)
        }
        #[inline]
        pub unsafe fn column(&self, i: root::octave_idx_type)
         -> root::ColumnVector {
            Matrix_column(self, i)
        }
        #[inline]
        pub unsafe fn inverse(&self) -> root::Matrix { Matrix_inverse(self) }
        #[inline]
        pub unsafe fn inverse1(&self, info: *mut root::octave_idx_type)
         -> root::Matrix {
            Matrix_inverse1(self, info)
        }
        #[inline]
        pub unsafe fn inverse2(&self, info: *mut root::octave_idx_type,
                               rcon: *mut f64, force: bool, calc_cond: bool)
         -> root::Matrix {
            Matrix_inverse2(self, info, rcon, force, calc_cond)
        }
        #[inline]
        pub unsafe fn inverse3(&self, mattype: *mut root::MatrixType)
         -> root::Matrix {
            Matrix_inverse3(self, mattype)
        }
        #[inline]
        pub unsafe fn inverse4(&self, mattype: *mut root::MatrixType,
                               info: *mut root::octave_idx_type)
         -> root::Matrix {
            Matrix_inverse4(self, mattype, info)
        }
        #[inline]
        pub unsafe fn inverse5(&self, mattype: *mut root::MatrixType,
                               info: *mut root::octave_idx_type,
                               rcon: *mut f64, force: bool, calc_cond: bool)
         -> root::Matrix {
            Matrix_inverse5(self, mattype, info, rcon, force, calc_cond)
        }
        #[inline]
        pub unsafe fn pseudo_inverse(&self, tol: f64) -> root::Matrix {
            Matrix_pseudo_inverse(self, tol)
        }
        #[inline]
        pub unsafe fn fourier(&self) -> root::ComplexMatrix {
            Matrix_fourier(self)
        }
        #[inline]
        pub unsafe fn ifourier(&self) -> root::ComplexMatrix {
            Matrix_ifourier(self)
        }
        #[inline]
        pub unsafe fn fourier2d(&self) -> root::ComplexMatrix {
            Matrix_fourier2d(self)
        }
        #[inline]
        pub unsafe fn ifourier2d(&self) -> root::ComplexMatrix {
            Matrix_ifourier2d(self)
        }
        #[inline]
        pub unsafe fn determinant(&self) -> root::DET {
            Matrix_determinant(self)
        }
        #[inline]
        pub unsafe fn determinant1(&self, info: *mut root::octave_idx_type)
         -> root::DET {
            Matrix_determinant1(self, info)
        }
        #[inline]
        pub unsafe fn determinant2(&self, info: *mut root::octave_idx_type,
                                   rcon: *mut f64, calc_cond: bool)
         -> root::DET {
            Matrix_determinant2(self, info, rcon, calc_cond)
        }
        #[inline]
        pub unsafe fn determinant3(&self, mattype: *mut root::MatrixType,
                                   info: *mut root::octave_idx_type,
                                   rcon: *mut f64, calc_cond: bool)
         -> root::DET {
            Matrix_determinant3(self, mattype, info, rcon, calc_cond)
        }
        #[inline]
        pub unsafe fn rcond(&self) -> f64 { Matrix_rcond(self) }
        #[inline]
        pub unsafe fn rcond1(&self, mattype: *mut root::MatrixType) -> f64 {
            Matrix_rcond1(self, mattype)
        }
        #[inline]
        pub unsafe fn solve(&self, typ: *mut root::MatrixType,
                            b: *const root::Matrix) -> root::Matrix {
            Matrix_solve(self, typ, b)
        }
        #[inline]
        pub unsafe fn solve1(&self, typ: *mut root::MatrixType,
                             b: *const root::Matrix,
                             info: *mut root::octave_idx_type)
         -> root::Matrix {
            Matrix_solve1(self, typ, b, info)
        }
        #[inline]
        pub unsafe fn solve2(&self, typ: *mut root::MatrixType,
                             b: *const root::Matrix,
                             info: *mut root::octave_idx_type, rcon: *mut f64)
         -> root::Matrix {
            Matrix_solve2(self, typ, b, info, rcon)
        }
        #[inline]
        pub unsafe fn solve3(&self, typ: *mut root::MatrixType,
                             b: *const root::Matrix,
                             info: *mut root::octave_idx_type, rcon: *mut f64,
                             sing_handler:
                                 root::Matrix_solve_singularity_handler,
                             singular_fallback: bool,
                             transt: root::blas_trans_type) -> root::Matrix {
            Matrix_solve3(self, typ, b, info, rcon, sing_handler,
                          singular_fallback, transt)
        }
        #[inline]
        pub unsafe fn solve4(&self, typ: *mut root::MatrixType,
                             b: *const root::ComplexMatrix)
         -> root::ComplexMatrix {
            Matrix_solve4(self, typ, b)
        }
        #[inline]
        pub unsafe fn solve5(&self, typ: *mut root::MatrixType,
                             b: *const root::ComplexMatrix,
                             info: *mut root::octave_idx_type)
         -> root::ComplexMatrix {
            Matrix_solve5(self, typ, b, info)
        }
        #[inline]
        pub unsafe fn solve6(&self, typ: *mut root::MatrixType,
                             b: *const root::ComplexMatrix,
                             info: *mut root::octave_idx_type, rcon: *mut f64)
         -> root::ComplexMatrix {
            Matrix_solve6(self, typ, b, info, rcon)
        }
        #[inline]
        pub unsafe fn solve7(&self, typ: *mut root::MatrixType,
                             b: *const root::ComplexMatrix,
                             info: *mut root::octave_idx_type, rcon: *mut f64,
                             sing_handler:
                                 root::Matrix_solve_singularity_handler,
                             singular_fallback: bool,
                             transt: root::blas_trans_type)
         -> root::ComplexMatrix {
            Matrix_solve7(self, typ, b, info, rcon, sing_handler,
                          singular_fallback, transt)
        }
        #[inline]
        pub unsafe fn solve8(&self, typ: *mut root::MatrixType,
                             b: *const root::ColumnVector)
         -> root::ColumnVector {
            Matrix_solve8(self, typ, b)
        }
        #[inline]
        pub unsafe fn solve9(&self, typ: *mut root::MatrixType,
                             b: *const root::ColumnVector,
                             info: *mut root::octave_idx_type)
         -> root::ColumnVector {
            Matrix_solve9(self, typ, b, info)
        }
        #[inline]
        pub unsafe fn solve10(&self, typ: *mut root::MatrixType,
                              b: *const root::ColumnVector,
                              info: *mut root::octave_idx_type,
                              rcon: *mut f64) -> root::ColumnVector {
            Matrix_solve10(self, typ, b, info, rcon)
        }
        #[inline]
        pub unsafe fn solve11(&self, typ: *mut root::MatrixType,
                              b: *const root::ColumnVector,
                              info: *mut root::octave_idx_type,
                              rcon: *mut f64,
                              sing_handler:
                                  root::Matrix_solve_singularity_handler,
                              transt: root::blas_trans_type)
         -> root::ColumnVector {
            Matrix_solve11(self, typ, b, info, rcon, sing_handler, transt)
        }
        #[inline]
        pub unsafe fn solve12(&self, typ: *mut root::MatrixType,
                              b: *const root::ComplexColumnVector)
         -> root::ComplexColumnVector {
            Matrix_solve12(self, typ, b)
        }
        #[inline]
        pub unsafe fn solve13(&self, typ: *mut root::MatrixType,
                              b: *const root::ComplexColumnVector,
                              info: *mut root::octave_idx_type)
         -> root::ComplexColumnVector {
            Matrix_solve13(self, typ, b, info)
        }
        #[inline]
        pub unsafe fn solve14(&self, typ: *mut root::MatrixType,
                              b: *const root::ComplexColumnVector,
                              info: *mut root::octave_idx_type,
                              rcon: *mut f64) -> root::ComplexColumnVector {
            Matrix_solve14(self, typ, b, info, rcon)
        }
        #[inline]
        pub unsafe fn solve15(&self, typ: *mut root::MatrixType,
                              b: *const root::ComplexColumnVector,
                              info: *mut root::octave_idx_type,
                              rcon: *mut f64,
                              sing_handler:
                                  root::Matrix_solve_singularity_handler,
                              transt: root::blas_trans_type)
         -> root::ComplexColumnVector {
            Matrix_solve15(self, typ, b, info, rcon, sing_handler, transt)
        }
        #[inline]
        pub unsafe fn solve16(&self, b: *const root::Matrix) -> root::Matrix {
            Matrix_solve16(self, b)
        }
        #[inline]
        pub unsafe fn solve17(&self, b: *const root::Matrix,
                              info: *mut root::octave_idx_type)
         -> root::Matrix {
            Matrix_solve17(self, b, info)
        }
        #[inline]
        pub unsafe fn solve18(&self, b: *const root::Matrix,
                              info: *mut root::octave_idx_type,
                              rcon: *mut f64) -> root::Matrix {
            Matrix_solve18(self, b, info, rcon)
        }
        #[inline]
        pub unsafe fn solve19(&self, b: *const root::Matrix,
                              info: *mut root::octave_idx_type,
                              rcon: *mut f64,
                              sing_handler:
                                  root::Matrix_solve_singularity_handler,
                              transt: root::blas_trans_type) -> root::Matrix {
            Matrix_solve19(self, b, info, rcon, sing_handler, transt)
        }
        #[inline]
        pub unsafe fn solve20(&self, b: *const root::ComplexMatrix)
         -> root::ComplexMatrix {
            Matrix_solve20(self, b)
        }
        #[inline]
        pub unsafe fn solve21(&self, b: *const root::ComplexMatrix,
                              info: *mut root::octave_idx_type)
         -> root::ComplexMatrix {
            Matrix_solve21(self, b, info)
        }
        #[inline]
        pub unsafe fn solve22(&self, b: *const root::ComplexMatrix,
                              info: *mut root::octave_idx_type,
                              rcon: *mut f64) -> root::ComplexMatrix {
            Matrix_solve22(self, b, info, rcon)
        }
        #[inline]
        pub unsafe fn solve23(&self, b: *const root::ComplexMatrix,
                              info: *mut root::octave_idx_type,
                              rcon: *mut f64,
                              sing_handler:
                                  root::Matrix_solve_singularity_handler,
                              transt: root::blas_trans_type)
         -> root::ComplexMatrix {
            Matrix_solve23(self, b, info, rcon, sing_handler, transt)
        }
        #[inline]
        pub unsafe fn solve24(&self, b: *const root::ColumnVector)
         -> root::ColumnVector {
            Matrix_solve24(self, b)
        }
        #[inline]
        pub unsafe fn solve25(&self, b: *const root::ColumnVector,
                              info: *mut root::octave_idx_type)
         -> root::ColumnVector {
            Matrix_solve25(self, b, info)
        }
        #[inline]
        pub unsafe fn solve26(&self, b: *const root::ColumnVector,
                              info: *mut root::octave_idx_type,
                              rcon: *mut f64) -> root::ColumnVector {
            Matrix_solve26(self, b, info, rcon)
        }
        #[inline]
        pub unsafe fn solve27(&self, b: *const root::ColumnVector,
                              info: *mut root::octave_idx_type,
                              rcon: *mut f64,
                              sing_handler:
                                  root::Matrix_solve_singularity_handler,
                              transt: root::blas_trans_type)
         -> root::ColumnVector {
            Matrix_solve27(self, b, info, rcon, sing_handler, transt)
        }
        #[inline]
        pub unsafe fn solve28(&self, b: *const root::ComplexColumnVector)
         -> root::ComplexColumnVector {
            Matrix_solve28(self, b)
        }
        #[inline]
        pub unsafe fn solve29(&self, b: *const root::ComplexColumnVector,
                              info: *mut root::octave_idx_type)
         -> root::ComplexColumnVector {
            Matrix_solve29(self, b, info)
        }
        #[inline]
        pub unsafe fn solve30(&self, b: *const root::ComplexColumnVector,
                              info: *mut root::octave_idx_type,
                              rcon: *mut f64) -> root::ComplexColumnVector {
            Matrix_solve30(self, b, info, rcon)
        }
        #[inline]
        pub unsafe fn solve31(&self, b: *const root::ComplexColumnVector,
                              info: *mut root::octave_idx_type,
                              rcon: *mut f64,
                              sing_handler:
                                  root::Matrix_solve_singularity_handler,
                              transt: root::blas_trans_type)
         -> root::ComplexColumnVector {
            Matrix_solve31(self, b, info, rcon, sing_handler, transt)
        }
        #[inline]
        pub unsafe fn lssolve(&self, b: *const root::Matrix) -> root::Matrix {
            Matrix_lssolve(self, b)
        }
        #[inline]
        pub unsafe fn lssolve1(&self, b: *const root::Matrix,
                               info: *mut root::octave_idx_type)
         -> root::Matrix {
            Matrix_lssolve1(self, b, info)
        }
        #[inline]
        pub unsafe fn lssolve2(&self, b: *const root::Matrix,
                               info: *mut root::octave_idx_type,
                               rank: *mut root::octave_idx_type)
         -> root::Matrix {
            Matrix_lssolve2(self, b, info, rank)
        }
        #[inline]
        pub unsafe fn lssolve3(&self, b: *const root::Matrix,
                               info: *mut root::octave_idx_type,
                               rank: *mut root::octave_idx_type,
                               rcon: *mut f64) -> root::Matrix {
            Matrix_lssolve3(self, b, info, rank, rcon)
        }
        #[inline]
        pub unsafe fn lssolve4(&self, b: *const root::ComplexMatrix)
         -> root::ComplexMatrix {
            Matrix_lssolve4(self, b)
        }
        #[inline]
        pub unsafe fn lssolve5(&self, b: *const root::ComplexMatrix,
                               info: *mut root::octave_idx_type)
         -> root::ComplexMatrix {
            Matrix_lssolve5(self, b, info)
        }
        #[inline]
        pub unsafe fn lssolve6(&self, b: *const root::ComplexMatrix,
                               info: *mut root::octave_idx_type,
                               rank: *mut root::octave_idx_type)
         -> root::ComplexMatrix {
            Matrix_lssolve6(self, b, info, rank)
        }
        #[inline]
        pub unsafe fn lssolve7(&self, b: *const root::ComplexMatrix,
                               info: *mut root::octave_idx_type,
                               rank: *mut root::octave_idx_type,
                               rcon: *mut f64) -> root::ComplexMatrix {
            Matrix_lssolve7(self, b, info, rank, rcon)
        }
        #[inline]
        pub unsafe fn lssolve8(&self, b: *const root::ColumnVector)
         -> root::ColumnVector {
            Matrix_lssolve8(self, b)
        }
        #[inline]
        pub unsafe fn lssolve9(&self, b: *const root::ColumnVector,
                               info: *mut root::octave_idx_type)
         -> root::ColumnVector {
            Matrix_lssolve9(self, b, info)
        }
        #[inline]
        pub unsafe fn lssolve10(&self, b: *const root::ColumnVector,
                                info: *mut root::octave_idx_type,
                                rank: *mut root::octave_idx_type)
         -> root::ColumnVector {
            Matrix_lssolve10(self, b, info, rank)
        }
        #[inline]
        pub unsafe fn lssolve11(&self, b: *const root::ColumnVector,
                                info: *mut root::octave_idx_type,
                                rank: *mut root::octave_idx_type,
                                rcon: *mut f64) -> root::ColumnVector {
            Matrix_lssolve11(self, b, info, rank, rcon)
        }
        #[inline]
        pub unsafe fn lssolve12(&self, b: *const root::ComplexColumnVector)
         -> root::ComplexColumnVector {
            Matrix_lssolve12(self, b)
        }
        #[inline]
        pub unsafe fn lssolve13(&self, b: *const root::ComplexColumnVector,
                                info: *mut root::octave_idx_type)
         -> root::ComplexColumnVector {
            Matrix_lssolve13(self, b, info)
        }
        #[inline]
        pub unsafe fn lssolve14(&self, b: *const root::ComplexColumnVector,
                                info: *mut root::octave_idx_type,
                                rank: *mut root::octave_idx_type)
         -> root::ComplexColumnVector {
            Matrix_lssolve14(self, b, info, rank)
        }
        #[inline]
        pub unsafe fn lssolve15(&self, b: *const root::ComplexColumnVector,
                                info: *mut root::octave_idx_type,
                                rank: *mut root::octave_idx_type,
                                rcon: *mut f64) -> root::ComplexColumnVector {
            Matrix_lssolve15(self, b, info, rank, rcon)
        }
        #[inline]
        pub unsafe fn all(&self, dim: ::std::os::raw::c_int)
         -> root::boolMatrix {
            Matrix_all(self, dim)
        }
        #[inline]
        pub unsafe fn any(&self, dim: ::std::os::raw::c_int)
         -> root::boolMatrix {
            Matrix_any(self, dim)
        }
        #[inline]
        pub unsafe fn cumprod(&self, dim: ::std::os::raw::c_int)
         -> root::Matrix {
            Matrix_cumprod(self, dim)
        }
        #[inline]
        pub unsafe fn cumsum(&self, dim: ::std::os::raw::c_int)
         -> root::Matrix {
            Matrix_cumsum(self, dim)
        }
        #[inline]
        pub unsafe fn prod(&self, dim: ::std::os::raw::c_int)
         -> root::Matrix {
            Matrix_prod(self, dim)
        }
        #[inline]
        pub unsafe fn sum(&self, dim: ::std::os::raw::c_int) -> root::Matrix {
            Matrix_sum(self, dim)
        }
        #[inline]
        pub unsafe fn sumsq(&self, dim: ::std::os::raw::c_int)
         -> root::Matrix {
            Matrix_sumsq(self, dim)
        }
        #[inline]
        pub unsafe fn abs(&self) -> root::Matrix { Matrix_abs(self) }
        #[inline]
        pub unsafe fn diag(&self, k: root::octave_idx_type) -> root::Matrix {
            Matrix_diag(self, k)
        }
        #[inline]
        pub unsafe fn diag1(&self, m: root::octave_idx_type,
                            n: root::octave_idx_type) -> root::DiagMatrix {
            Matrix_diag1(self, m, n)
        }
        #[inline]
        pub unsafe fn row_min(&self) -> root::ColumnVector {
            Matrix_row_min(self)
        }
        #[inline]
        pub unsafe fn row_max(&self) -> root::ColumnVector {
            Matrix_row_max(self)
        }
        #[inline]
        pub unsafe fn row_min1(&self,
                               index: *mut root::Array<::std::os::raw::c_int>)
         -> root::ColumnVector {
            Matrix_row_min1(self, index)
        }
        #[inline]
        pub unsafe fn row_max1(&self,
                               index: *mut root::Array<::std::os::raw::c_int>)
         -> root::ColumnVector {
            Matrix_row_max1(self, index)
        }
        #[inline]
        pub unsafe fn column_min(&self) -> root::RowVector {
            Matrix_column_min(self)
        }
        #[inline]
        pub unsafe fn column_max(&self) -> root::RowVector {
            Matrix_column_max(self)
        }
        #[inline]
        pub unsafe fn column_min1(&self,
                                  index:
                                      *mut root::Array<::std::os::raw::c_int>)
         -> root::RowVector {
            Matrix_column_min1(self, index)
        }
        #[inline]
        pub unsafe fn column_max1(&self,
                                  index:
                                      *mut root::Array<::std::os::raw::c_int>)
         -> root::RowVector {
            Matrix_column_max1(self, index)
        }
        #[inline]
        pub unsafe fn new(rv: *const root::RowVector) -> Self {
            let mut __bindgen_tmp = ::std::mem::uninitialized();
            Matrix_Matrix(&mut __bindgen_tmp, rv);
            __bindgen_tmp
        }
        #[inline]
        pub unsafe fn new1(cv: *const root::ColumnVector) -> Self {
            let mut __bindgen_tmp = ::std::mem::uninitialized();
            Matrix_Matrix1(&mut __bindgen_tmp, cv);
            __bindgen_tmp
        }
        #[inline]
        pub unsafe fn new2(a: *const root::DiagMatrix) -> Self {
            let mut __bindgen_tmp = ::std::mem::uninitialized();
            Matrix_Matrix2(&mut __bindgen_tmp, a);
            __bindgen_tmp
        }
        #[inline]
        pub unsafe fn new3(a: *const root::MDiagArray2<f64>) -> Self {
            let mut __bindgen_tmp = ::std::mem::uninitialized();
            Matrix_Matrix3(&mut __bindgen_tmp, a);
            __bindgen_tmp
        }
        #[inline]
        pub unsafe fn new4(a: *const root::DiagArray2<f64>) -> Self {
            let mut __bindgen_tmp = ::std::mem::uninitialized();
            Matrix_Matrix4(&mut __bindgen_tmp, a);
            __bindgen_tmp
        }
        #[inline]
        pub unsafe fn new5(a: *const root::PermMatrix) -> Self {
            let mut __bindgen_tmp = ::std::mem::uninitialized();
            Matrix_Matrix5(&mut __bindgen_tmp, a);
            __bindgen_tmp
        }
        #[inline]
        pub unsafe fn new6(a: *const root::boolMatrix) -> Self {
            let mut __bindgen_tmp = ::std::mem::uninitialized();
            Matrix_Matrix6(&mut __bindgen_tmp, a);
            __bindgen_tmp
        }
        #[inline]
        pub unsafe fn new7(a: *const root::charMatrix) -> Self {
            let mut __bindgen_tmp = ::std::mem::uninitialized();
            Matrix_Matrix7(&mut __bindgen_tmp, a);
            __bindgen_tmp
        }
    }
    #[repr(C)]
    #[derive(Debug)]
    pub struct ComplexMatrix {
        pub _base: root::ComplexNDArray,
    }
    pub type ComplexMatrix_column_vector_type = root::ComplexColumnVector;
    pub type ComplexMatrix_row_vector_type = root::ComplexRowVector;
    pub type ComplexMatrix_real_column_vector_type = root::ColumnVector;
    pub type ComplexMatrix_real_row_vector_type = root::RowVector;
    pub type ComplexMatrix_real_matrix_type = root::Matrix;
    pub type ComplexMatrix_complex_matrix_type = root::ComplexMatrix;
    pub type ComplexMatrix_real_diag_matrix_type = root::DiagMatrix;
    pub type ComplexMatrix_complex_diag_matrix_type = root::ComplexDiagMatrix;
    pub type ComplexMatrix_real_elt_type = f64;
    pub type ComplexMatrix_complex_elt_type = root::Complex;
    pub type ComplexMatrix_solve_singularity_handler =
        ::std::option::Option<unsafe extern "C" fn(rcon: f64)>;
    #[test]
    fn bindgen_test_layout_ComplexMatrix() {
        assert_eq!(::std::mem::size_of::<ComplexMatrix>() , 40usize , concat !
                   ( "Size of: " , stringify ! ( ComplexMatrix ) ));
        assert_eq! (::std::mem::align_of::<ComplexMatrix>() , 8usize , concat
                    ! ( "Alignment of " , stringify ! ( ComplexMatrix ) ));
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix12is_hermitianEv"]
        pub fn ComplexMatrix_is_hermitian(this: *const root::ComplexMatrix)
         -> bool;
    }
    extern "C" {
        #[link_name = "_ZN13ComplexMatrix6insertERK6Matrixii"]
        pub fn ComplexMatrix_insert(this: *mut root::ComplexMatrix,
                                    a: *const root::Matrix,
                                    r: root::octave_idx_type,
                                    c: root::octave_idx_type)
         -> *mut root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZN13ComplexMatrix6insertERK9RowVectorii"]
        pub fn ComplexMatrix_insert1(this: *mut root::ComplexMatrix,
                                     a: *const root::RowVector,
                                     r: root::octave_idx_type,
                                     c: root::octave_idx_type)
         -> *mut root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZN13ComplexMatrix6insertERK12ColumnVectorii"]
        pub fn ComplexMatrix_insert2(this: *mut root::ComplexMatrix,
                                     a: *const root::ColumnVector,
                                     r: root::octave_idx_type,
                                     c: root::octave_idx_type)
         -> *mut root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZN13ComplexMatrix6insertERK10DiagMatrixii"]
        pub fn ComplexMatrix_insert3(this: *mut root::ComplexMatrix,
                                     a: *const root::DiagMatrix,
                                     r: root::octave_idx_type,
                                     c: root::octave_idx_type)
         -> *mut root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZN13ComplexMatrix6insertERKS_ii"]
        pub fn ComplexMatrix_insert4(this: *mut root::ComplexMatrix,
                                     a: *const root::ComplexMatrix,
                                     r: root::octave_idx_type,
                                     c: root::octave_idx_type)
         -> *mut root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZN13ComplexMatrix6insertERK16ComplexRowVectorii"]
        pub fn ComplexMatrix_insert5(this: *mut root::ComplexMatrix,
                                     a: *const root::ComplexRowVector,
                                     r: root::octave_idx_type,
                                     c: root::octave_idx_type)
         -> *mut root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZN13ComplexMatrix6insertERK19ComplexColumnVectorii"]
        pub fn ComplexMatrix_insert6(this: *mut root::ComplexMatrix,
                                     a: *const root::ComplexColumnVector,
                                     r: root::octave_idx_type,
                                     c: root::octave_idx_type)
         -> *mut root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZN13ComplexMatrix6insertERK17ComplexDiagMatrixii"]
        pub fn ComplexMatrix_insert7(this: *mut root::ComplexMatrix,
                                     a: *const root::ComplexDiagMatrix,
                                     r: root::octave_idx_type,
                                     c: root::octave_idx_type)
         -> *mut root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZN13ComplexMatrix4fillEd"]
        pub fn ComplexMatrix_fill(this: *mut root::ComplexMatrix, val: f64)
         -> *mut root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZN13ComplexMatrix4fillERKSt7complexIdE"]
        pub fn ComplexMatrix_fill1(this: *mut root::ComplexMatrix,
                                   val: *const root::Complex)
         -> *mut root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZN13ComplexMatrix4fillEdiiii"]
        pub fn ComplexMatrix_fill2(this: *mut root::ComplexMatrix, val: f64,
                                   r1: root::octave_idx_type,
                                   c1: root::octave_idx_type,
                                   r2: root::octave_idx_type,
                                   c2: root::octave_idx_type)
         -> *mut root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZN13ComplexMatrix4fillERKSt7complexIdEiiii"]
        pub fn ComplexMatrix_fill3(this: *mut root::ComplexMatrix,
                                   val: *const root::Complex,
                                   r1: root::octave_idx_type,
                                   c1: root::octave_idx_type,
                                   r2: root::octave_idx_type,
                                   c2: root::octave_idx_type)
         -> *mut root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix6appendERK6Matrix"]
        pub fn ComplexMatrix_append(this: *const root::ComplexMatrix,
                                    a: *const root::Matrix)
         -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix6appendERK9RowVector"]
        pub fn ComplexMatrix_append1(this: *const root::ComplexMatrix,
                                     a: *const root::RowVector)
         -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix6appendERK12ColumnVector"]
        pub fn ComplexMatrix_append2(this: *const root::ComplexMatrix,
                                     a: *const root::ColumnVector)
         -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix6appendERK10DiagMatrix"]
        pub fn ComplexMatrix_append3(this: *const root::ComplexMatrix,
                                     a: *const root::DiagMatrix)
         -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix6appendERKS_"]
        pub fn ComplexMatrix_append4(this: *const root::ComplexMatrix,
                                     a: *const root::ComplexMatrix)
         -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix6appendERK16ComplexRowVector"]
        pub fn ComplexMatrix_append5(this: *const root::ComplexMatrix,
                                     a: *const root::ComplexRowVector)
         -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix6appendERK19ComplexColumnVector"]
        pub fn ComplexMatrix_append6(this: *const root::ComplexMatrix,
                                     a: *const root::ComplexColumnVector)
         -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix6appendERK17ComplexDiagMatrix"]
        pub fn ComplexMatrix_append7(this: *const root::ComplexMatrix,
                                     a: *const root::ComplexDiagMatrix)
         -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix5stackERK6Matrix"]
        pub fn ComplexMatrix_stack(this: *const root::ComplexMatrix,
                                   a: *const root::Matrix)
         -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix5stackERK9RowVector"]
        pub fn ComplexMatrix_stack1(this: *const root::ComplexMatrix,
                                    a: *const root::RowVector)
         -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix5stackERK12ColumnVector"]
        pub fn ComplexMatrix_stack2(this: *const root::ComplexMatrix,
                                    a: *const root::ColumnVector)
         -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix5stackERK10DiagMatrix"]
        pub fn ComplexMatrix_stack3(this: *const root::ComplexMatrix,
                                    a: *const root::DiagMatrix)
         -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix5stackERKS_"]
        pub fn ComplexMatrix_stack4(this: *const root::ComplexMatrix,
                                    a: *const root::ComplexMatrix)
         -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix5stackERK16ComplexRowVector"]
        pub fn ComplexMatrix_stack5(this: *const root::ComplexMatrix,
                                    a: *const root::ComplexRowVector)
         -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix5stackERK19ComplexColumnVector"]
        pub fn ComplexMatrix_stack6(this: *const root::ComplexMatrix,
                                    a: *const root::ComplexColumnVector)
         -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix5stackERK17ComplexDiagMatrix"]
        pub fn ComplexMatrix_stack7(this: *const root::ComplexMatrix,
                                    a: *const root::ComplexDiagMatrix)
         -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix7extractEiiii"]
        pub fn ComplexMatrix_extract(this: *const root::ComplexMatrix,
                                     r1: root::octave_idx_type,
                                     c1: root::octave_idx_type,
                                     r2: root::octave_idx_type,
                                     c2: root::octave_idx_type)
         -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix9extract_nEiiii"]
        pub fn ComplexMatrix_extract_n(this: *const root::ComplexMatrix,
                                       r1: root::octave_idx_type,
                                       c1: root::octave_idx_type,
                                       nr: root::octave_idx_type,
                                       nc: root::octave_idx_type)
         -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix3rowEi"]
        pub fn ComplexMatrix_row(this: *const root::ComplexMatrix,
                                 i: root::octave_idx_type)
         -> root::ComplexRowVector;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix6columnEi"]
        pub fn ComplexMatrix_column(this: *const root::ComplexMatrix,
                                    i: root::octave_idx_type)
         -> root::ComplexColumnVector;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix7inverseEv"]
        pub fn ComplexMatrix_inverse(this: *const root::ComplexMatrix)
         -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix7inverseERi"]
        pub fn ComplexMatrix_inverse1(this: *const root::ComplexMatrix,
                                      info: *mut root::octave_idx_type)
         -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix7inverseERiRdbb"]
        pub fn ComplexMatrix_inverse2(this: *const root::ComplexMatrix,
                                      info: *mut root::octave_idx_type,
                                      rcon: *mut f64, force: bool,
                                      calc_cond: bool) -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix7inverseER10MatrixType"]
        pub fn ComplexMatrix_inverse3(this: *const root::ComplexMatrix,
                                      mattype: *mut root::MatrixType)
         -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix7inverseER10MatrixTypeRi"]
        pub fn ComplexMatrix_inverse4(this: *const root::ComplexMatrix,
                                      mattype: *mut root::MatrixType,
                                      info: *mut root::octave_idx_type)
         -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix7inverseER10MatrixTypeRiRdbb"]
        pub fn ComplexMatrix_inverse5(this: *const root::ComplexMatrix,
                                      mattype: *mut root::MatrixType,
                                      info: *mut root::octave_idx_type,
                                      rcon: *mut f64, force: bool,
                                      calc_cond: bool) -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix14pseudo_inverseEd"]
        pub fn ComplexMatrix_pseudo_inverse(this: *const root::ComplexMatrix,
                                            tol: f64) -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix7fourierEv"]
        pub fn ComplexMatrix_fourier(this: *const root::ComplexMatrix)
         -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix8ifourierEv"]
        pub fn ComplexMatrix_ifourier(this: *const root::ComplexMatrix)
         -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix9fourier2dEv"]
        pub fn ComplexMatrix_fourier2d(this: *const root::ComplexMatrix)
         -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix10ifourier2dEv"]
        pub fn ComplexMatrix_ifourier2d(this: *const root::ComplexMatrix)
         -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix11determinantEv"]
        pub fn ComplexMatrix_determinant(this: *const root::ComplexMatrix)
         -> root::ComplexDET;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix11determinantERi"]
        pub fn ComplexMatrix_determinant1(this: *const root::ComplexMatrix,
                                          info: *mut root::octave_idx_type)
         -> root::ComplexDET;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix11determinantERiRdb"]
        pub fn ComplexMatrix_determinant2(this: *const root::ComplexMatrix,
                                          info: *mut root::octave_idx_type,
                                          rcon: *mut f64, calc_cond: bool)
         -> root::ComplexDET;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix11determinantER10MatrixTypeRiRdb"]
        pub fn ComplexMatrix_determinant3(this: *const root::ComplexMatrix,
                                          mattype: *mut root::MatrixType,
                                          info: *mut root::octave_idx_type,
                                          rcon: *mut f64, calc_cond: bool)
         -> root::ComplexDET;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix5rcondEv"]
        pub fn ComplexMatrix_rcond(this: *const root::ComplexMatrix) -> f64;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix5rcondER10MatrixType"]
        pub fn ComplexMatrix_rcond1(this: *const root::ComplexMatrix,
                                    mattype: *mut root::MatrixType) -> f64;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix5solveER10MatrixTypeRK6Matrix"]
        pub fn ComplexMatrix_solve(this: *const root::ComplexMatrix,
                                   typ: *mut root::MatrixType,
                                   b: *const root::Matrix)
         -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix5solveER10MatrixTypeRK6MatrixRi"]
        pub fn ComplexMatrix_solve1(this: *const root::ComplexMatrix,
                                    typ: *mut root::MatrixType,
                                    b: *const root::Matrix,
                                    info: *mut root::octave_idx_type)
         -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix5solveER10MatrixTypeRK6MatrixRiRd"]
        pub fn ComplexMatrix_solve2(this: *const root::ComplexMatrix,
                                    typ: *mut root::MatrixType,
                                    b: *const root::Matrix,
                                    info: *mut root::octave_idx_type,
                                    rcon: *mut f64) -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name =
              "_ZNK13ComplexMatrix5solveER10MatrixTypeRK6MatrixRiRdPFvdEb15blas_trans_type"]
        pub fn ComplexMatrix_solve3(this: *const root::ComplexMatrix,
                                    typ: *mut root::MatrixType,
                                    b: *const root::Matrix,
                                    info: *mut root::octave_idx_type,
                                    rcon: *mut f64,
                                    sing_handler:
                                        root::ComplexMatrix_solve_singularity_handler,
                                    singular_fallback: bool,
                                    transt: root::blas_trans_type)
         -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix5solveER10MatrixTypeRKS_"]
        pub fn ComplexMatrix_solve4(this: *const root::ComplexMatrix,
                                    typ: *mut root::MatrixType,
                                    b: *const root::ComplexMatrix)
         -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix5solveER10MatrixTypeRKS_Ri"]
        pub fn ComplexMatrix_solve5(this: *const root::ComplexMatrix,
                                    typ: *mut root::MatrixType,
                                    b: *const root::ComplexMatrix,
                                    info: *mut root::octave_idx_type)
         -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix5solveER10MatrixTypeRKS_RiRd"]
        pub fn ComplexMatrix_solve6(this: *const root::ComplexMatrix,
                                    typ: *mut root::MatrixType,
                                    b: *const root::ComplexMatrix,
                                    info: *mut root::octave_idx_type,
                                    rcon: *mut f64) -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name =
              "_ZNK13ComplexMatrix5solveER10MatrixTypeRKS_RiRdPFvdEb15blas_trans_type"]
        pub fn ComplexMatrix_solve7(this: *const root::ComplexMatrix,
                                    typ: *mut root::MatrixType,
                                    b: *const root::ComplexMatrix,
                                    info: *mut root::octave_idx_type,
                                    rcon: *mut f64,
                                    sing_handler:
                                        root::ComplexMatrix_solve_singularity_handler,
                                    singular_fallback: bool,
                                    transt: root::blas_trans_type)
         -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name =
              "_ZNK13ComplexMatrix5solveER10MatrixTypeRK12ColumnVector"]
        pub fn ComplexMatrix_solve8(this: *const root::ComplexMatrix,
                                    typ: *mut root::MatrixType,
                                    b: *const root::ColumnVector)
         -> root::ComplexColumnVector;
    }
    extern "C" {
        #[link_name =
              "_ZNK13ComplexMatrix5solveER10MatrixTypeRK12ColumnVectorRi"]
        pub fn ComplexMatrix_solve9(this: *const root::ComplexMatrix,
                                    typ: *mut root::MatrixType,
                                    b: *const root::ColumnVector,
                                    info: *mut root::octave_idx_type)
         -> root::ComplexColumnVector;
    }
    extern "C" {
        #[link_name =
              "_ZNK13ComplexMatrix5solveER10MatrixTypeRK12ColumnVectorRiRd"]
        pub fn ComplexMatrix_solve10(this: *const root::ComplexMatrix,
                                     typ: *mut root::MatrixType,
                                     b: *const root::ColumnVector,
                                     info: *mut root::octave_idx_type,
                                     rcon: *mut f64)
         -> root::ComplexColumnVector;
    }
    extern "C" {
        #[link_name =
              "_ZNK13ComplexMatrix5solveER10MatrixTypeRK12ColumnVectorRiRdPFvdE15blas_trans_type"]
        pub fn ComplexMatrix_solve11(this: *const root::ComplexMatrix,
                                     typ: *mut root::MatrixType,
                                     b: *const root::ColumnVector,
                                     info: *mut root::octave_idx_type,
                                     rcon: *mut f64,
                                     sing_handler:
                                         root::ComplexMatrix_solve_singularity_handler,
                                     transt: root::blas_trans_type)
         -> root::ComplexColumnVector;
    }
    extern "C" {
        #[link_name =
              "_ZNK13ComplexMatrix5solveER10MatrixTypeRK19ComplexColumnVector"]
        pub fn ComplexMatrix_solve12(this: *const root::ComplexMatrix,
                                     typ: *mut root::MatrixType,
                                     b: *const root::ComplexColumnVector)
         -> root::ComplexColumnVector;
    }
    extern "C" {
        #[link_name =
              "_ZNK13ComplexMatrix5solveER10MatrixTypeRK19ComplexColumnVectorRi"]
        pub fn ComplexMatrix_solve13(this: *const root::ComplexMatrix,
                                     typ: *mut root::MatrixType,
                                     b: *const root::ComplexColumnVector,
                                     info: *mut root::octave_idx_type)
         -> root::ComplexColumnVector;
    }
    extern "C" {
        #[link_name =
              "_ZNK13ComplexMatrix5solveER10MatrixTypeRK19ComplexColumnVectorRiRd"]
        pub fn ComplexMatrix_solve14(this: *const root::ComplexMatrix,
                                     typ: *mut root::MatrixType,
                                     b: *const root::ComplexColumnVector,
                                     info: *mut root::octave_idx_type,
                                     rcon: *mut f64)
         -> root::ComplexColumnVector;
    }
    extern "C" {
        #[link_name =
              "_ZNK13ComplexMatrix5solveER10MatrixTypeRK19ComplexColumnVectorRiRdPFvdE15blas_trans_type"]
        pub fn ComplexMatrix_solve15(this: *const root::ComplexMatrix,
                                     typ: *mut root::MatrixType,
                                     b: *const root::ComplexColumnVector,
                                     info: *mut root::octave_idx_type,
                                     rcon: *mut f64,
                                     sing_handler:
                                         root::ComplexMatrix_solve_singularity_handler,
                                     transt: root::blas_trans_type)
         -> root::ComplexColumnVector;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix5solveERK6Matrix"]
        pub fn ComplexMatrix_solve16(this: *const root::ComplexMatrix,
                                     b: *const root::Matrix)
         -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix5solveERK6MatrixRi"]
        pub fn ComplexMatrix_solve17(this: *const root::ComplexMatrix,
                                     b: *const root::Matrix,
                                     info: *mut root::octave_idx_type)
         -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix5solveERK6MatrixRiRd"]
        pub fn ComplexMatrix_solve18(this: *const root::ComplexMatrix,
                                     b: *const root::Matrix,
                                     info: *mut root::octave_idx_type,
                                     rcon: *mut f64) -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name =
              "_ZNK13ComplexMatrix5solveERK6MatrixRiRdPFvdE15blas_trans_type"]
        pub fn ComplexMatrix_solve19(this: *const root::ComplexMatrix,
                                     b: *const root::Matrix,
                                     info: *mut root::octave_idx_type,
                                     rcon: *mut f64,
                                     sing_handler:
                                         root::ComplexMatrix_solve_singularity_handler,
                                     transt: root::blas_trans_type)
         -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix5solveERKS_"]
        pub fn ComplexMatrix_solve20(this: *const root::ComplexMatrix,
                                     b: *const root::ComplexMatrix)
         -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix5solveERKS_Ri"]
        pub fn ComplexMatrix_solve21(this: *const root::ComplexMatrix,
                                     b: *const root::ComplexMatrix,
                                     info: *mut root::octave_idx_type)
         -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix5solveERKS_RiRd"]
        pub fn ComplexMatrix_solve22(this: *const root::ComplexMatrix,
                                     b: *const root::ComplexMatrix,
                                     info: *mut root::octave_idx_type,
                                     rcon: *mut f64) -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name =
              "_ZNK13ComplexMatrix5solveERKS_RiRdPFvdE15blas_trans_type"]
        pub fn ComplexMatrix_solve23(this: *const root::ComplexMatrix,
                                     b: *const root::ComplexMatrix,
                                     info: *mut root::octave_idx_type,
                                     rcon: *mut f64,
                                     sing_handler:
                                         root::ComplexMatrix_solve_singularity_handler,
                                     transt: root::blas_trans_type)
         -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix5solveERK12ColumnVector"]
        pub fn ComplexMatrix_solve24(this: *const root::ComplexMatrix,
                                     b: *const root::ColumnVector)
         -> root::ComplexColumnVector;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix5solveERK12ColumnVectorRi"]
        pub fn ComplexMatrix_solve25(this: *const root::ComplexMatrix,
                                     b: *const root::ColumnVector,
                                     info: *mut root::octave_idx_type)
         -> root::ComplexColumnVector;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix5solveERK12ColumnVectorRiRd"]
        pub fn ComplexMatrix_solve26(this: *const root::ComplexMatrix,
                                     b: *const root::ColumnVector,
                                     info: *mut root::octave_idx_type,
                                     rcon: *mut f64)
         -> root::ComplexColumnVector;
    }
    extern "C" {
        #[link_name =
              "_ZNK13ComplexMatrix5solveERK12ColumnVectorRiRdPFvdE15blas_trans_type"]
        pub fn ComplexMatrix_solve27(this: *const root::ComplexMatrix,
                                     b: *const root::ColumnVector,
                                     info: *mut root::octave_idx_type,
                                     rcon: *mut f64,
                                     sing_handler:
                                         root::ComplexMatrix_solve_singularity_handler,
                                     transt: root::blas_trans_type)
         -> root::ComplexColumnVector;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix5solveERK19ComplexColumnVector"]
        pub fn ComplexMatrix_solve28(this: *const root::ComplexMatrix,
                                     b: *const root::ComplexColumnVector)
         -> root::ComplexColumnVector;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix5solveERK19ComplexColumnVectorRi"]
        pub fn ComplexMatrix_solve29(this: *const root::ComplexMatrix,
                                     b: *const root::ComplexColumnVector,
                                     info: *mut root::octave_idx_type)
         -> root::ComplexColumnVector;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix5solveERK19ComplexColumnVectorRiRd"]
        pub fn ComplexMatrix_solve30(this: *const root::ComplexMatrix,
                                     b: *const root::ComplexColumnVector,
                                     info: *mut root::octave_idx_type,
                                     rcon: *mut f64)
         -> root::ComplexColumnVector;
    }
    extern "C" {
        #[link_name =
              "_ZNK13ComplexMatrix5solveERK19ComplexColumnVectorRiRdPFvdE15blas_trans_type"]
        pub fn ComplexMatrix_solve31(this: *const root::ComplexMatrix,
                                     b: *const root::ComplexColumnVector,
                                     info: *mut root::octave_idx_type,
                                     rcon: *mut f64,
                                     sing_handler:
                                         root::ComplexMatrix_solve_singularity_handler,
                                     transt: root::blas_trans_type)
         -> root::ComplexColumnVector;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix7lssolveERK6Matrix"]
        pub fn ComplexMatrix_lssolve(this: *const root::ComplexMatrix,
                                     b: *const root::Matrix)
         -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix7lssolveERK6MatrixRi"]
        pub fn ComplexMatrix_lssolve1(this: *const root::ComplexMatrix,
                                      b: *const root::Matrix,
                                      info: *mut root::octave_idx_type)
         -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix7lssolveERK6MatrixRiS3_"]
        pub fn ComplexMatrix_lssolve2(this: *const root::ComplexMatrix,
                                      b: *const root::Matrix,
                                      info: *mut root::octave_idx_type,
                                      rank: *mut root::octave_idx_type)
         -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix7lssolveERK6MatrixRiS3_Rd"]
        pub fn ComplexMatrix_lssolve3(this: *const root::ComplexMatrix,
                                      b: *const root::Matrix,
                                      info: *mut root::octave_idx_type,
                                      rank: *mut root::octave_idx_type,
                                      rcon: *mut f64) -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix7lssolveERKS_"]
        pub fn ComplexMatrix_lssolve4(this: *const root::ComplexMatrix,
                                      b: *const root::ComplexMatrix)
         -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix7lssolveERKS_Ri"]
        pub fn ComplexMatrix_lssolve5(this: *const root::ComplexMatrix,
                                      b: *const root::ComplexMatrix,
                                      info: *mut root::octave_idx_type)
         -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix7lssolveERKS_RiS2_"]
        pub fn ComplexMatrix_lssolve6(this: *const root::ComplexMatrix,
                                      b: *const root::ComplexMatrix,
                                      info: *mut root::octave_idx_type,
                                      rank: *mut root::octave_idx_type)
         -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix7lssolveERKS_RiS2_Rd"]
        pub fn ComplexMatrix_lssolve7(this: *const root::ComplexMatrix,
                                      b: *const root::ComplexMatrix,
                                      info: *mut root::octave_idx_type,
                                      rank: *mut root::octave_idx_type,
                                      rcon: *mut f64) -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix7lssolveERK12ColumnVector"]
        pub fn ComplexMatrix_lssolve8(this: *const root::ComplexMatrix,
                                      b: *const root::ColumnVector)
         -> root::ComplexColumnVector;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix7lssolveERK12ColumnVectorRi"]
        pub fn ComplexMatrix_lssolve9(this: *const root::ComplexMatrix,
                                      b: *const root::ColumnVector,
                                      info: *mut root::octave_idx_type)
         -> root::ComplexColumnVector;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix7lssolveERK12ColumnVectorRiS3_"]
        pub fn ComplexMatrix_lssolve10(this: *const root::ComplexMatrix,
                                       b: *const root::ColumnVector,
                                       info: *mut root::octave_idx_type,
                                       rank: *mut root::octave_idx_type)
         -> root::ComplexColumnVector;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix7lssolveERK12ColumnVectorRiS3_Rd"]
        pub fn ComplexMatrix_lssolve11(this: *const root::ComplexMatrix,
                                       b: *const root::ColumnVector,
                                       info: *mut root::octave_idx_type,
                                       rank: *mut root::octave_idx_type,
                                       rcon: *mut f64)
         -> root::ComplexColumnVector;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix7lssolveERK19ComplexColumnVector"]
        pub fn ComplexMatrix_lssolve12(this: *const root::ComplexMatrix,
                                       b: *const root::ComplexColumnVector)
         -> root::ComplexColumnVector;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix7lssolveERK19ComplexColumnVectorRi"]
        pub fn ComplexMatrix_lssolve13(this: *const root::ComplexMatrix,
                                       b: *const root::ComplexColumnVector,
                                       info: *mut root::octave_idx_type)
         -> root::ComplexColumnVector;
    }
    extern "C" {
        #[link_name =
              "_ZNK13ComplexMatrix7lssolveERK19ComplexColumnVectorRiS3_"]
        pub fn ComplexMatrix_lssolve14(this: *const root::ComplexMatrix,
                                       b: *const root::ComplexColumnVector,
                                       info: *mut root::octave_idx_type,
                                       rank: *mut root::octave_idx_type)
         -> root::ComplexColumnVector;
    }
    extern "C" {
        #[link_name =
              "_ZNK13ComplexMatrix7lssolveERK19ComplexColumnVectorRiS3_Rd"]
        pub fn ComplexMatrix_lssolve15(this: *const root::ComplexMatrix,
                                       b: *const root::ComplexColumnVector,
                                       info: *mut root::octave_idx_type,
                                       rank: *mut root::octave_idx_type,
                                       rcon: *mut f64)
         -> root::ComplexColumnVector;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix3allEi"]
        pub fn ComplexMatrix_all(this: *const root::ComplexMatrix,
                                 dim: ::std::os::raw::c_int)
         -> root::boolMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix3anyEi"]
        pub fn ComplexMatrix_any(this: *const root::ComplexMatrix,
                                 dim: ::std::os::raw::c_int)
         -> root::boolMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix7cumprodEi"]
        pub fn ComplexMatrix_cumprod(this: *const root::ComplexMatrix,
                                     dim: ::std::os::raw::c_int)
         -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix6cumsumEi"]
        pub fn ComplexMatrix_cumsum(this: *const root::ComplexMatrix,
                                    dim: ::std::os::raw::c_int)
         -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix4prodEi"]
        pub fn ComplexMatrix_prod(this: *const root::ComplexMatrix,
                                  dim: ::std::os::raw::c_int)
         -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix3sumEi"]
        pub fn ComplexMatrix_sum(this: *const root::ComplexMatrix,
                                 dim: ::std::os::raw::c_int)
         -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix5sumsqEi"]
        pub fn ComplexMatrix_sumsq(this: *const root::ComplexMatrix,
                                   dim: ::std::os::raw::c_int)
         -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix3absEv"]
        pub fn ComplexMatrix_abs(this: *const root::ComplexMatrix)
         -> root::Matrix;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix4diagEi"]
        pub fn ComplexMatrix_diag(this: *const root::ComplexMatrix,
                                  k: root::octave_idx_type)
         -> root::ComplexMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix4diagEii"]
        pub fn ComplexMatrix_diag1(this: *const root::ComplexMatrix,
                                   m: root::octave_idx_type,
                                   n: root::octave_idx_type)
         -> root::ComplexDiagMatrix;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix16row_is_real_onlyEi"]
        pub fn ComplexMatrix_row_is_real_only(this:
                                                  *const root::ComplexMatrix,
                                              arg1: root::octave_idx_type)
         -> bool;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix19column_is_real_onlyEi"]
        pub fn ComplexMatrix_column_is_real_only(this:
                                                     *const root::ComplexMatrix,
                                                 arg1: root::octave_idx_type)
         -> bool;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix7row_minEv"]
        pub fn ComplexMatrix_row_min(this: *const root::ComplexMatrix)
         -> root::ComplexColumnVector;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix7row_maxEv"]
        pub fn ComplexMatrix_row_max(this: *const root::ComplexMatrix)
         -> root::ComplexColumnVector;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix7row_minER5ArrayIiE"]
        pub fn ComplexMatrix_row_min1(this: *const root::ComplexMatrix,
                                      index:
                                          *mut root::Array<::std::os::raw::c_int>)
         -> root::ComplexColumnVector;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix7row_maxER5ArrayIiE"]
        pub fn ComplexMatrix_row_max1(this: *const root::ComplexMatrix,
                                      index:
                                          *mut root::Array<::std::os::raw::c_int>)
         -> root::ComplexColumnVector;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix10column_minEv"]
        pub fn ComplexMatrix_column_min(this: *const root::ComplexMatrix)
         -> root::ComplexRowVector;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix10column_maxEv"]
        pub fn ComplexMatrix_column_max(this: *const root::ComplexMatrix)
         -> root::ComplexRowVector;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix10column_minER5ArrayIiE"]
        pub fn ComplexMatrix_column_min1(this: *const root::ComplexMatrix,
                                         index:
                                             *mut root::Array<::std::os::raw::c_int>)
         -> root::ComplexRowVector;
    }
    extern "C" {
        #[link_name = "_ZNK13ComplexMatrix10column_maxER5ArrayIiE"]
        pub fn ComplexMatrix_column_max1(this: *const root::ComplexMatrix,
                                         index:
                                             *mut root::Array<::std::os::raw::c_int>)
         -> root::ComplexRowVector;
    }
    extern "C" {
        #[link_name = "_ZN13ComplexMatrixC1ERK6MatrixS2_"]
        pub fn ComplexMatrix_ComplexMatrix(this: *mut root::ComplexMatrix,
                                           re: *const root::Matrix,
                                           im: *const root::Matrix);
    }
    extern "C" {
        #[link_name = "_ZN13ComplexMatrixC1ERK6Matrix"]
        pub fn ComplexMatrix_ComplexMatrix1(this: *mut root::ComplexMatrix,
                                            a: *const root::Matrix);
    }
    extern "C" {
        #[link_name = "_ZN13ComplexMatrixC1ERK9RowVector"]
        pub fn ComplexMatrix_ComplexMatrix2(this: *mut root::ComplexMatrix,
                                            rv: *const root::RowVector);
    }
    extern "C" {
        #[link_name = "_ZN13ComplexMatrixC1ERK12ColumnVector"]
        pub fn ComplexMatrix_ComplexMatrix3(this: *mut root::ComplexMatrix,
                                            cv: *const root::ColumnVector);
    }
    extern "C" {
        #[link_name = "_ZN13ComplexMatrixC1ERK10DiagMatrix"]
        pub fn ComplexMatrix_ComplexMatrix4(this: *mut root::ComplexMatrix,
                                            a: *const root::DiagMatrix);
    }
    extern "C" {
        #[link_name = "_ZN13ComplexMatrixC1ERK11MDiagArray2IdE"]
        pub fn ComplexMatrix_ComplexMatrix5(this: *mut root::ComplexMatrix,
                                            a: *const root::MDiagArray2<f64>);
    }
    extern "C" {
        #[link_name = "_ZN13ComplexMatrixC1ERK10DiagArray2IdE"]
        pub fn ComplexMatrix_ComplexMatrix6(this: *mut root::ComplexMatrix,
                                            a: *const root::DiagArray2<f64>);
    }
    extern "C" {
        #[link_name = "_ZN13ComplexMatrixC1ERK16ComplexRowVector"]
        pub fn ComplexMatrix_ComplexMatrix7(this: *mut root::ComplexMatrix,
                                            rv:
                                                *const root::ComplexRowVector);
    }
    extern "C" {
        #[link_name = "_ZN13ComplexMatrixC1ERK19ComplexColumnVector"]
        pub fn ComplexMatrix_ComplexMatrix8(this: *mut root::ComplexMatrix,
                                            cv:
                                                *const root::ComplexColumnVector);
    }
    extern "C" {
        #[link_name = "_ZN13ComplexMatrixC1ERK17ComplexDiagMatrix"]
        pub fn ComplexMatrix_ComplexMatrix9(this: *mut root::ComplexMatrix,
                                            a:
                                                *const root::ComplexDiagMatrix);
    }
    extern "C" {
        #[link_name = "_ZN13ComplexMatrixC1ERK11MDiagArray2ISt7complexIdEE"]
        pub fn ComplexMatrix_ComplexMatrix10(this: *mut root::ComplexMatrix,
                                             a:
                                                 *const root::MDiagArray2<root::std::complex<f64>>);
    }
    extern "C" {
        #[link_name = "_ZN13ComplexMatrixC1ERK10DiagArray2ISt7complexIdEE"]
        pub fn ComplexMatrix_ComplexMatrix11(this: *mut root::ComplexMatrix,
                                             a:
                                                 *const root::DiagArray2<root::std::complex<f64>>);
    }
    extern "C" {
        #[link_name = "_ZN13ComplexMatrixC1ERK10boolMatrix"]
        pub fn ComplexMatrix_ComplexMatrix12(this: *mut root::ComplexMatrix,
                                             a: *const root::boolMatrix);
    }
    extern "C" {
        #[link_name = "_ZN13ComplexMatrixC1ERK10charMatrix"]
        pub fn ComplexMatrix_ComplexMatrix13(this: *mut root::ComplexMatrix,
                                             a: *const root::charMatrix);
    }
    impl ComplexMatrix {
        #[inline]
        pub unsafe fn is_hermitian(&self) -> bool {
            ComplexMatrix_is_hermitian(self)
        }
        #[inline]
        pub unsafe fn insert(&mut self, a: *const root::Matrix,
                             r: root::octave_idx_type,
                             c: root::octave_idx_type)
         -> *mut root::ComplexMatrix {
            ComplexMatrix_insert(self, a, r, c)
        }
        #[inline]
        pub unsafe fn insert1(&mut self, a: *const root::RowVector,
                              r: root::octave_idx_type,
                              c: root::octave_idx_type)
         -> *mut root::ComplexMatrix {
            ComplexMatrix_insert1(self, a, r, c)
        }
        #[inline]
        pub unsafe fn insert2(&mut self, a: *const root::ColumnVector,
                              r: root::octave_idx_type,
                              c: root::octave_idx_type)
         -> *mut root::ComplexMatrix {
            ComplexMatrix_insert2(self, a, r, c)
        }
        #[inline]
        pub unsafe fn insert3(&mut self, a: *const root::DiagMatrix,
                              r: root::octave_idx_type,
                              c: root::octave_idx_type)
         -> *mut root::ComplexMatrix {
            ComplexMatrix_insert3(self, a, r, c)
        }
        #[inline]
        pub unsafe fn insert4(&mut self, a: *const root::ComplexMatrix,
                              r: root::octave_idx_type,
                              c: root::octave_idx_type)
         -> *mut root::ComplexMatrix {
            ComplexMatrix_insert4(self, a, r, c)
        }
        #[inline]
        pub unsafe fn insert5(&mut self, a: *const root::ComplexRowVector,
                              r: root::octave_idx_type,
                              c: root::octave_idx_type)
         -> *mut root::ComplexMatrix {
            ComplexMatrix_insert5(self, a, r, c)
        }
        #[inline]
        pub unsafe fn insert6(&mut self, a: *const root::ComplexColumnVector,
                              r: root::octave_idx_type,
                              c: root::octave_idx_type)
         -> *mut root::ComplexMatrix {
            ComplexMatrix_insert6(self, a, r, c)
        }
        #[inline]
        pub unsafe fn insert7(&mut self, a: *const root::ComplexDiagMatrix,
                              r: root::octave_idx_type,
                              c: root::octave_idx_type)
         -> *mut root::ComplexMatrix {
            ComplexMatrix_insert7(self, a, r, c)
        }
        #[inline]
        pub unsafe fn fill(&mut self, val: f64) -> *mut root::ComplexMatrix {
            ComplexMatrix_fill(self, val)
        }
        #[inline]
        pub unsafe fn fill1(&mut self, val: *const root::Complex)
         -> *mut root::ComplexMatrix {
            ComplexMatrix_fill1(self, val)
        }
        #[inline]
        pub unsafe fn fill2(&mut self, val: f64, r1: root::octave_idx_type,
                            c1: root::octave_idx_type,
                            r2: root::octave_idx_type,
                            c2: root::octave_idx_type)
