/* automatically generated by rust-bindgen */

pub type std_nullptr_t = *const ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug)]
pub struct std_allocator {
    pub _address: u8,
}
pub type std_allocator_size_type = usize;
pub type std_allocator_difference_type = isize;
pub type std_allocator_pointer<_Tp> = *mut _Tp;
pub type std_allocator_const_pointer<_Tp> = *mut _Tp;
pub type std_allocator_reference<_Tp> = *mut _Tp;
pub type std_allocator_const_reference<_Tp> = *mut _Tp;
pub type std_allocator_value_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_allocator_rebind {
    pub _address: u8,
}
pub type std_allocator_rebind_other = std_allocator;
pub type std_allocator_propagate_on_container_move_assignment = std_true_type;
#[test]
fn __bindgen_test_layout_std_allocator_instantiation_374() {
    assert_eq!(::std::mem::size_of::<std_allocator>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! (
               std_allocator ) ));
    assert_eq!(::std::mem::align_of::<std_allocator>() , 1usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std_allocator ) ));
}
#[repr(C)]
pub struct std_uses_allocator {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_char_traits {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug)]
pub struct std_basic_string<_CharT, _Alloc> {
    pub _M_dataplus: std_basic_string__Alloc_hider<_CharT, _Alloc>,
}

    assert_eq!(::std::mem::align_of::<std_char_traits>() , 1usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std_char_traits ) ));
}
pub type std_u16string = std_basic_string<u16, std_allocator>;
pub type std_u32string = std_basic_string<u32, std_allocator>;
extern "C" {
    #[link_name = "?__throw_bad_exception@std@@YAXXZ"]
    pub fn std___throw_bad_exception();
}
extern "C" {
    #[link_name = "?__throw_bad_alloc@std@@YAXXZ"]
    pub fn std___throw_bad_alloc();
}
extern "C" {
    #[link_name = "?__throw_bad_cast@std@@YAXXZ"]
    pub fn std___throw_bad_cast();
}
extern "C" {
    #[link_name = "?__throw_bad_typeid@std@@YAXXZ"]
    pub fn std___throw_bad_typeid();
}
extern "C" {
    #[link_name = "?__throw_logic_error@std@@YAXPEBD@Z"]
    pub fn std___throw_logic_error(arg1: *const ::std::os::raw::c_char);
}
extern "C" {
    #[link_name = "?__throw_domain_error@std@@YAXPEBD@Z"]
    pub fn std___throw_domain_error(arg1: *const ::std::os::raw::c_char);
}
extern "C" {
    #[link_name = "?__throw_invalid_argument@std@@YAXPEBD@Z"]
    pub fn std___throw_invalid_argument(arg1: *const ::std::os::raw::c_char);
}
extern "C" {
    #[link_name = "?__throw_length_error@std@@YAXPEBD@Z"]
    pub fn std___throw_length_error(arg1: *const ::std::os::raw::c_char);
}
extern "C" {
    #[link_name = "?__throw_out_of_range@std@@YAXPEBD@Z"]
    pub fn std___throw_out_of_range(arg1: *const ::std::os::raw::c_char);
}
extern "C" {
    #[link_name = "?__throw_out_of_range_fmt@std@@YAXPEBDZZ"]
    pub fn std___throw_out_of_range_fmt(arg1:
                                            *const ::std::os::raw::c_char, ...);
}
extern "C" {
    #[link_name = "?__throw_runtime_error@std@@YAXPEBD@Z"]
    pub fn std___throw_runtime_error(arg1: *const ::std::os::raw::c_char);
}
extern "C" {
    #[link_name = "?__throw_range_error@std@@YAXPEBD@Z"]
    pub fn std___throw_range_error(arg1: *const ::std::os::raw::c_char);
}
extern "C" {
    #[link_name = "?__throw_overflow_error@std@@YAXPEBD@Z"]
    pub fn std___throw_overflow_error(arg1: *const ::std::os::raw::c_char);
}
extern "C" {
    #[link_name = "?__throw_underflow_error@std@@YAXPEBD@Z"]
    pub fn std___throw_underflow_error(arg1: *const ::std::os::raw::c_char);
}
extern "C" {
    #[link_name = "?__throw_ios_failure@std@@YAXPEBD@Z"]
    pub fn std___throw_ios_failure(arg1: *const ::std::os::raw::c_char);
}
extern "C" {
    #[link_name = "?__throw_system_error@std@@YAXH@Z"]
    pub fn std___throw_system_error(arg1: ::std::os::raw::c_int);
}
extern "C" {
    #[link_name = "?__throw_future_error@std@@YAXH@Z"]
    pub fn std___throw_future_error(arg1: ::std::os::raw::c_int);
}
extern "C" {
    #[link_name = "?__throw_bad_function_call@std@@YAXXZ"]
    pub fn std___throw_bad_function_call();
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct std___true_type {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std___true_type() {
    assert_eq!(::std::mem::size_of::<std___true_type>() , 1usize , concat ! (
               "Size of: " , stringify ! ( std___true_type ) ));
    assert_eq! (::std::mem::align_of::<std___true_type>() , 1usize , concat !
                ( "Alignment of " , stringify ! ( std___true_type ) ));
}
impl Clone for std___true_type {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct std___false_type {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std___false_type() {
    assert_eq!(::std::mem::size_of::<std___false_type>() , 1usize , concat ! (
               "Size of: " , stringify ! ( std___false_type ) ));
    assert_eq! (::std::mem::align_of::<std___false_type>() , 1usize , concat !
                ( "Alignment of " , stringify ! ( std___false_type ) ));
}
impl Clone for std___false_type {
    fn clone(&self) -> Self { *self }
}
#[test]
fn __bindgen_test_layout_std___truth_type_instantiation_648() {
    assert_eq!(::std::mem::size_of::<u8>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! ( u8 ) ));
    assert_eq!(::std::mem::align_of::<u8>() , 1usize , concat ! (
               "Alignment of template specialization: " , stringify ! ( u8 )
               ));
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___traitor {
    pub _address: u8,
}
pub const std___traitor___value: std___traitor__bindgen_ty_1 =
    std___traitor__bindgen_ty_1::__value;
#[repr(i32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum std___traitor__bindgen_ty_1 { __value = 0, }
pub type std___traitor___type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___are_same {
    pub _address: u8,
}
pub const std___are_same___value: std___are_same__bindgen_ty_1 =
    std___are_same__bindgen_ty_1::__value;
#[repr(i32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum std___are_same__bindgen_ty_1 { __value = 0, }
pub type std___are_same___type = std___false_type;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_void {
    pub _address: u8,
}
pub const std___is_void___value: std___is_void__bindgen_ty_1 =
    std___is_void__bindgen_ty_1::__value;
#[repr(i32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum std___is_void__bindgen_ty_1 { __value = 0, }
pub type std___is_void___type = std___false_type;
#[test]
fn __bindgen_test_layout_std___is_void_instantiation_674() {
    assert_eq!(::std::mem::size_of::<std___is_void>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! (
               std___is_void ) ));
    assert_eq!(::std::mem::align_of::<std___is_void>() , 1usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std___is_void ) ));
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_integer {
    pub _address: u8,
}
pub const std___is_integer___value: std___is_integer__bindgen_ty_1 =
    std___is_integer__bindgen_ty_1::__value;
#[repr(i32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum std___is_integer__bindgen_ty_1 { __value = 0, }
pub type std___is_integer___type = std___false_type;
#[test]
fn __bindgen_test_layout_std___is_integer_instantiation_685() {
    assert_eq!(::std::mem::size_of::<std___is_integer>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! (
               std___is_integer ) ));
    assert_eq!(::std::mem::align_of::<std___is_integer>() , 1usize , concat !
               (
               "Alignment of template specialization: " , stringify ! (
               std___is_integer ) ));
}
#[test]
fn __bindgen_test_layout_std___is_integer_instantiation_689() {
    assert_eq!(::std::mem::size_of::<std___is_integer>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! (
               std___is_integer ) ));
    assert_eq!(::std::mem::align_of::<std___is_integer>() , 1usize , concat !
               (
               "Alignment of template specialization: " , stringify ! (
               std___is_integer ) ));
}
#[test]
fn __bindgen_test_layout_std___is_integer_instantiation_693() {
    assert_eq!(::std::mem::size_of::<std___is_integer>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! (
               std___is_integer ) ));
    assert_eq!(::std::mem::align_of::<std___is_integer>() , 1usize , concat !
               (
               "Alignment of template specialization: " , stringify ! (
               std___is_integer ) ));
}
#[test]
fn __bindgen_test_layout_std___is_integer_instantiation_697() {
    assert_eq!(::std::mem::size_of::<std___is_integer>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! (
               std___is_integer ) ));
    assert_eq!(::std::mem::align_of::<std___is_integer>() , 1usize , concat !
               (
               "Alignment of template specialization: " , stringify ! (
               std___is_integer ) ));
}
#[test]
fn __bindgen_test_layout_std___is_integer_instantiation_701() {
    assert_eq!(::std::mem::size_of::<std___is_integer>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! (
               std___is_integer ) ));
    assert_eq!(::std::mem::align_of::<std___is_integer>() , 1usize , concat !
               (
               "Alignment of template specialization: " , stringify ! (
               std___is_integer ) ));
}
#[test]
fn __bindgen_test_layout_std___is_integer_instantiation_705() {
    assert_eq!(::std::mem::size_of::<std___is_integer>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! (
               std___is_integer ) ));
    assert_eq!(::std::mem::align_of::<std___is_integer>() , 1usize , concat !
               (
               "Alignment of template specialization: " , stringify ! (
               std___is_integer ) ));
}
#[test]
fn __bindgen_test_layout_std___is_integer_instantiation_709() {
    assert_eq!(::std::mem::size_of::<std___is_integer>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! (
               std___is_integer ) ));
    assert_eq!(::std::mem::align_of::<std___is_integer>() , 1usize , concat !
               (
               "Alignment of template specialization: " , stringify ! (
               std___is_integer ) ));
}
#[test]
fn __bindgen_test_layout_std___is_integer_instantiation_713() {
    assert_eq!(::std::mem::size_of::<std___is_integer>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! (
               std___is_integer ) ));
    assert_eq!(::std::mem::align_of::<std___is_integer>() , 1usize , concat !
               (
               "Alignment of template specialization: " , stringify ! (
               std___is_integer ) ));
}
#[test]
fn __bindgen_test_layout_std___is_integer_instantiation_717() {
    assert_eq!(::std::mem::size_of::<std___is_integer>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! (
               std___is_integer ) ));
    assert_eq!(::std::mem::align_of::<std___is_integer>() , 1usize , concat !
               (
               "Alignment of template specialization: " , stringify ! (
               std___is_integer ) ));
}
#[test]
fn __bindgen_test_layout_std___is_integer_instantiation_721() {
    assert_eq!(::std::mem::size_of::<std___is_integer>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! (
               std___is_integer ) ));
    assert_eq!(::std::mem::align_of::<std___is_integer>() , 1usize , concat !
               (
               "Alignment of template specialization: " , stringify ! (
               std___is_integer ) ));
}
#[test]
fn __bindgen_test_layout_std___is_integer_instantiation_725() {
    assert_eq!(::std::mem::size_of::<std___is_integer>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! (
               std___is_integer ) ));
    assert_eq!(::std::mem::align_of::<std___is_integer>() , 1usize , concat !
               (
               "Alignment of template specialization: " , stringify ! (
               std___is_integer ) ));
}
#[test]
fn __bindgen_test_layout_std___is_integer_instantiation_729() {
    assert_eq!(::std::mem::size_of::<std___is_integer>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! (
               std___is_integer ) ));
    assert_eq!(::std::mem::align_of::<std___is_integer>() , 1usize , concat !
               (
               "Alignment of template specialization: " , stringify ! (
               std___is_integer ) ));
}
#[test]
fn __bindgen_test_layout_std___is_integer_instantiation_733() {
    assert_eq!(::std::mem::size_of::<std___is_integer>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! (
               std___is_integer ) ));
    assert_eq!(::std::mem::align_of::<std___is_integer>() , 1usize , concat !
               (
               "Alignment of template specialization: " , stringify ! (
               std___is_integer ) ));
}
#[test]
fn __bindgen_test_layout_std___is_integer_instantiation_737() {
    assert_eq!(::std::mem::size_of::<std___is_integer>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! (
               std___is_integer ) ));
    assert_eq!(::std::mem::align_of::<std___is_integer>() , 1usize , concat !
               (
               "Alignment of template specialization: " , stringify ! (
               std___is_integer ) ));
}
#[test]
fn __bindgen_test_layout_std___is_integer_instantiation_741() {
    assert_eq!(::std::mem::size_of::<std___is_integer>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! (
               std___is_integer ) ));
    assert_eq!(::std::mem::align_of::<std___is_integer>() , 1usize , concat !
               (
               "Alignment of template specialization: " , stringify ! (
               std___is_integer ) ));
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_floating {
    pub _address: u8,
}
pub const std___is_floating___value: std___is_floating__bindgen_ty_1 =
    std___is_floating__bindgen_ty_1::__value;
#[repr(i32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum std___is_floating__bindgen_ty_1 { __value = 0, }
pub type std___is_floating___type = std___false_type;
#[test]
fn __bindgen_test_layout_std___is_floating_instantiation_752() {
    assert_eq!(::std::mem::size_of::<std___is_floating>() , 1usize , concat !
               (
               "Size of template specialization: " , stringify ! (
               std___is_floating ) ));
    assert_eq!(::std::mem::align_of::<std___is_floating>() , 1usize , concat !
               (
               "Alignment of template specialization: " , stringify ! (
               std___is_floating ) ));
}
#[test]
fn __bindgen_test_layout_std___is_floating_instantiation_756() {
    assert_eq!(::std::mem::size_of::<std___is_floating>() , 1usize , concat !
               (
               "Size of template specialization: " , stringify ! (
               std___is_floating ) ));
    assert_eq!(::std::mem::align_of::<std___is_floating>() , 1usize , concat !
               (
               "Alignment of template specialization: " , stringify ! (
               std___is_floating ) ));
}
#[test]
fn __bindgen_test_layout_std___is_floating_instantiation_760() {
    assert_eq!(::std::mem::size_of::<std___is_floating>() , 1usize , concat !
               (
               "Size of template specialization: " , stringify ! (
               std___is_floating ) ));
    assert_eq!(::std::mem::align_of::<std___is_floating>() , 1usize , concat !
               (
               "Alignment of template specialization: " , stringify ! (
               std___is_floating ) ));
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_pointer {
    pub _address: u8,
}
pub const std___is_pointer___value: std___is_pointer__bindgen_ty_1 =
    std___is_pointer__bindgen_ty_1::__value;
#[repr(i32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum std___is_pointer__bindgen_ty_1 { __value = 0, }
pub type std___is_pointer___type = std___false_type;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_normal_iterator {
    pub _address: u8,
}
pub const std___is_normal_iterator___value:
          std___is_normal_iterator__bindgen_ty_1 =
    std___is_normal_iterator__bindgen_ty_1::__value;
#[repr(i32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum std___is_normal_iterator__bindgen_ty_1 { __value = 0, }
pub type std___is_normal_iterator___type = std___false_type;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_arithmetic {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_scalar {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_char {
    pub _address: u8,
}
pub const std___is_char___value: std___is_char__bindgen_ty_1 =
    std___is_char__bindgen_ty_1::__value;
#[repr(i32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum std___is_char__bindgen_ty_1 { __value = 0, }
pub type std___is_char___type = std___false_type;
#[test]
fn __bindgen_test_layout_std___is_char_instantiation_801() {
    assert_eq!(::std::mem::size_of::<std___is_char>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! (
               std___is_char ) ));
    assert_eq!(::std::mem::align_of::<std___is_char>() , 1usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std___is_char ) ));
}
#[test]
fn __bindgen_test_layout_std___is_char_instantiation_805() {
    assert_eq!(::std::mem::size_of::<std___is_char>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! (
               std___is_char ) ));
    assert_eq!(::std::mem::align_of::<std___is_char>() , 1usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std___is_char ) ));
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_byte {
    pub _address: u8,
}
pub const std___is_byte___value: std___is_byte__bindgen_ty_1 =
    std___is_byte__bindgen_ty_1::__value;
#[repr(i32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum std___is_byte__bindgen_ty_1 { __value = 0, }
pub type std___is_byte___type = std___false_type;
#[test]
fn __bindgen_test_layout_std___is_byte_instantiation_816() {
    assert_eq!(::std::mem::size_of::<std___is_byte>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! (
               std___is_byte ) ));
    assert_eq!(::std::mem::align_of::<std___is_byte>() , 1usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std___is_byte ) ));
}
#[test]
fn __bindgen_test_layout_std___is_byte_instantiation_820() {
    assert_eq!(::std::mem::size_of::<std___is_byte>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! (
               std___is_byte ) ));
    assert_eq!(::std::mem::align_of::<std___is_byte>() , 1usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std___is_byte ) ));
}
#[test]
fn __bindgen_test_layout_std___is_byte_instantiation_824() {
    assert_eq!(::std::mem::size_of::<std___is_byte>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! (
               std___is_byte ) ));
    assert_eq!(::std::mem::align_of::<std___is_byte>() , 1usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std___is_byte ) ));
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_move_iterator {
    pub _address: u8,
}
pub const std___is_move_iterator___value: std___is_move_iterator__bindgen_ty_1
          =
    std___is_move_iterator__bindgen_ty_1::__value;
#[repr(i32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum std___is_move_iterator__bindgen_ty_1 { __value = 0, }
pub type std___is_move_iterator___type = std___false_type;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_move_iterator<_Iterator> {
    pub _M_current: _Iterator,
}
pub type std_move_iterator___traits_type = std_iterator_traits;
pub type std_move_iterator_iterator_type<_Iterator> = _Iterator;
pub type std_move_iterator_iterator_category =
    std_move_iterator___traits_type;
pub type std_move_iterator_value_type = std_move_iterator___traits_type;
pub type std_move_iterator_difference_type = std_move_iterator___traits_type;
pub type std_move_iterator_pointer<_Iterator> = _Iterator;
pub type std_move_iterator_reference = *mut std_move_iterator_value_type;
extern "C" {
    #[link_name = "value"]
    pub static std_value: _Tp;
}
pub type std_true_type = u8;
pub type std_false_type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___or_ {
    pub _address: u8,
}
#[test]
fn __bindgen_test_layout_std___or__instantiation_1083() {
    assert_eq!(::std::mem::size_of::<std___or_>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! ( std___or_ )
               ));
    assert_eq!(::std::mem::align_of::<std___or_>() , 1usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std___or_ ) ));
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___and_ {
    pub _address: u8,
}
#[test]
fn __bindgen_test_layout_std___and__instantiation_1090() {
    assert_eq!(::std::mem::size_of::<std___and_>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! ( std___and_
               ) ));
    assert_eq!(::std::mem::align_of::<std___and_>() , 1usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std___and_ ) ));
}
#[repr(C)]
pub struct std___not_ {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___success_type {
    pub _address: u8,
}
pub type std___success_type_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct std___failure_type {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std___failure_type() {
    assert_eq!(::std::mem::size_of::<std___failure_type>() , 1usize , concat !
               ( "Size of: " , stringify ! ( std___failure_type ) ));
    assert_eq! (::std::mem::align_of::<std___failure_type>() , 1usize , concat
                ! ( "Alignment of " , stringify ! ( std___failure_type ) ));
}
impl Clone for std___failure_type {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_remove_cv {
    pub _address: u8,
}
pub type std_remove_cv_type = std_remove_const;
#[repr(C)]
pub struct std___is_void_helper {
    pub _address: u8,
}
#[test]
fn __bindgen_test_layout_std___is_void_helper_instantiation_1110() {
    assert_eq!(::std::mem::size_of::<std___is_void_helper>() , 1usize , concat
               ! (
               "Size of template specialization: " , stringify ! (
               std___is_void_helper ) ));
    assert_eq!(::std::mem::align_of::<std___is_void_helper>() , 1usize ,
               concat ! (
               "Alignment of template specialization: " , stringify ! (
               std___is_void_helper ) ));
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_void {
    pub _address: u8,
}
#[repr(C)]
pub struct std___is_integral_helper {
    pub _address: u8,
}
#[test]
fn __bindgen_test_layout_std___is_integral_helper_instantiation_1120() {
    assert_eq!(::std::mem::size_of::<std___is_integral_helper>() , 1usize ,
               concat ! (
               "Size of template specialization: " , stringify ! (
               std___is_integral_helper ) ));
    assert_eq!(::std::mem::align_of::<std___is_integral_helper>() , 1usize ,
               concat ! (
               "Alignment of template specialization: " , stringify ! (
               std___is_integral_helper ) ));
}
#[test]
fn __bindgen_test_layout_std___is_integral_helper_instantiation_1124() {
    assert_eq!(::std::mem::size_of::<std___is_integral_helper>() , 1usize ,
               concat ! (
               "Size of template specialization: " , stringify ! (
               std___is_integral_helper ) ));
    assert_eq!(::std::mem::align_of::<std___is_integral_helper>() , 1usize ,
               concat ! (
               "Alignment of template specialization: " , stringify ! (
               std___is_integral_helper ) ));
}
#[test]
fn __bindgen_test_layout_std___is_integral_helper_instantiation_1128() {
    assert_eq!(::std::mem::size_of::<std___is_integral_helper>() , 1usize ,
               concat ! (
               "Size of template specialization: " , stringify ! (
               std___is_integral_helper ) ));
    assert_eq!(::std::mem::align_of::<std___is_integral_helper>() , 1usize ,
               concat ! (
               "Alignment of template specialization: " , stringify ! (
               std___is_integral_helper ) ));
}
#[test]
fn __bindgen_test_layout_std___is_integral_helper_instantiation_1132() {
    assert_eq!(::std::mem::size_of::<std___is_integral_helper>() , 1usize ,
               concat ! (
               "Size of template specialization: " , stringify ! (
               std___is_integral_helper ) ));
    assert_eq!(::std::mem::align_of::<std___is_integral_helper>() , 1usize ,
               concat ! (
               "Alignment of template specialization: " , stringify ! (
               std___is_integral_helper ) ));
}
#[test]
fn __bindgen_test_layout_std___is_integral_helper_instantiation_1136() {
    assert_eq!(::std::mem::size_of::<std___is_integral_helper>() , 1usize ,
               concat ! (
               "Size of template specialization: " , stringify ! (
               std___is_integral_helper ) ));
    assert_eq!(::std::mem::align_of::<std___is_integral_helper>() , 1usize ,
               concat ! (
               "Alignment of template specialization: " , stringify ! (
               std___is_integral_helper ) ));
}
#[test]
fn __bindgen_test_layout_std___is_integral_helper_instantiation_1140() {
    assert_eq!(::std::mem::size_of::<std___is_integral_helper>() , 1usize ,
               concat ! (
               "Size of template specialization: " , stringify ! (
               std___is_integral_helper ) ));
    assert_eq!(::std::mem::align_of::<std___is_integral_helper>() , 1usize ,
               concat ! (
               "Alignment of template specialization: " , stringify ! (
               std___is_integral_helper ) ));
}
#[test]
fn __bindgen_test_layout_std___is_integral_helper_instantiation_1144() {
    assert_eq!(::std::mem::size_of::<std___is_integral_helper>() , 1usize ,
               concat ! (
               "Size of template specialization: " , stringify ! (
               std___is_integral_helper ) ));
    assert_eq!(::std::mem::align_of::<std___is_integral_helper>() , 1usize ,
               concat ! (
               "Alignment of template specialization: " , stringify ! (
               std___is_integral_helper ) ));
}
#[test]
fn __bindgen_test_layout_std___is_integral_helper_instantiation_1148() {
    assert_eq!(::std::mem::size_of::<std___is_integral_helper>() , 1usize ,
               concat ! (
               "Size of template specialization: " , stringify ! (
               std___is_integral_helper ) ));
    assert_eq!(::std::mem::align_of::<std___is_integral_helper>() , 1usize ,
               concat ! (
               "Alignment of template specialization: " , stringify ! (
               std___is_integral_helper ) ));
}
#[test]
fn __bindgen_test_layout_std___is_integral_helper_instantiation_1152() {
    assert_eq!(::std::mem::size_of::<std___is_integral_helper>() , 1usize ,
               concat ! (
               "Size of template specialization: " , stringify ! (
               std___is_integral_helper ) ));
    assert_eq!(::std::mem::align_of::<std___is_integral_helper>() , 1usize ,
               concat ! (
               "Alignment of template specialization: " , stringify ! (
               std___is_integral_helper ) ));
}
#[test]
fn __bindgen_test_layout_std___is_integral_helper_instantiation_1156() {
    assert_eq!(::std::mem::size_of::<std___is_integral_helper>() , 1usize ,
               concat ! (
               "Size of template specialization: " , stringify ! (
               std___is_integral_helper ) ));
    assert_eq!(::std::mem::align_of::<std___is_integral_helper>() , 1usize ,
               concat ! (
               "Alignment of template specialization: " , stringify ! (
               std___is_integral_helper ) ));
}
#[test]
fn __bindgen_test_layout_std___is_integral_helper_instantiation_1160() {
    assert_eq!(::std::mem::size_of::<std___is_integral_helper>() , 1usize ,
               concat ! (
               "Size of template specialization: " , stringify ! (
               std___is_integral_helper ) ));
    assert_eq!(::std::mem::align_of::<std___is_integral_helper>() , 1usize ,
               concat ! (
               "Alignment of template specialization: " , stringify ! (
               std___is_integral_helper ) ));
}
#[test]
fn __bindgen_test_layout_std___is_integral_helper_instantiation_1164() {
    assert_eq!(::std::mem::size_of::<std___is_integral_helper>() , 1usize ,
               concat ! (
               "Size of template specialization: " , stringify ! (
               std___is_integral_helper ) ));
    assert_eq!(::std::mem::align_of::<std___is_integral_helper>() , 1usize ,
               concat ! (
               "Alignment of template specialization: " , stringify ! (
               std___is_integral_helper ) ));
}
#[test]
fn __bindgen_test_layout_std___is_integral_helper_instantiation_1168() {
    assert_eq!(::std::mem::size_of::<std___is_integral_helper>() , 1usize ,
               concat ! (
               "Size of template specialization: " , stringify ! (
               std___is_integral_helper ) ));
    assert_eq!(::std::mem::align_of::<std___is_integral_helper>() , 1usize ,
               concat ! (
               "Alignment of template specialization: " , stringify ! (
               std___is_integral_helper ) ));
}
#[test]
fn __bindgen_test_layout_std___is_integral_helper_instantiation_1172() {
    assert_eq!(::std::mem::size_of::<std___is_integral_helper>() , 1usize ,
               concat ! (
               "Size of template specialization: " , stringify ! (
               std___is_integral_helper ) ));
    assert_eq!(::std::mem::align_of::<std___is_integral_helper>() , 1usize ,
               concat ! (
               "Alignment of template specialization: " , stringify ! (
               std___is_integral_helper ) ));
}
#[test]
fn __bindgen_test_layout_std___is_integral_helper_instantiation_1176() {
    assert_eq!(::std::mem::size_of::<std___is_integral_helper>() , 1usize ,
               concat ! (
               "Size of template specialization: " , stringify ! (
               std___is_integral_helper ) ));
    assert_eq!(::std::mem::align_of::<std___is_integral_helper>() , 1usize ,
               concat ! (
               "Alignment of template specialization: " , stringify ! (
               std___is_integral_helper ) ));
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_integral {
    pub _address: u8,
}
#[repr(C)]
pub struct std___is_floating_point_helper {
    pub _address: u8,
}
#[test]
fn __bindgen_test_layout_std___is_floating_point_helper_instantiation_1186() {
    assert_eq!(::std::mem::size_of::<std___is_floating_point_helper>() ,
               1usize , concat ! (
               "Size of template specialization: " , stringify ! (
               std___is_floating_point_helper ) ));
    assert_eq!(::std::mem::align_of::<std___is_floating_point_helper>() ,
               1usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std___is_floating_point_helper ) ));
}
#[test]
fn __bindgen_test_layout_std___is_floating_point_helper_instantiation_1190() {
    assert_eq!(::std::mem::size_of::<std___is_floating_point_helper>() ,
               1usize , concat ! (
               "Size of template specialization: " , stringify ! (
               std___is_floating_point_helper ) ));
    assert_eq!(::std::mem::align_of::<std___is_floating_point_helper>() ,
               1usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std___is_floating_point_helper ) ));
}
#[test]
fn __bindgen_test_layout_std___is_floating_point_helper_instantiation_1194() {
    assert_eq!(::std::mem::size_of::<std___is_floating_point_helper>() ,
               1usize , concat ! (
               "Size of template specialization: " , stringify ! (
               std___is_floating_point_helper ) ));
    assert_eq!(::std::mem::align_of::<std___is_floating_point_helper>() ,
               1usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std___is_floating_point_helper ) ));
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_floating_point {
    pub _address: u8,
}
#[repr(C)]
pub struct std_is_array {
    pub _address: u8,
}
#[repr(C)]
pub struct std___is_pointer_helper {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_pointer {
    pub _address: u8,
}
#[repr(C)]
pub struct std_is_lvalue_reference {
    pub _address: u8,
}
#[repr(C)]
pub struct std_is_rvalue_reference {
    pub _address: u8,
}
#[repr(C)]
pub struct std_is_function {
    pub _address: u8,
}
#[repr(C)]
pub struct std___is_member_object_pointer_helper {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_member_object_pointer {
    pub _address: u8,
}
#[repr(C)]
pub struct std___is_member_function_pointer_helper {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_member_function_pointer {
    pub _address: u8,
}
#[repr(C)]
pub struct std_is_enum {
    pub _address: u8,
}
#[repr(C)]
pub struct std_is_union {
    pub _address: u8,
}
#[repr(C)]
pub struct std_is_class {
    pub _address: u8,
}
#[repr(C)]
pub struct std___is_null_pointer_helper {
    pub _address: u8,
}
#[test]
fn __bindgen_test_layout_std___is_null_pointer_helper_instantiation_1275() {
    assert_eq!(::std::mem::size_of::<std___is_null_pointer_helper>() , 1usize
               , concat ! (
               "Size of template specialization: " , stringify ! (
               std___is_null_pointer_helper ) ));
    assert_eq!(::std::mem::align_of::<std___is_null_pointer_helper>() , 1usize
               , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std___is_null_pointer_helper ) ));
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_null_pointer {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_nullptr_t {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_reference {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_arithmetic {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_fundamental {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_object {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_member_pointer {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_scalar {
    pub _address: u8,
}
#[repr(C)]
pub struct std_is_compound {
    pub _address: u8,
}
#[repr(C)]
pub struct std___is_member_pointer_helper {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_referenceable {
    pub _address: u8,
}
#[repr(C)]
pub struct std_is_const {
    pub _address: u8,
}
#[repr(C)]
pub struct std_is_volatile {
    pub _address: u8,
}
#[repr(C)]
pub struct std_is_trivial {
    pub _address: u8,
}
#[repr(C)]
pub struct std_is_standard_layout {
    pub _address: u8,
}
#[repr(C)]
pub struct std_is_pod {
    pub _address: u8,
}
#[repr(C)]
pub struct std_is_literal_type {
    pub _address: u8,
}
#[repr(C)]
pub struct std_is_empty {
    pub _address: u8,
}
#[repr(C)]
pub struct std_is_polymorphic {
    pub _address: u8,
}
#[repr(C)]
pub struct std_is_abstract {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_signed {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_unsigned {
    pub _address: u8,
}
#[repr(C)]
pub struct std_add_rvalue_reference {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_remove_all_extents {
    pub _address: u8,
}
pub type std_remove_all_extents_type<_Tp> = _Tp;
#[repr(C)]
pub struct std___is_array_known_bounds {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_array_unknown_bounds {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct std___do_is_destructible_impl {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std___do_is_destructible_impl() {
    assert_eq!(::std::mem::size_of::<std___do_is_destructible_impl>() , 1usize
               , concat ! (
               "Size of: " , stringify ! ( std___do_is_destructible_impl ) ));
    assert_eq! (::std::mem::align_of::<std___do_is_destructible_impl>() ,
                1usize , concat ! (
                "Alignment of " , stringify ! ( std___do_is_destructible_impl
                ) ));
}
impl Clone for std___do_is_destructible_impl {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_destructible_impl {
    pub _address: u8,
}
pub type std___is_destructible_impl_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_destructible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct std___do_is_nt_destructible_impl {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std___do_is_nt_destructible_impl() {
    assert_eq!(::std::mem::size_of::<std___do_is_nt_destructible_impl>() ,
               1usize , concat ! (
               "Size of: " , stringify ! ( std___do_is_nt_destructible_impl )
               ));
    assert_eq! (::std::mem::align_of::<std___do_is_nt_destructible_impl>() ,
                1usize , concat ! (
                "Alignment of " , stringify ! (
                std___do_is_nt_destructible_impl ) ));
}
impl Clone for std___do_is_nt_destructible_impl {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_nt_destructible_impl {
    pub _address: u8,
}
pub type std___is_nt_destructible_impl_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_nothrow_destructible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct std___do_is_default_constructible_impl {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std___do_is_default_constructible_impl() {
    assert_eq!(::std::mem::size_of::<std___do_is_default_constructible_impl>()
               , 1usize , concat ! (
               "Size of: " , stringify ! (
               std___do_is_default_constructible_impl ) ));
    assert_eq! (::std::mem::align_of::<std___do_is_default_constructible_impl>()
                , 1usize , concat ! (
                "Alignment of " , stringify ! (
                std___do_is_default_constructible_impl ) ));
}
impl Clone for std___do_is_default_constructible_impl {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_default_constructible_impl {
    pub _address: u8,
}
pub type std___is_default_constructible_impl_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_default_constructible_atom {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_default_constructible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct std___do_is_static_castable_impl {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std___do_is_static_castable_impl() {
    assert_eq!(::std::mem::size_of::<std___do_is_static_castable_impl>() ,
               1usize , concat ! (
               "Size of: " , stringify ! ( std___do_is_static_castable_impl )
               ));
    assert_eq! (::std::mem::align_of::<std___do_is_static_castable_impl>() ,
                1usize , concat ! (
                "Alignment of " , stringify ! (
                std___do_is_static_castable_impl ) ));
}
impl Clone for std___do_is_static_castable_impl {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_static_castable_impl {
    pub _address: u8,
}
pub type std___is_static_castable_impl_type<_From> = _From;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_static_castable_safe {
    pub _address: u8,
}
#[repr(C)]
pub struct std___is_static_castable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct std___do_is_direct_constructible_impl {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std___do_is_direct_constructible_impl() {
    assert_eq!(::std::mem::size_of::<std___do_is_direct_constructible_impl>()
               , 1usize , concat ! (
               "Size of: " , stringify ! (
               std___do_is_direct_constructible_impl ) ));
    assert_eq! (::std::mem::align_of::<std___do_is_direct_constructible_impl>()
                , 1usize , concat ! (
                "Alignment of " , stringify ! (
                std___do_is_direct_constructible_impl ) ));
}
impl Clone for std___do_is_direct_constructible_impl {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_direct_constructible_impl {
    pub _address: u8,
}
pub type std___is_direct_constructible_impl_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_direct_constructible_new_safe {
    pub _address: u8,
}
#[repr(C)]
pub struct std_is_same {
    pub _address: u8,
}
#[repr(C)]
pub struct std_is_base_of {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_remove_reference {
    pub _address: u8,
}
pub type std_remove_reference_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_direct_constructible_ref_cast {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_direct_constructible_new {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_direct_constructible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct std___do_is_nary_constructible_impl {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std___do_is_nary_constructible_impl() {
    assert_eq!(::std::mem::size_of::<std___do_is_nary_constructible_impl>() ,
               1usize , concat ! (
               "Size of: " , stringify ! ( std___do_is_nary_constructible_impl
               ) ));
    assert_eq! (::std::mem::align_of::<std___do_is_nary_constructible_impl>()
                , 1usize , concat ! (
                "Alignment of " , stringify ! (
                std___do_is_nary_constructible_impl ) ));
}
impl Clone for std___do_is_nary_constructible_impl {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_nary_constructible_impl {
    pub _address: u8,
}
pub type std___is_nary_constructible_impl_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_nary_constructible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_constructible_impl {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_constructible {
    pub _address: u8,
}
#[repr(C)]
pub struct std_is_copy_constructible {
    pub _address: u8,
}
#[repr(C)]
pub struct std_is_move_constructible {
    pub _address: u8,
}
#[repr(C)]
pub struct std___is_nt_default_constructible_atom {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_nothrow_default_constructible {
    pub _address: u8,
}
#[repr(C)]
pub struct std___is_nt_constructible_impl {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_nothrow_constructible {
    pub _address: u8,
}
#[repr(C)]
pub struct std_is_nothrow_copy_constructible {
    pub _address: u8,
}
#[repr(C)]
pub struct std_is_nothrow_move_constructible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_assignable_helper {
    pub _address: u8,
}
pub type std___is_assignable_helper_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_assignable {
    pub _address: u8,
}
#[repr(C)]
pub struct std_is_copy_assignable {
    pub _address: u8,
}
#[repr(C)]
pub struct std_is_move_assignable {
    pub _address: u8,
}
#[repr(C)]
pub struct std___is_nt_assignable_impl {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_nothrow_assignable {
    pub _address: u8,
}
#[repr(C)]
pub struct std_is_nothrow_copy_assignable {
    pub _address: u8,
}
#[repr(C)]
pub struct std_is_nothrow_move_assignable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_trivially_destructible {
    pub _address: u8,
}
#[repr(C)]
pub struct std_has_trivial_default_constructor {
    pub _address: u8,
}
#[repr(C)]
pub struct std_has_trivial_copy_constructor {
    pub _address: u8,
}
#[repr(C)]
pub struct std_has_trivial_copy_assign {
    pub _address: u8,
}
#[repr(C)]
pub struct std_has_virtual_destructor {
    pub _address: u8,
}
#[repr(C)]
pub struct std_alignment_of {
    pub _address: u8,
}
#[repr(C)]
pub struct std_rank {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_convertible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_remove_const {
    pub _address: u8,
}
pub type std_remove_const_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_remove_volatile {
    pub _address: u8,
}
pub type std_remove_volatile_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_add_const {
    pub _address: u8,
}
pub type std_add_const_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_add_volatile {
    pub _address: u8,
}
pub type std_add_volatile_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_add_cv {
    pub _address: u8,
}
pub type std_add_cv_type = std_add_const;
#[repr(C)]
pub struct std_add_lvalue_reference {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___make_unsigned {
    pub _address: u8,
}
pub type std___make_unsigned___type<_Tp> = _Tp;
#[test]
fn __bindgen_test_layout_std___make_unsigned_instantiation_1701() {
    assert_eq!(::std::mem::size_of::<std___make_unsigned>() , 1usize , concat
               ! (
               "Size of template specialization: " , stringify ! (
               std___make_unsigned ) ));
    assert_eq!(::std::mem::align_of::<std___make_unsigned>() , 1usize , concat
               ! (
               "Alignment of template specialization: " , stringify ! (
               std___make_unsigned ) ));
}
#[test]
fn __bindgen_test_layout_std___make_unsigned_instantiation_1705() {
    assert_eq!(::std::mem::size_of::<std___make_unsigned>() , 1usize , concat
               ! (
               "Size of template specialization: " , stringify ! (
               std___make_unsigned ) ));
    assert_eq!(::std::mem::align_of::<std___make_unsigned>() , 1usize , concat
               ! (
               "Alignment of template specialization: " , stringify ! (
               std___make_unsigned ) ));
}
#[test]
fn __bindgen_test_layout_std___make_unsigned_instantiation_1709() {
    assert_eq!(::std::mem::size_of::<std___make_unsigned>() , 1usize , concat
               ! (
               "Size of template specialization: " , stringify ! (
               std___make_unsigned ) ));
    assert_eq!(::std::mem::align_of::<std___make_unsigned>() , 1usize , concat
               ! (
               "Alignment of template specialization: " , stringify ! (
               std___make_unsigned ) ));
}
#[test]
fn __bindgen_test_layout_std___make_unsigned_instantiation_1713() {
    assert_eq!(::std::mem::size_of::<std___make_unsigned>() , 1usize , concat
               ! (
               "Size of template specialization: " , stringify ! (
               std___make_unsigned ) ));
    assert_eq!(::std::mem::align_of::<std___make_unsigned>() , 1usize , concat
               ! (
               "Alignment of template specialization: " , stringify ! (
               std___make_unsigned ) ));
}
#[test]
fn __bindgen_test_layout_std___make_unsigned_instantiation_1717() {
    assert_eq!(::std::mem::size_of::<std___make_unsigned>() , 1usize , concat
               ! (
               "Size of template specialization: " , stringify ! (
               std___make_unsigned ) ));
    assert_eq!(::std::mem::align_of::<std___make_unsigned>() , 1usize , concat
               ! (
               "Alignment of template specialization: " , stringify ! (
               std___make_unsigned ) ));
}
#[test]
fn __bindgen_test_layout_std___make_unsigned_instantiation_1721() {
    assert_eq!(::std::mem::size_of::<std___make_unsigned>() , 1usize , concat
               ! (
               "Size of template specialization: " , stringify ! (
               std___make_unsigned ) ));
    assert_eq!(::std::mem::align_of::<std___make_unsigned>() , 1usize , concat
               ! (
               "Alignment of template specialization: " , stringify ! (
               std___make_unsigned ) ));
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_make_unsigned {
    pub _address: u8,
}
pub type std_make_unsigned_type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___make_signed {
    pub _address: u8,
}
pub type std___make_signed___type<_Tp> = _Tp;
#[test]
fn __bindgen_test_layout_std___make_signed_instantiation_1741() {
    assert_eq!(::std::mem::size_of::<std___make_signed>() , 1usize , concat !
               (
               "Size of template specialization: " , stringify ! (
               std___make_signed ) ));
    assert_eq!(::std::mem::align_of::<std___make_signed>() , 1usize , concat !
               (
               "Alignment of template specialization: " , stringify ! (
               std___make_signed ) ));
}
#[test]
fn __bindgen_test_layout_std___make_signed_instantiation_1745() {
    assert_eq!(::std::mem::size_of::<std___make_signed>() , 1usize , concat !
               (
               "Size of template specialization: " , stringify ! (
               std___make_signed ) ));
    assert_eq!(::std::mem::align_of::<std___make_signed>() , 1usize , concat !
               (
               "Alignment of template specialization: " , stringify ! (
               std___make_signed ) ));
}
#[test]
fn __bindgen_test_layout_std___make_signed_instantiation_1749() {
    assert_eq!(::std::mem::size_of::<std___make_signed>() , 1usize , concat !
               (
               "Size of template specialization: " , stringify ! (
               std___make_signed ) ));
    assert_eq!(::std::mem::align_of::<std___make_signed>() , 1usize , concat !
               (
               "Alignment of template specialization: " , stringify ! (
               std___make_signed ) ));
}
#[test]
fn __bindgen_test_layout_std___make_signed_instantiation_1753() {
    assert_eq!(::std::mem::size_of::<std___make_signed>() , 1usize , concat !
               (
               "Size of template specialization: " , stringify ! (
               std___make_signed ) ));
    assert_eq!(::std::mem::align_of::<std___make_signed>() , 1usize , concat !
               (
               "Alignment of template specialization: " , stringify ! (
               std___make_signed ) ));
}
#[test]
fn __bindgen_test_layout_std___make_signed_instantiation_1757() {
    assert_eq!(::std::mem::size_of::<std___make_signed>() , 1usize , concat !
               (
               "Size of template specialization: " , stringify ! (
               std___make_signed ) ));
    assert_eq!(::std::mem::align_of::<std___make_signed>() , 1usize , concat !
               (
               "Alignment of template specialization: " , stringify ! (
               std___make_signed ) ));
}
#[test]
fn __bindgen_test_layout_std___make_signed_instantiation_1761() {
    assert_eq!(::std::mem::size_of::<std___make_signed>() , 1usize , concat !
               (
               "Size of template specialization: " , stringify ! (
               std___make_signed ) ));
    assert_eq!(::std::mem::align_of::<std___make_signed>() , 1usize , concat !
               (
               "Alignment of template specialization: " , stringify ! (
               std___make_signed ) ));
}
#[test]
fn __bindgen_test_layout_std___make_signed_instantiation_1765() {
    assert_eq!(::std::mem::size_of::<std___make_signed>() , 1usize , concat !
               (
               "Size of template specialization: " , stringify ! (
               std___make_signed ) ));
    assert_eq!(::std::mem::align_of::<std___make_signed>() , 1usize , concat !
               (
               "Alignment of template specialization: " , stringify ! (
               std___make_signed ) ));
}
#[test]
fn __bindgen_test_layout_std___make_signed_instantiation_1769() {
    assert_eq!(::std::mem::size_of::<std___make_signed>() , 1usize , concat !
               (
               "Size of template specialization: " , stringify ! (
               std___make_signed ) ));
    assert_eq!(::std::mem::align_of::<std___make_signed>() , 1usize , concat !
               (
               "Alignment of template specialization: " , stringify ! (
               std___make_signed ) ));
}
#[test]
fn __bindgen_test_layout_std___make_signed_instantiation_1773() {
    assert_eq!(::std::mem::size_of::<std___make_signed>() , 1usize , concat !
               (
               "Size of template specialization: " , stringify ! (
               std___make_signed ) ));
    assert_eq!(::std::mem::align_of::<std___make_signed>() , 1usize , concat !
               (
               "Alignment of template specialization: " , stringify ! (
               std___make_signed ) ));
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_make_signed {
    pub _address: u8,
}
pub type std_make_signed_type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_remove_extent {
    pub _address: u8,
}
pub type std_remove_extent_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___remove_pointer_helper {
    pub _address: u8,
}
pub type std___remove_pointer_helper_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_remove_pointer {
    pub _address: u8,
}
#[repr(C)]
pub struct std_add_pointer {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_decay {
    pub _address: u8,
}
pub type std_decay___remove_type = std_remove_reference;
pub type std_decay_type = u8;
#[repr(C)]
pub struct std_reference_wrapper<_Tp> {
    pub _M_data: *mut _Tp,
}
pub type std_reference_wrapper_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___strip_reference_wrapper {
    pub _address: u8,
}
pub type std___strip_reference_wrapper___type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___decay_and_strip {
    pub _address: u8,
}
pub type std___decay_and_strip___type = std___strip_reference_wrapper;
pub type std__Require = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_common_type {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct std___do_common_type_impl {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std___do_common_type_impl() {
    assert_eq!(::std::mem::size_of::<std___do_common_type_impl>() , 1usize ,
               concat ! (
               "Size of: " , stringify ! ( std___do_common_type_impl ) ));
    assert_eq! (::std::mem::align_of::<std___do_common_type_impl>() , 1usize ,
                concat ! (
                "Alignment of " , stringify ! ( std___do_common_type_impl )
                ));
}
impl Clone for std___do_common_type_impl {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___common_type_impl {
    pub _address: u8,
}
pub type std___common_type_impl_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct std___do_member_type_wrapper {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std___do_member_type_wrapper() {
    assert_eq!(::std::mem::size_of::<std___do_member_type_wrapper>() , 1usize
               , concat ! (
               "Size of: " , stringify ! ( std___do_member_type_wrapper ) ));
    assert_eq! (::std::mem::align_of::<std___do_member_type_wrapper>() ,
                1usize , concat ! (
                "Alignment of " , stringify ! ( std___do_member_type_wrapper )
                ));
}
impl Clone for std___do_member_type_wrapper {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___member_type_wrapper {
    pub _address: u8,
}
pub type std___member_type_wrapper_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___expanded_common_type_wrapper {
    pub _address: u8,
}
pub type std___expanded_common_type_wrapper_type = std_common_type;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_underlying_type {
    pub _address: u8,
}
pub type std_underlying_type_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___declval_protector {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_result_of {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct std___result_of_memfun_ref_impl {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std___result_of_memfun_ref_impl() {
    assert_eq!(::std::mem::size_of::<std___result_of_memfun_ref_impl>() ,
               1usize , concat ! (
               "Size of: " , stringify ! ( std___result_of_memfun_ref_impl )
               ));
    assert_eq! (::std::mem::align_of::<std___result_of_memfun_ref_impl>() ,
                1usize , concat ! (
                "Alignment of " , stringify ! (
                std___result_of_memfun_ref_impl ) ));
}
impl Clone for std___result_of_memfun_ref_impl {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___result_of_memfun_ref {
    pub _address: u8,
}
pub type std___result_of_memfun_ref_type<_MemPtr> = _MemPtr;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct std___result_of_memfun_deref_impl {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std___result_of_memfun_deref_impl() {
    assert_eq!(::std::mem::size_of::<std___result_of_memfun_deref_impl>() ,
               1usize , concat ! (
               "Size of: " , stringify ! ( std___result_of_memfun_deref_impl )
               ));
    assert_eq! (::std::mem::align_of::<std___result_of_memfun_deref_impl>() ,
                1usize , concat ! (
                "Alignment of " , stringify ! (
                std___result_of_memfun_deref_impl ) ));
}
impl Clone for std___result_of_memfun_deref_impl {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___result_of_memfun_deref {
    pub _address: u8,
}
pub type std___result_of_memfun_deref_type<_MemPtr> = _MemPtr;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct std___result_of_memobj_ref_impl {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std___result_of_memobj_ref_impl() {
    assert_eq!(::std::mem::size_of::<std___result_of_memobj_ref_impl>() ,
               1usize , concat ! (
               "Size of: " , stringify ! ( std___result_of_memobj_ref_impl )
               ));
    assert_eq! (::std::mem::align_of::<std___result_of_memobj_ref_impl>() ,
                1usize , concat ! (
                "Alignment of " , stringify ! (
                std___result_of_memobj_ref_impl ) ));
}
impl Clone for std___result_of_memobj_ref_impl {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___result_of_memobj_ref {
    pub _address: u8,
}
pub type std___result_of_memobj_ref_type<_MemPtr> = _MemPtr;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct std___result_of_memobj_deref_impl {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std___result_of_memobj_deref_impl() {
    assert_eq!(::std::mem::size_of::<std___result_of_memobj_deref_impl>() ,
               1usize , concat ! (
               "Size of: " , stringify ! ( std___result_of_memobj_deref_impl )
               ));
    assert_eq! (::std::mem::align_of::<std___result_of_memobj_deref_impl>() ,
                1usize , concat ! (
                "Alignment of " , stringify ! (
                std___result_of_memobj_deref_impl ) ));
}
impl Clone for std___result_of_memobj_deref_impl {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___result_of_memobj_deref {
    pub _address: u8,
}
pub type std___result_of_memobj_deref_type<_MemPtr> = _MemPtr;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___result_of_memobj {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___result_of_memfun {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct std___result_of_other_impl {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std___result_of_other_impl() {
    assert_eq!(::std::mem::size_of::<std___result_of_other_impl>() , 1usize ,
               concat ! (
               "Size of: " , stringify ! ( std___result_of_other_impl ) ));
    assert_eq! (::std::mem::align_of::<std___result_of_other_impl>() , 1usize
                , concat ! (
                "Alignment of " , stringify ! ( std___result_of_other_impl )
                ));
}
impl Clone for std___result_of_other_impl {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___move_if_noexcept_cond {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct std_piecewise_construct_t {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std_piecewise_construct_t() {
    assert_eq!(::std::mem::size_of::<std_piecewise_construct_t>() , 1usize ,
               concat ! (
               "Size of: " , stringify ! ( std_piecewise_construct_t ) ));
    assert_eq! (::std::mem::align_of::<std_piecewise_construct_t>() , 1usize ,
                concat ! (
                "Alignment of " , stringify ! ( std_piecewise_construct_t )
                ));
}
impl Clone for std_piecewise_construct_t {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    #[link_name = "?piecewise_construct@std@@3Upiecewise_construct_t@1@B"]
    pub static std_piecewise_construct: std_piecewise_construct_t;
}
#[repr(C)]
pub struct std_tuple {
    pub _address: u8,
}
pub type std_tuple__Inherited = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_pair<_T1, _T2> {
    pub first: _T1,
    pub second: _T2,
}
pub type std_pair_first_type<_T1> = _T1;
pub type std_pair_second_type<_T2> = _T2;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct std_input_iterator_tag {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std_input_iterator_tag() {
    assert_eq!(::std::mem::size_of::<std_input_iterator_tag>() , 1usize ,
               concat ! ( "Size of: " , stringify ! ( std_input_iterator_tag )
               ));
    assert_eq! (::std::mem::align_of::<std_input_iterator_tag>() , 1usize ,
                concat ! (
                "Alignment of " , stringify ! ( std_input_iterator_tag ) ));
}
impl Clone for std_input_iterator_tag {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct std_output_iterator_tag {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std_output_iterator_tag() {
    assert_eq!(::std::mem::size_of::<std_output_iterator_tag>() , 1usize ,
               concat ! (
               "Size of: " , stringify ! ( std_output_iterator_tag ) ));
    assert_eq! (::std::mem::align_of::<std_output_iterator_tag>() , 1usize ,
                concat ! (
                "Alignment of " , stringify ! ( std_output_iterator_tag ) ));
}
impl Clone for std_output_iterator_tag {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct std_forward_iterator_tag {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std_forward_iterator_tag() {
    assert_eq!(::std::mem::size_of::<std_forward_iterator_tag>() , 1usize ,
               concat ! (
               "Size of: " , stringify ! ( std_forward_iterator_tag ) ));
    assert_eq! (::std::mem::align_of::<std_forward_iterator_tag>() , 1usize ,
                concat ! (
                "Alignment of " , stringify ! ( std_forward_iterator_tag ) ));
}
impl Clone for std_forward_iterator_tag {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct std_bidirectional_iterator_tag {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std_bidirectional_iterator_tag() {
    assert_eq!(::std::mem::size_of::<std_bidirectional_iterator_tag>() ,
               1usize , concat ! (
               "Size of: " , stringify ! ( std_bidirectional_iterator_tag )
               ));
    assert_eq! (::std::mem::align_of::<std_bidirectional_iterator_tag>() ,
                1usize , concat ! (
                "Alignment of " , stringify ! ( std_bidirectional_iterator_tag
                ) ));
}
impl Clone for std_bidirectional_iterator_tag {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct std_random_access_iterator_tag {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std_random_access_iterator_tag() {
    assert_eq!(::std::mem::size_of::<std_random_access_iterator_tag>() ,
               1usize , concat ! (
               "Size of: " , stringify ! ( std_random_access_iterator_tag )
               ));
    assert_eq! (::std::mem::align_of::<std_random_access_iterator_tag>() ,
                1usize , concat ! (
                "Alignment of " , stringify ! ( std_random_access_iterator_tag
                ) ));
}
impl Clone for std_random_access_iterator_tag {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_iterator {
    pub _address: u8,
}
pub type std_iterator_iterator_category<_Category> = _Category;
pub type std_iterator_value_type<_Tp> = _Tp;
pub type std_iterator_difference_type<_Distance> = _Distance;
pub type std_iterator_pointer<_Pointer> = _Pointer;
pub type std_iterator_reference<_Reference> = _Reference;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_iterator_category_helper {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_iterator_category_helper__Wrap_type {
    pub _address: u8,
}
pub type std___has_iterator_category_helper_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_iterator_category {
    pub _address: u8,
}
#[repr(C)]
pub struct std_iterator_traits {
    pub _address: u8,
}
pub type std__RequireInputIter = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_element_type_helper {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_element_type_helper__Wrap_type {
    pub _address: u8,
}
pub type std___has_element_type_helper_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_element_type {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_difference_type_helper {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_difference_type_helper__Wrap_type {
    pub _address: u8,
}
pub type std___has_difference_type_helper_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_difference_type {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___ptrtr_rebind_helper {
    pub _address: u8,
}
pub type std___ptrtr_rebind_helper___type<_Ptr> = _Ptr;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___ptrtr_not_void {
    pub _address: u8,
}
pub type std___ptrtr_not_void___type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___ptrtr_pointer_to {
    pub _address: u8,
}
pub type std___ptrtr_pointer_to___orig_type = u8;
pub type std___ptrtr_pointer_to___element_type = std___ptrtr_not_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_pointer_traits {
    pub _address: u8,
}
pub type std_pointer_traits_pointer<_Ptr> = _Ptr;
pub type std_pointer_traits_element_type = u8;
pub type std_pointer_traits_difference_type = u8;
pub type std_pointer_traits_rebind = u8;
#[repr(C)]
pub struct std_reverse_iterator<_Iterator> {
    pub current: _Iterator,
}
pub type std_reverse_iterator___traits_type = std_iterator_traits;
pub type std_reverse_iterator_iterator_type<_Iterator> = _Iterator;
pub type std_reverse_iterator_difference_type =
    std_reverse_iterator___traits_type;
pub type std_reverse_iterator_pointer = std_reverse_iterator___traits_type;
pub type std_reverse_iterator_reference = std_reverse_iterator___traits_type;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_back_insert_iterator<_Container> {
    pub container: *mut _Container,
}
pub type std_back_insert_iterator_container_type<_Container> = _Container;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_front_insert_iterator<_Container> {
    pub container: *mut _Container,
}
pub type std_front_insert_iterator_container_type<_Container> = _Container;
#[repr(C)]
pub struct std_insert_iterator<_Container> {
    pub container: *mut _Container,
    pub iter: [u8; 0usize],
}
pub type std_insert_iterator_container_type<_Container> = _Container;
#[repr(C)]
pub struct std__Niter_base {
    pub _address: u8,
}
#[repr(C)]
pub struct std__Miter_base {
    pub _address: u8,
}
#[test]
fn __bindgen_test_layout_std___copy_move_instantiation_2312() {
    assert_eq!(::std::mem::size_of::<u8>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! ( u8 ) ));
    assert_eq!(::std::mem::align_of::<u8>() , 1usize , concat ! (
               "Alignment of template specialization: " , stringify ! ( u8 )
               ));
}
#[test]
fn __bindgen_test_layout_std___copy_move_instantiation_2315() {
    assert_eq!(::std::mem::size_of::<u8>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! ( u8 ) ));
    assert_eq!(::std::mem::align_of::<u8>() , 1usize , concat ! (
               "Alignment of template specialization: " , stringify ! ( u8 )
               ));
}
#[repr(C)]
pub struct std_istreambuf_iterator<_CharT> {
    pub _M_sbuf: *mut std_istreambuf_iterator_streambuf_type<_CharT>,
    pub _M_c: std_istreambuf_iterator_int_type,
}
pub type std_istreambuf_iterator_char_type<_CharT> = _CharT;
pub type std_istreambuf_iterator_traits_type<_Traits> = _Traits;
pub type std_istreambuf_iterator_int_type = [u8; 0usize];
pub type std_istreambuf_iterator_streambuf_type<_CharT> =
    std_basic_streambuf<_CharT>;
pub type std_istreambuf_iterator_istream_type<_CharT> =
    std_basic_istream<_CharT>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_ostreambuf_iterator<_CharT> {
    pub _M_sbuf: *mut std_ostreambuf_iterator_streambuf_type<_CharT>,
    pub _M_failed: bool,
}
pub type std_ostreambuf_iterator_char_type<_CharT> = _CharT;
pub type std_ostreambuf_iterator_traits_type<_Traits> = _Traits;
pub type std_ostreambuf_iterator_streambuf_type<_CharT> =
    std_basic_streambuf<_CharT>;
pub type std_ostreambuf_iterator_ostream_type<_CharT> =
    std_basic_ostream<_CharT>;
#[test]
fn __bindgen_test_layout_std___copy_move_backward_instantiation_2366() {
    assert_eq!(::std::mem::size_of::<u8>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! ( u8 ) ));
    assert_eq!(::std::mem::align_of::<u8>() , 1usize , concat ! (
               "Alignment of template specialization: " , stringify ! ( u8 )
               ));
}
#[test]
fn __bindgen_test_layout_std___copy_move_backward_instantiation_2369() {
    assert_eq!(::std::mem::size_of::<u8>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! ( u8 ) ));
    assert_eq!(::std::mem::align_of::<u8>() , 1usize , concat ! (
               "Alignment of template specialization: " , stringify ! ( u8 )
               ));
}
#[test]
fn __bindgen_test_layout_std___equal_instantiation_2386() {
    assert_eq!(::std::mem::size_of::<u8>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! ( u8 ) ));
    assert_eq!(::std::mem::align_of::<u8>() , 1usize , concat ! (
               "Alignment of template specialization: " , stringify ! ( u8 )
               ));
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___lc_rai {
    pub _address: u8,
}
#[test]
fn __bindgen_test_layout_std___lc_rai_instantiation_2392() {
    assert_eq!(::std::mem::size_of::<std___lc_rai>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! (
               std___lc_rai ) ));
    assert_eq!(::std::mem::align_of::<std___lc_rai>() , 1usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std___lc_rai ) ));
}
#[test]
fn __bindgen_test_layout_std___lexicographical_compare_instantiation_2399() {
    assert_eq!(::std::mem::size_of::<u8>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! ( u8 ) ));
    assert_eq!(::std::mem::align_of::<u8>() , 1usize , concat ! (
               "Alignment of template specialization: " , stringify ! ( u8 )
               ));
}
pub type std_streamoff = ::std::os::raw::c_longlong;
pub type std_streamsize = isize;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_fpos<_StateT> {
    pub _M_off: std_streamoff,
    pub _M_state: _StateT,
}
pub type std_streampos = std_fpos<::std::os::raw::c_int>;
pub type std_wstreampos = std_fpos<::std::os::raw::c_int>;
pub type std_u16streampos = std_fpos<::std::os::raw::c_int>;
pub type std_u32streampos = std_fpos<::std::os::raw::c_int>;
#[repr(C)]
pub struct std_exception__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct std_exception {
    pub vtable_: *const std_exception__bindgen_vtable,
}
#[test]
fn bindgen_test_layout_std_exception() {
    assert_eq!(::std::mem::size_of::<std_exception>() , 8usize , concat ! (
               "Size of: " , stringify ! ( std_exception ) ));
    assert_eq! (::std::mem::align_of::<std_exception>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( std_exception ) ));
}
#[repr(C)]
#[derive(Debug)]
pub struct std_bad_exception {
    pub _base: std_exception,
}
#[test]
fn bindgen_test_layout_std_bad_exception() {
    assert_eq!(::std::mem::size_of::<std_bad_exception>() , 8usize , concat !
               ( "Size of: " , stringify ! ( std_bad_exception ) ));
    assert_eq! (::std::mem::align_of::<std_bad_exception>() , 8usize , concat
                ! ( "Alignment of " , stringify ! ( std_bad_exception ) ));
}
pub type std_terminate_handler =
    ::std::option::Option<unsafe extern "C" fn()>;
pub type std_unexpected_handler =
    ::std::option::Option<unsafe extern "C" fn()>;
extern "C" {
    #[link_name = "?set_terminate@std@@YAP6AXXZP6AXXZ@Z"]
    pub fn std_set_terminate(arg1: std_terminate_handler)
     -> std_terminate_handler;
}
extern "C" {
    #[link_name = "?get_terminate@std@@YAP6AXXZXZ"]
    pub fn std_get_terminate() -> std_terminate_handler;
}
extern "C" {
    #[link_name = "?terminate@std@@YAXXZ"]
    pub fn std_terminate();
}
extern "C" {
    #[link_name = "?set_unexpected@std@@YAP6AXXZP6AXXZ@Z"]
    pub fn std_set_unexpected(arg1: std_unexpected_handler)
     -> std_unexpected_handler;
}
extern "C" {
    #[link_name = "?get_unexpected@std@@YAP6AXXZXZ"]
    pub fn std_get_unexpected() -> std_unexpected_handler;
}
extern "C" {
    #[link_name = "?unexpected@std@@YAXXZ"]
    pub fn std_unexpected();
}
extern "C" {
    #[link_name = "?uncaught_exception@std@@YA_NXZ"]
    pub fn std_uncaught_exception() -> bool;
}
#[repr(C)]
pub struct std_type_info__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct std_type_info {
    pub vtable_: *const std_type_info__bindgen_vtable,
    pub __name: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_std_type_info() {
    assert_eq!(::std::mem::size_of::<std_type_info>() , 16usize , concat ! (
               "Size of: " , stringify ! ( std_type_info ) ));
    assert_eq! (::std::mem::align_of::<std_type_info>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( std_type_info ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const std_type_info ) ) . __name as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( std_type_info ) , "::"
                , stringify ! ( __name ) ));
}
extern "C" {
    #[link_name = "?before@type_info@std@@QEBA_NAEBV12@@Z"]
    pub fn std_type_info_before(this: *const std_type_info,
                                __arg: *const std_type_info) -> bool;
}
impl std_type_info {
    #[inline]
    pub unsafe fn before(&self, __arg: *const std_type_info) -> bool {
        std_type_info_before(self, __arg)
    }
}
#[repr(C)]
#[derive(Debug)]
pub struct std___exception_ptr_exception_ptr {
    pub _M_exception_object: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_std___exception_ptr_exception_ptr() {
    assert_eq!(::std::mem::size_of::<std___exception_ptr_exception_ptr>() ,
               8usize , concat ! (
               "Size of: " , stringify ! ( std___exception_ptr_exception_ptr )
               ));
    assert_eq! (::std::mem::align_of::<std___exception_ptr_exception_ptr>() ,
                8usize , concat ! (
                "Alignment of " , stringify ! (
                std___exception_ptr_exception_ptr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const std___exception_ptr_exception_ptr ) ) .
                _M_exception_object as * const _ as usize } , 0usize , concat
                ! (
                "Alignment of field: " , stringify ! (
                std___exception_ptr_exception_ptr ) , "::" , stringify ! (
                _M_exception_object ) ));
}
extern "C" {
    #[link_name = "?swap@exception_ptr@__exception_ptr@std@@QEAAXAEAV123@@Z"]
    pub fn std___exception_ptr_exception_ptr_swap(this:
                                                      *mut std___exception_ptr_exception_ptr,
                                                  arg1:
                                                      *mut std___exception_ptr_exception_ptr);
}
extern "C" {
    #[link_name =
          "?__cxa_exception_type@exception_ptr@__exception_ptr@std@@QEBAPEBVtype_info@3@XZ"]
    pub fn std___exception_ptr_exception_ptr___cxa_exception_type(this:
                                                                      *const std___exception_ptr_exception_ptr)
     -> *const std_type_info;
}
extern "C" {
    #[link_name = "??0exception_ptr@__exception_ptr@std@@QEAA@XZ"]
    pub fn std___exception_ptr_exception_ptr_exception_ptr(this:
                                                               *mut std___exception_ptr_exception_ptr);
}
extern "C" {
    #[link_name = "??0exception_ptr@__exception_ptr@std@@QEAA@AEBV012@@Z"]
    pub fn std___exception_ptr_exception_ptr_exception_ptr1(this:
                                                                *mut std___exception_ptr_exception_ptr,
                                                            arg1:
                                                                *const std___exception_ptr_exception_ptr);
}
extern "C" {
    #[link_name = "??_Dexception_ptr@__exception_ptr@std@@QEAA@XZ"]
    pub fn std___exception_ptr_exception_ptr_exception_ptr_destructor(this:
                                                                          *mut std___exception_ptr_exception_ptr);
}
impl std___exception_ptr_exception_ptr {
    #[inline]
    pub unsafe fn swap(&mut self,
                       arg1: *mut std___exception_ptr_exception_ptr) {
        std___exception_ptr_exception_ptr_swap(self, arg1)
    }
    #[inline]
    pub unsafe fn __cxa_exception_type(&self) -> *const std_type_info {
        std___exception_ptr_exception_ptr___cxa_exception_type(self)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::uninitialized();
        std___exception_ptr_exception_ptr_exception_ptr(&mut __bindgen_tmp);
        __bindgen_tmp
    }
    #[inline]
    pub unsafe fn new1(arg1: *const std___exception_ptr_exception_ptr)
     -> Self {
        let mut __bindgen_tmp = ::std::mem::uninitialized();
        std___exception_ptr_exception_ptr_exception_ptr1(&mut __bindgen_tmp,
                                                         arg1);
        __bindgen_tmp
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        std___exception_ptr_exception_ptr_exception_ptr_destructor(self)
    }
}
extern "C" {
    #[link_name =
          "?current_exception@std@@YA?AVexception_ptr@__exception_ptr@1@XZ"]
    pub fn std_current_exception() -> std___exception_ptr_exception_ptr;
}
extern "C" {
    #[link_name =
          "?rethrow_exception@std@@YAXVexception_ptr@__exception_ptr@1@@Z"]
    pub fn std_rethrow_exception(arg1: std___exception_ptr_exception_ptr);
}
#[repr(C)]
pub struct std_nested_exception__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct std_nested_exception {
    pub vtable_: *const std_nested_exception__bindgen_vtable,
    pub _M_ptr: std___exception_ptr_exception_ptr,
}
#[test]
fn bindgen_test_layout_std_nested_exception() {
    assert_eq!(::std::mem::size_of::<std_nested_exception>() , 16usize ,
               concat ! ( "Size of: " , stringify ! ( std_nested_exception )
               ));
    assert_eq! (::std::mem::align_of::<std_nested_exception>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( std_nested_exception ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const std_nested_exception ) ) . _M_ptr as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( std_nested_exception )
                , "::" , stringify ! ( _M_ptr ) ));
}
#[repr(C)]
#[derive(Debug)]
pub struct std__Nested_exception<_Except> {
    pub _base: _Except,
    pub _base_1: std_nested_exception,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___get_nested_helper {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug)]
pub struct std_bad_alloc {
    pub _base: std_exception,
}
#[test]
fn bindgen_test_layout_std_bad_alloc() {
    assert_eq!(::std::mem::size_of::<std_bad_alloc>() , 8usize , concat ! (
               "Size of: " , stringify ! ( std_bad_alloc ) ));
    assert_eq! (::std::mem::align_of::<std_bad_alloc>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( std_bad_alloc ) ));
}
#[repr(C)]
#[derive(Debug)]
pub struct std_bad_array_new_length {
    pub _base: std_bad_alloc,
}
#[test]
fn bindgen_test_layout_std_bad_array_new_length() {
    assert_eq!(::std::mem::size_of::<std_bad_array_new_length>() , 8usize ,
               concat ! (
               "Size of: " , stringify ! ( std_bad_array_new_length ) ));
    assert_eq! (::std::mem::align_of::<std_bad_array_new_length>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( std_bad_array_new_length ) ));
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct std_nothrow_t {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std_nothrow_t() {
    assert_eq!(::std::mem::size_of::<std_nothrow_t>() , 1usize , concat ! (
               "Size of: " , stringify ! ( std_nothrow_t ) ));
    assert_eq! (::std::mem::align_of::<std_nothrow_t>() , 1usize , concat ! (
                "Alignment of " , stringify ! ( std_nothrow_t ) ));
}
impl Clone for std_nothrow_t {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    #[link_name = "?nothrow@std@@3Unothrow_t@1@B"]
    pub static std_nothrow: std_nothrow_t;
}
pub type std_new_handler = ::std::option::Option<unsafe extern "C" fn()>;
extern "C" {
    #[link_name = "?set_new_handler@std@@YAP6AXXZP6AXXZ@Z"]
    pub fn std_set_new_handler(arg1: std_new_handler) -> std_new_handler;
}
extern "C" {
    #[link_name = "?get_new_handler@std@@YAP6AXXZXZ"]
    pub fn std_get_new_handler() -> std_new_handler;
}
pub type std___allocator_base = __gnu_cxx_new_allocator;
#[test]
fn __bindgen_test_layout_std_allocator_instantiation_5094() {
    assert_eq!(::std::mem::size_of::<std_allocator>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! (
               std_allocator ) ));
    assert_eq!(::std::mem::align_of::<std_allocator>() , 1usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std_allocator ) ));
}
#[test]
fn __bindgen_test_layout_std_allocator_instantiation_5098() {
    assert_eq!(::std::mem::size_of::<std_allocator>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! (
               std_allocator ) ));
    assert_eq!(::std::mem::align_of::<std_allocator>() , 1usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std_allocator ) ));
}
pub type std___c_locale = *mut ::std::os::raw::c_int;
pub type std__Atomic_word = ::std::os::raw::c_int;
#[repr(C)]
pub struct std_ios_base__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct std_ios_base {
    pub vtable_: *const std_ios_base__bindgen_vtable,
    pub _M_precision: std_streamsize,
    pub _M_width: std_streamsize,
    pub _M_flags: std_ios_base_fmtflags,
    pub _M_exception: std_ios_base_iostate,
    pub _M_streambuf_state: std_ios_base_iostate,
    pub _M_callbacks: *mut std_ios_base__Callback_list,
    pub _M_word_zero: std_ios_base__Words,
    pub _M_local_word: [std_ios_base__Words; 8usize],
    pub _M_word_size: ::std::os::raw::c_int,
    pub _M_word: *mut std_ios_base__Words,
    pub _M_ios_locale: std_locale,
}
#[repr(C)]
#[derive(Debug)]
pub struct std_ios_base_failure {
    pub _base: std_exception,
    pub _M_msg: std_string,
}
#[test]
fn bindgen_test_layout_std_ios_base_failure() {
    assert_eq!(::std::mem::size_of::<std_ios_base_failure>() , 16usize ,
               concat ! ( "Size of: " , stringify ! ( std_ios_base_failure )
               ));
    assert_eq! (::std::mem::align_of::<std_ios_base_failure>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( std_ios_base_failure ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const std_ios_base_failure ) ) . _M_msg as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( std_ios_base_failure )
                , "::" , stringify ! ( _M_msg ) ));
}
extern "C" {
    #[link_name =
          "??0failure@ios_base@std@@QEAA@AEBV?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@@2@@Z"]
    pub fn std_ios_base_failure_failure(this: *mut std_ios_base_failure,
                                        __str: *const std_string);
}
impl std_ios_base_failure {
    #[inline]
    pub unsafe fn new(__str: *const std_string) -> Self {
        let mut __bindgen_tmp = ::std::mem::uninitialized();
        std_ios_base_failure_failure(&mut __bindgen_tmp, __str);
        __bindgen_tmp
    }
}
pub use self::std__Ios_Fmtflags as std_ios_base_fmtflags;
pub use self::std__Ios_Iostate as std_ios_base_iostate;
pub use self::std__Ios_Openmode as std_ios_base_openmode;
pub use self::std__Ios_Seekdir as std_ios_base_seekdir;
pub type std_ios_base_io_state = ::std::os::raw::c_int;
pub type std_ios_base_open_mode = ::std::os::raw::c_int;
pub type std_ios_base_seek_dir = ::std::os::raw::c_int;
pub type std_ios_base_streampos = std_streampos;
pub type std_ios_base_streamoff = std_streamoff;
#[repr(i32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum std_ios_base_event {
    erase_event = 0,
    imbue_event = 1,
    copyfmt_event = 2,
}
pub type std_ios_base_event_callback =
    ::std::option::Option<unsafe extern "C" fn(__e: std_ios_base_event,
                                               __b: *mut std_ios_base,
                                               __i: ::std::os::raw::c_int)>;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct std_ios_base__Callback_list {
    pub _M_next: *mut std_ios_base__Callback_list,
    pub _M_fn: std_ios_base_event_callback,
    pub _M_index: ::std::os::raw::c_int,
    pub _M_refcount: std__Atomic_word,
}
#[test]
fn bindgen_test_layout_std_ios_base__Callback_list() {
    assert_eq!(::std::mem::size_of::<std_ios_base__Callback_list>() , 24usize
               , concat ! (
               "Size of: " , stringify ! ( std_ios_base__Callback_list ) ));
    assert_eq! (::std::mem::align_of::<std_ios_base__Callback_list>() , 8usize
                , concat ! (
                "Alignment of " , stringify ! ( std_ios_base__Callback_list )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const std_ios_base__Callback_list ) ) . _M_next
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                std_ios_base__Callback_list ) , "::" , stringify ! ( _M_next )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const std_ios_base__Callback_list ) ) . _M_fn
                as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                std_ios_base__Callback_list ) , "::" , stringify ! ( _M_fn )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const std_ios_base__Callback_list ) ) .
                _M_index as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! (
                std_ios_base__Callback_list ) , "::" , stringify ! ( _M_index
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const std_ios_base__Callback_list ) ) .
                _M_refcount as * const _ as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! (
                std_ios_base__Callback_list ) , "::" , stringify ! (
                _M_refcount ) ));
}
impl Clone for std_ios_base__Callback_list {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct std_ios_base__Words {
    pub _M_pword: *mut ::std::os::raw::c_void,
    pub _M_iword: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_std_ios_base__Words() {
    assert_eq!(::std::mem::size_of::<std_ios_base__Words>() , 16usize , concat
               ! ( "Size of: " , stringify ! ( std_ios_base__Words ) ));
    assert_eq! (::std::mem::align_of::<std_ios_base__Words>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( std_ios_base__Words ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const std_ios_base__Words ) ) . _M_pword as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( std_ios_base__Words ) ,
                "::" , stringify ! ( _M_pword ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const std_ios_base__Words ) ) . _M_iword as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( std_ios_base__Words ) ,
                "::" , stringify ! ( _M_iword ) ));
}
impl Clone for std_ios_base__Words {
    fn clone(&self) -> Self { *self }
}
pub const std_ios_base__S_local_word_size: std_ios_base__bindgen_ty_1 =
    std_ios_base__bindgen_ty_1::_S_local_word_size;
#[repr(i32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum std_ios_base__bindgen_ty_1 { _S_local_word_size = 8, }
#[repr(C)]
#[derive(Debug)]
pub struct std_ios_base_Init {
    pub _address: u8,
}
extern "C" {
    #[link_name = "?_S_refcount@Init@ios_base@std@@0HA"]
    pub static mut std_ios_base_Init__S_refcount: std__Atomic_word;
}
extern "C" {
    #[link_name = "?_S_synced_with_stdio@Init@ios_base@std@@0_NA"]
    pub static mut std_ios_base_Init__S_synced_with_stdio: bool;
}
#[test]
fn bindgen_test_layout_std_ios_base_Init() {
    assert_eq!(::std::mem::size_of::<std_ios_base_Init>() , 1usize , concat !
               ( "Size of: " , stringify ! ( std_ios_base_Init ) ));
    assert_eq! (::std::mem::align_of::<std_ios_base_Init>() , 1usize , concat
                ! ( "Alignment of " , stringify ! ( std_ios_base_Init ) ));
}
extern "C" {
    #[link_name = "??0Init@ios_base@std@@QEAA@XZ"]
    pub fn std_ios_base_Init_Init(this: *mut std_ios_base_Init);
}
extern "C" {
    #[link_name = "??_DInit@ios_base@std@@QEAA@XZ"]
    pub fn std_ios_base_Init_Init_destructor(this: *mut std_ios_base_Init);
}
impl std_ios_base_Init {
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::uninitialized();
        std_ios_base_Init_Init(&mut __bindgen_tmp);
        __bindgen_tmp
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        std_ios_base_Init_Init_destructor(self)
    }
}
extern "C" {
    #[link_name = "?boolalpha@ios_base@std@@2W4_Ios_Fmtflags@2@B"]
    pub static std_ios_base_boolalpha: std_ios_base_fmtflags;
}
extern "C" {
    #[link_name = "?dec@ios_base@std@@2W4_Ios_Fmtflags@2@B"]
    pub static std_ios_base_dec: std_ios_base_fmtflags;
}
extern "C" {
    #[link_name = "?fixed@ios_base@std@@2W4_Ios_Fmtflags@2@B"]
    pub static std_ios_base_fixed: std_ios_base_fmtflags;
}
extern "C" {
    #[link_name = "?hex@ios_base@std@@2W4_Ios_Fmtflags@2@B"]
    pub static std_ios_base_hex: std_ios_base_fmtflags;
}
extern "C" {
    #[link_name = "?internal@ios_base@std@@2W4_Ios_Fmtflags@2@B"]
    pub static std_ios_base_internal: std_ios_base_fmtflags;
}
extern "C" {
    #[link_name = "?left@ios_base@std@@2W4_Ios_Fmtflags@2@B"]
    pub static std_ios_base_left: std_ios_base_fmtflags;
}
extern "C" {
    #[link_name = "?oct@ios_base@std@@2W4_Ios_Fmtflags@2@B"]
    pub static std_ios_base_oct: std_ios_base_fmtflags;
}
extern "C" {
    #[link_name = "?right@ios_base@std@@2W4_Ios_Fmtflags@2@B"]
    pub static std_ios_base_right: std_ios_base_fmtflags;
}
extern "C" {
    #[link_name = "?scientific@ios_base@std@@2W4_Ios_Fmtflags@2@B"]
    pub static std_ios_base_scientific: std_ios_base_fmtflags;
}
extern "C" {
    #[link_name = "?showbase@ios_base@std@@2W4_Ios_Fmtflags@2@B"]
    pub static std_ios_base_showbase: std_ios_base_fmtflags;
}
extern "C" {
    #[link_name = "?showpoint@ios_base@std@@2W4_Ios_Fmtflags@2@B"]
    pub static std_ios_base_showpoint: std_ios_base_fmtflags;
}
extern "C" {
    #[link_name = "?showpos@ios_base@std@@2W4_Ios_Fmtflags@2@B"]
    pub static std_ios_base_showpos: std_ios_base_fmtflags;
}
extern "C" {
    #[link_name = "?skipws@ios_base@std@@2W4_Ios_Fmtflags@2@B"]
    pub static std_ios_base_skipws: std_ios_base_fmtflags;
}
extern "C" {
    #[link_name = "?unitbuf@ios_base@std@@2W4_Ios_Fmtflags@2@B"]
    pub static std_ios_base_unitbuf: std_ios_base_fmtflags;
}
extern "C" {
    #[link_name = "?uppercase@ios_base@std@@2W4_Ios_Fmtflags@2@B"]
    pub static std_ios_base_uppercase: std_ios_base_fmtflags;
}
extern "C" {
    #[link_name = "?adjustfield@ios_base@std@@2W4_Ios_Fmtflags@2@B"]
    pub static std_ios_base_adjustfield: std_ios_base_fmtflags;
}
extern "C" {
    #[link_name = "?basefield@ios_base@std@@2W4_Ios_Fmtflags@2@B"]
    pub static std_ios_base_basefield: std_ios_base_fmtflags;
}
extern "C" {
    #[link_name = "?floatfield@ios_base@std@@2W4_Ios_Fmtflags@2@B"]
    pub static std_ios_base_floatfield: std_ios_base_fmtflags;
}
extern "C" {
    #[link_name = "?badbit@ios_base@std@@2W4_Ios_Iostate@2@B"]
    pub static std_ios_base_badbit: std_ios_base_iostate;
}
extern "C" {
    #[link_name = "?eofbit@ios_base@std@@2W4_Ios_Iostate@2@B"]
    pub static std_ios_base_eofbit: std_ios_base_iostate;
}
extern "C" {
    #[link_name = "?failbit@ios_base@std@@2W4_Ios_Iostate@2@B"]
    pub static std_ios_base_failbit: std_ios_base_iostate;
}
extern "C" {
    #[link_name = "?goodbit@ios_base@std@@2W4_Ios_Iostate@2@B"]
    pub static std_ios_base_goodbit: std_ios_base_iostate;
}
extern "C" {
    #[link_name = "?app@ios_base@std@@2W4_Ios_Openmode@2@B"]
    pub static std_ios_base_app: std_ios_base_openmode;
}
extern "C" {
    #[link_name = "?ate@ios_base@std@@2W4_Ios_Openmode@2@B"]
    pub static std_ios_base_ate: std_ios_base_openmode;
}
extern "C" {
    #[link_name = "?binary@ios_base@std@@2W4_Ios_Openmode@2@B"]
    pub static std_ios_base_binary: std_ios_base_openmode;
}
extern "C" {
    #[link_name = "?in@ios_base@std@@2W4_Ios_Openmode@2@B"]
    pub static std_ios_base_in: std_ios_base_openmode;
}
extern "C" {
    #[link_name = "?out@ios_base@std@@2W4_Ios_Openmode@2@B"]
    pub static std_ios_base_out: std_ios_base_openmode;
}
extern "C" {
    #[link_name = "?trunc@ios_base@std@@2W4_Ios_Openmode@2@B"]
    pub static std_ios_base_trunc: std_ios_base_openmode;
}
extern "C" {
    #[link_name = "?beg@ios_base@std@@2W4_Ios_Seekdir@2@B"]
    pub static std_ios_base_beg: std_ios_base_seekdir;
}
extern "C" {
    #[link_name = "?cur@ios_base@std@@2W4_Ios_Seekdir@2@B"]
    pub static std_ios_base_cur: std_ios_base_seekdir;
}
extern "C" {
    #[link_name = "?end@ios_base@std@@2W4_Ios_Seekdir@2@B"]
    pub static std_ios_base_end: std_ios_base_seekdir;
}
#[test]
fn bindgen_test_layout_std_ios_base() {
    assert_eq!(::std::mem::size_of::<std_ios_base>() , 216usize , concat ! (
               "Size of: " , stringify ! ( std_ios_base ) ));
    assert_eq! (::std::mem::align_of::<std_ios_base>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( std_ios_base ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const std_ios_base ) ) . _M_precision as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( std_ios_base ) , "::" ,
                stringify ! ( _M_precision ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const std_ios_base ) ) . _M_width as * const _
                as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( std_ios_base ) , "::" ,
                stringify ! ( _M_width ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const std_ios_base ) ) . _M_flags as * const _
                as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( std_ios_base ) , "::" ,
                stringify ! ( _M_flags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const std_ios_base ) ) . _M_exception as *
                const _ as usize } , 28usize , concat ! (
                "Alignment of field: " , stringify ! ( std_ios_base ) , "::" ,
                stringify ! ( _M_exception ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const std_ios_base ) ) . _M_streambuf_state as
                * const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( std_ios_base ) , "::" ,
                stringify ! ( _M_streambuf_state ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const std_ios_base ) ) . _M_callbacks as *
                const _ as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( std_ios_base ) , "::" ,
                stringify ! ( _M_callbacks ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const std_ios_base ) ) . _M_word_zero as *
                const _ as usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( std_ios_base ) , "::" ,
                stringify ! ( _M_word_zero ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const std_ios_base ) ) . _M_local_word as *
                const _ as usize } , 64usize , concat ! (
                "Alignment of field: " , stringify ! ( std_ios_base ) , "::" ,
                stringify ! ( _M_local_word ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const std_ios_base ) ) . _M_word_size as *
                const _ as usize } , 192usize , concat ! (
                "Alignment of field: " , stringify ! ( std_ios_base ) , "::" ,
                stringify ! ( _M_word_size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const std_ios_base ) ) . _M_word as * const _
                as usize } , 200usize , concat ! (
                "Alignment of field: " , stringify ! ( std_ios_base ) , "::" ,
                stringify ! ( _M_word ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const std_ios_base ) ) . _M_ios_locale as *
                const _ as usize } , 208usize , concat ! (
                "Alignment of field: " , stringify ! ( std_ios_base ) , "::" ,
                stringify ! ( _M_ios_locale ) ));
}
extern "C" {
    #[link_name =
          "?register_callback@ios_base@std@@QEAAXP6AXW4event@12@AEAV12@H@ZH@Z"]
    pub fn std_ios_base_register_callback(this: *mut std_ios_base,
                                          __fn: std_ios_base_event_callback,
                                          __index: ::std::os::raw::c_int);
}
extern "C" {
    #[link_name = "?_M_call_callbacks@ios_base@std@@IEAAXW4event@12@@Z"]
    pub fn std_ios_base__M_call_callbacks(this: *mut std_ios_base,
                                          __ev: std_ios_base_event);
}
extern "C" {
    #[link_name = "?_M_dispose_callbacks@ios_base@std@@IEAAXXZ"]
    pub fn std_ios_base__M_dispose_callbacks(this: *mut std_ios_base);
}
extern "C" {
    #[link_name = "?_M_grow_words@ios_base@std@@IEAAAEAU_Words@12@H_N@Z"]
    pub fn std_ios_base__M_grow_words(this: *mut std_ios_base,
                                      __index: ::std::os::raw::c_int,
                                      __iword: bool)
     -> *mut std_ios_base__Words;
}
extern "C" {
    #[link_name = "?_M_init@ios_base@std@@IEAAXXZ"]
    pub fn std_ios_base__M_init(this: *mut std_ios_base);
}
extern "C" {
    #[link_name = "?sync_with_stdio@ios_base@std@@SA_N_N@Z"]
    pub fn std_ios_base_sync_with_stdio(__sync: bool) -> bool;
}
extern "C" {
    #[link_name = "?imbue@ios_base@std@@QEAA?AVlocale@2@AEBV32@@Z"]
    pub fn std_ios_base_imbue(this: *mut std_ios_base,
                              __loc: *const std_locale) -> std_locale;
}
extern "C" {
    #[link_name = "?xalloc@ios_base@std@@SAHXZ"]
    pub fn std_ios_base_xalloc() -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "??0ios_base@std@@IEAA@XZ"]
    pub fn std_ios_base_ios_base(this: *mut std_ios_base);
}
impl std_ios_base {
    #[inline]
    pub unsafe fn register_callback(&mut self,
                                    __fn: std_ios_base_event_callback,
                                    __index: ::std::os::raw::c_int) {
        std_ios_base_register_callback(self, __fn, __index)
    }
    #[inline]
    pub unsafe fn _M_call_callbacks(&mut self, __ev: std_ios_base_event) {
        std_ios_base__M_call_callbacks(self, __ev)
    }
    #[inline]
    pub unsafe fn _M_dispose_callbacks(&mut self) {
        std_ios_base__M_dispose_callbacks(self)
    }
    #[inline]
    pub unsafe fn _M_grow_words(&mut self, __index: ::std::os::raw::c_int,
                                __iword: bool) -> *mut std_ios_base__Words {
        std_ios_base__M_grow_words(self, __index, __iword)
    }
    #[inline]
    pub unsafe fn _M_init(&mut self) { std_ios_base__M_init(self) }
    #[inline]
    pub unsafe fn sync_with_stdio(__sync: bool) -> bool {
        std_ios_base_sync_with_stdio(__sync)
    }
    #[inline]
    pub unsafe fn imbue(&mut self, __loc: *const std_locale) -> std_locale {
        std_ios_base_imbue(self, __loc)
    }
    #[inline]
    pub unsafe fn xalloc() -> ::std::os::raw::c_int { std_ios_base_xalloc() }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::uninitialized();
        std_ios_base_ios_base(&mut __bindgen_tmp);
        __bindgen_tmp
    }
}
#[repr(C)]
#[derive(Debug)]
pub struct std_basic_ios<_CharT> {
    pub _base: std_ios_base,
    pub _M_tie: *mut std_basic_ostream<_CharT>,
    pub _M_fill: std_basic_ios_char_type<_CharT>,
    pub _M_fill_init: bool,
    pub _M_streambuf: *mut std_basic_streambuf<_CharT>,
    pub _M_ctype: *const std_basic_ios___ctype_type,
    pub _M_num_put: *const std_basic_ios___num_put_type,
    pub _M_num_get: *const std_basic_ios___num_get_type,
}
pub type std_basic_ios_char_type<_CharT> = _CharT;
pub type std_basic_ios_int_type = [u8; 0usize];
pub type std_basic_ios_pos_type = [u8; 0usize];
pub type std_basic_ios_off_type = [u8; 0usize];
pub type std_basic_ios_traits_type<_Traits> = _Traits;
pub type std_basic_ios___ctype_type = std_ctype;
pub type std_basic_ios___num_put_type = std_num_put;
pub type std_basic_ios___num_get_type = std_num_get;
#[repr(C)]
pub struct std_basic_streambuf__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct std_basic_streambuf<_CharT> {
    pub vtable_: *const std_basic_streambuf__bindgen_vtable,
    pub _M_in_beg: *mut std_basic_streambuf_char_type<_CharT>,
    pub _M_in_cur: *mut std_basic_streambuf_char_type<_CharT>,
    pub _M_in_end: *mut std_basic_streambuf_char_type<_CharT>,
    pub _M_out_beg: *mut std_basic_streambuf_char_type<_CharT>,
    pub _M_out_cur: *mut std_basic_streambuf_char_type<_CharT>,
    pub _M_out_end: *mut std_basic_streambuf_char_type<_CharT>,
    pub _M_buf_locale: std_locale,
}
pub type std_basic_streambuf_char_type<_CharT> = _CharT;
pub type std_basic_streambuf_traits_type<_Traits> = _Traits;
pub type std_basic_streambuf_int_type = [u8; 0usize];
pub type std_basic_streambuf_pos_type = [u8; 0usize];
pub type std_basic_streambuf_off_type = [u8; 0usize];
pub type std_basic_streambuf___streambuf_type =
    std_basic_streambuf<std_basic_streambuf_char_type<_CharT>>;
#[repr(C)]
#[derive(Debug)]
pub struct std_basic_istream<_CharT> {
    pub _M_gcount: std_streamsize,
}
pub type std_basic_istream_char_type<_CharT> = _CharT;
pub type std_basic_istream_int_type = [u8; 0usize];
pub type std_basic_istream_pos_type = [u8; 0usize];
pub type std_basic_istream_off_type = [u8; 0usize];
pub type std_basic_istream_traits_type<_Traits> = _Traits;
pub type std_basic_istream___streambuf_type<_CharT> =
    std_basic_streambuf<_CharT>;
pub type std_basic_istream___ios_type<_CharT> = std_basic_ios<_CharT>;
pub type std_basic_istream___istream_type<_CharT> = std_basic_istream<_CharT>;
pub type std_basic_istream___num_get_type = std_num_get;
pub type std_basic_istream___ctype_type = std_ctype;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_istream_sentry {
    pub _M_ok: bool,
}
pub type std_basic_istream_sentry_traits_type = _Traits;
pub type std_basic_istream_sentry___streambuf_type =
    std_basic_streambuf<_CharT>;
pub type std_basic_istream_sentry___istream_type = std_basic_istream<_CharT>;
pub type std_basic_istream_sentry___ctype_type =
    std_basic_istream___ctype_type;
pub type std_basic_istream_sentry___int_type = [u8; 0usize];
#[repr(C)]
#[derive(Debug)]
pub struct std_basic_ostream<_CharT> {
}
pub type std_basic_ostream_char_type<_CharT> = _CharT;
pub type std_basic_ostream_int_type = [u8; 0usize];
pub type std_basic_ostream_pos_type = [u8; 0usize];
pub type std_basic_ostream_off_type = [u8; 0usize];
pub type std_basic_ostream_traits_type<_Traits> = _Traits;
pub type std_basic_ostream___streambuf_type<_CharT> =
    std_basic_streambuf<_CharT>;
pub type std_basic_ostream___ios_type<_CharT> = std_basic_ios<_CharT>;
pub type std_basic_ostream___ostream_type<_CharT> = std_basic_ostream<_CharT>;
pub type std_basic_ostream___num_put_type = std_num_put;
pub type std_basic_ostream___ctype_type = std_ctype;
#[repr(C)]
#[derive(Debug)]
pub struct std_basic_ostream_sentry {
    pub _M_ok: bool,
    pub _M_os: *mut std_basic_ostream<_CharT>,
}
#[repr(C)]
#[derive(Debug)]
pub struct std_basic_iostream<_CharT> {
    pub _base: std_basic_istream<_CharT>,
    pub _base_1: std_basic_ostream<_CharT>,
}
pub type std_basic_iostream_char_type<_CharT> = _CharT;
pub type std_basic_iostream_int_type = [u8; 0usize];
pub type std_basic_iostream_pos_type = [u8; 0usize];
pub type std_basic_iostream_off_type = [u8; 0usize];
pub type std_basic_iostream_traits_type<_Traits> = _Traits;
pub type std_basic_iostream___istream_type<_CharT> =
    std_basic_istream<_CharT>;
pub type std_basic_iostream___ostream_type<_CharT> =
    std_basic_ostream<_CharT>;
#[repr(C)]
#[derive(Debug)]
pub struct std_basic_stringbuf<_CharT, _Alloc> {
    pub _base: std_basic_streambuf<_CharT>,
    pub _M_mode: std_ios_base_openmode,
    pub _M_string: std_basic_stringbuf___string_type<_Alloc>,
}
pub type std_basic_stringbuf_char_type<_CharT> = _CharT;
pub type std_basic_stringbuf_traits_type<_Traits> = _Traits;
pub type std_basic_stringbuf_allocator_type<_Alloc> = _Alloc;
pub type std_basic_stringbuf_int_type = [u8; 0usize];
pub type std_basic_stringbuf_pos_type = [u8; 0usize];
pub type std_basic_stringbuf_off_type = [u8; 0usize];
pub type std_basic_stringbuf___streambuf_type =
    std_basic_streambuf<std_basic_stringbuf_char_type<_CharT>>;
pub type std_basic_stringbuf___string_type<_Alloc> =
    std_basic_string<std_basic_stringbuf_char_type<_CharT>, _Alloc>;
pub type std_basic_stringbuf___size_type<_Alloc> =
    std_basic_stringbuf___string_type<_Alloc>;
#[repr(C)]
#[derive(Debug)]
pub struct std_basic_istringstream<_CharT, _Alloc> {
    pub _base: std_basic_istream<_CharT>,
    pub _M_stringbuf: std_basic_istringstream___stringbuf_type<_CharT,
                                                               _Alloc>,
}
pub type std_basic_istringstream_char_type<_CharT> = _CharT;
pub type std_basic_istringstream_traits_type<_Traits> = _Traits;
pub type std_basic_istringstream_allocator_type<_Alloc> = _Alloc;
pub type std_basic_istringstream_int_type = [u8; 0usize];
pub type std_basic_istringstream_pos_type = [u8; 0usize];
pub type std_basic_istringstream_off_type = [u8; 0usize];
pub type std_basic_istringstream___string_type<_CharT, _Alloc> =
    std_basic_string<_CharT, _Alloc>;
pub type std_basic_istringstream___stringbuf_type<_CharT, _Alloc> =
    std_basic_stringbuf<_CharT, _Alloc>;
pub type std_basic_istringstream___istream_type =
    std_basic_istream<std_basic_istringstream_char_type<_CharT>>;
#[repr(C)]
#[derive(Debug)]
pub struct std_basic_ostringstream<_CharT, _Alloc> {
    pub _base: std_basic_ostream<_CharT>,
    pub _M_stringbuf: std_basic_ostringstream___stringbuf_type<_CharT,
                                                               _Alloc>,
}
pub type std_basic_ostringstream_char_type<_CharT> = _CharT;
pub type std_basic_ostringstream_traits_type<_Traits> = _Traits;
pub type std_basic_ostringstream_allocator_type<_Alloc> = _Alloc;
pub type std_basic_ostringstream_int_type = [u8; 0usize];
pub type std_basic_ostringstream_pos_type = [u8; 0usize];
pub type std_basic_ostringstream_off_type = [u8; 0usize];
pub type std_basic_ostringstream___string_type<_CharT, _Alloc> =
    std_basic_string<_CharT, _Alloc>;
pub type std_basic_ostringstream___stringbuf_type<_CharT, _Alloc> =
    std_basic_stringbuf<_CharT, _Alloc>;
pub type std_basic_ostringstream___ostream_type =
    std_basic_ostream<std_basic_ostringstream_char_type<_CharT>>;
#[repr(C)]
#[derive(Debug)]
pub struct std_basic_stringstream<_CharT, _Alloc> {
    pub _base: std_basic_iostream<_CharT>,
    pub _M_stringbuf: std_basic_stringstream___stringbuf_type<_CharT, _Alloc>,
}
pub type std_basic_stringstream_char_type<_CharT> = _CharT;
pub type std_basic_stringstream_traits_type<_Traits> = _Traits;
pub type std_basic_stringstream_allocator_type<_Alloc> = _Alloc;
pub type std_basic_stringstream_int_type = [u8; 0usize];
pub type std_basic_stringstream_pos_type = [u8; 0usize];
pub type std_basic_stringstream_off_type = [u8; 0usize];
pub type std_basic_stringstream___string_type<_CharT, _Alloc> =
    std_basic_string<_CharT, _Alloc>;
pub type std_basic_stringstream___stringbuf_type<_CharT, _Alloc> =
    std_basic_stringbuf<_CharT, _Alloc>;
pub type std_basic_stringstream___iostream_type =
    std_basic_iostream<std_basic_stringstream_char_type<_CharT>>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_filebuf {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_ifstream {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_ofstream {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_fstream {
    pub _address: u8,
}
pub type std_ios = std_basic_ios<::std::os::raw::c_char>;
pub type std_streambuf = std_basic_streambuf<::std::os::raw::c_char>;
pub type std_istream = std_basic_istream<::std::os::raw::c_char>;
pub type std_ostream = std_basic_ostream<::std::os::raw::c_char>;
pub type std_iostream = std_basic_iostream<::std::os::raw::c_char>;
pub type std_stringbuf =
    std_basic_stringbuf<::std::os::raw::c_char, std_allocator>;
pub type std_istringstream =
    std_basic_istringstream<::std::os::raw::c_char, std_allocator>;
pub type std_ostringstream =
    std_basic_ostringstream<::std::os::raw::c_char, std_allocator>;
pub type std_stringstream =
    std_basic_stringstream<::std::os::raw::c_char, std_allocator>;
pub type std_filebuf = std_basic_filebuf;
pub type std_ifstream = std_basic_ifstream;
pub type std_ofstream = std_basic_ofstream;
pub type std_fstream = std_basic_fstream;
pub type std_wios = std_basic_ios<u16>;
pub type std_wstreambuf = std_basic_streambuf<u16>;
pub type std_wistream = std_basic_istream<u16>;
pub type std_wostream = std_basic_ostream<u16>;
pub type std_wiostream = std_basic_iostream<u16>;
pub type std_wstringbuf = std_basic_stringbuf<u16, std_allocator>;
pub type std_wistringstream = std_basic_istringstream<u16, std_allocator>;
pub type std_wostringstream = std_basic_ostringstream<u16, std_allocator>;
pub type std_wstringstream = std_basic_stringstream<u16, std_allocator>;
pub type std_wfilebuf = std_basic_filebuf;
pub type std_wifstream = std_basic_ifstream;
pub type std_wofstream = std_basic_ofstream;
pub type std_wfstream = std_basic_fstream;
pub type std___gthread_once_t = __gthread_once_t;
#[repr(C)]
#[derive(Debug)]
pub struct std_locale {
    pub _M_impl: *mut std_locale__Impl,
}
pub type std_locale_category = ::std::os::raw::c_int;
#[repr(C)]
pub struct std_locale_facet__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct std_locale_facet {
    pub vtable_: *const std_locale_facet__bindgen_vtable,
    pub _M_refcount: std__Atomic_word,
}
extern "C" {
    #[link_name = "?_S_c_locale@facet@locale@std@@0PEAHEA"]
    pub static mut std_locale_facet__S_c_locale: std___c_locale;
}
extern "C" {
    #[link_name = "?_S_c_name@facet@locale@std@@0QBDB"]
    pub static mut std_locale_facet__S_c_name:
               [::std::os::raw::c_char; 2usize];
}
extern "C" {
    #[link_name = "?_S_once@facet@locale@std@@0U__gthread_once_t@@A"]
    pub static mut std_locale_facet__S_once: std___gthread_once_t;
}
#[test]
fn bindgen_test_layout_std_locale_facet() {
    assert_eq!(::std::mem::size_of::<std_locale_facet>() , 16usize , concat !
               ( "Size of: " , stringify ! ( std_locale_facet ) ));
    assert_eq! (::std::mem::align_of::<std_locale_facet>() , 8usize , concat !
                ( "Alignment of " , stringify ! ( std_locale_facet ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const std_locale_facet ) ) . _M_refcount as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( std_locale_facet ) ,
                "::" , stringify ! ( _M_refcount ) ));
}
extern "C" {
    #[link_name =
          "?_S_create_c_locale@facet@locale@std@@KAXAEAPEAHPEBDPEAH@Z"]
    pub fn std_locale_facet__S_create_c_locale(__cloc: *mut std___c_locale,
                                               __s:
                                                   *const ::std::os::raw::c_char,
                                               __old: std___c_locale);
}
extern "C" {
    #[link_name = "?_S_clone_c_locale@facet@locale@std@@KAPEAHAEAPEAH@Z"]
    pub fn std_locale_facet__S_clone_c_locale(__cloc: *mut std___c_locale)
     -> std___c_locale;
}
extern "C" {
    #[link_name = "?_S_destroy_c_locale@facet@locale@std@@KAXAEAPEAH@Z"]
    pub fn std_locale_facet__S_destroy_c_locale(__cloc: *mut std___c_locale);
}
extern "C" {
    #[link_name = "?_S_lc_ctype_c_locale@facet@locale@std@@KAPEAHPEAHPEBD@Z"]
    pub fn std_locale_facet__S_lc_ctype_c_locale(__cloc: std___c_locale,
                                                 __s:
                                                     *const ::std::os::raw::c_char)
     -> std___c_locale;
}
extern "C" {
    #[link_name = "?_S_get_c_locale@facet@locale@std@@KAPEAHXZ"]
    pub fn std_locale_facet__S_get_c_locale() -> std___c_locale;
}
extern "C" {
    #[link_name = "?_S_get_c_name@facet@locale@std@@KAPEBDXZ"]
    pub fn std_locale_facet__S_get_c_name() -> *const ::std::os::raw::c_char;
}
impl std_locale_facet {
    #[inline]
    pub unsafe fn _S_create_c_locale(__cloc: *mut std___c_locale,
                                     __s: *const ::std::os::raw::c_char,
                                     __old: std___c_locale) {
        std_locale_facet__S_create_c_locale(__cloc, __s, __old)
    }
    #[inline]
    pub unsafe fn _S_clone_c_locale(__cloc: *mut std___c_locale)
     -> std___c_locale {
        std_locale_facet__S_clone_c_locale(__cloc)
    }
    #[inline]
    pub unsafe fn _S_destroy_c_locale(__cloc: *mut std___c_locale) {
        std_locale_facet__S_destroy_c_locale(__cloc)
    }
    #[inline]
    pub unsafe fn _S_lc_ctype_c_locale(__cloc: std___c_locale,
                                       __s: *const ::std::os::raw::c_char)
     -> std___c_locale {
        std_locale_facet__S_lc_ctype_c_locale(__cloc, __s)
    }
    #[inline]
    pub unsafe fn _S_get_c_locale() -> std___c_locale {
        std_locale_facet__S_get_c_locale()
    }
    #[inline]
    pub unsafe fn _S_get_c_name() -> *const ::std::os::raw::c_char {
        std_locale_facet__S_get_c_name()
    }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct std_locale_id {
    pub _M_index: usize,
}
extern "C" {
    #[link_name = "?_S_refcount@id@locale@std@@0HA"]
    pub static mut std_locale_id__S_refcount: std__Atomic_word;
}
#[test]
fn bindgen_test_layout_std_locale_id() {
    assert_eq!(::std::mem::size_of::<std_locale_id>() , 8usize , concat ! (
               "Size of: " , stringify ! ( std_locale_id ) ));
    assert_eq! (::std::mem::align_of::<std_locale_id>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( std_locale_id ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const std_locale_id ) ) . _M_index as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( std_locale_id ) , "::"
                , stringify ! ( _M_index ) ));
}
extern "C" {
    #[link_name = "?_M_id@id@locale@std@@QEBA_KXZ"]
    pub fn std_locale_id__M_id(this: *const std_locale_id) -> usize;
}
impl Clone for std_locale_id {
    fn clone(&self) -> Self { *self }
}
impl std_locale_id {
    #[inline]
    pub unsafe fn _M_id(&self) -> usize { std_locale_id__M_id(self) }
}
#[repr(C)]
#[derive(Debug)]
pub struct std_locale__Impl {
    pub _M_refcount: std__Atomic_word,
    pub _M_facets: *mut *const std_locale_facet,
    pub _M_facets_size: usize,
    pub _M_caches: *mut *const std_locale_facet,
    pub _M_names: *mut *mut ::std::os::raw::c_char,
}
extern "C" {
    #[link_name = "?_S_id_ctype@_Impl@locale@std@@0QBQEBVid@23@B"]
    pub static mut std_locale__Impl__S_id_ctype:
               [*const std_locale_id; 0usize];
}
extern "C" {
    #[link_name = "?_S_id_numeric@_Impl@locale@std@@0QBQEBVid@23@B"]
    pub static mut std_locale__Impl__S_id_numeric:
               [*const std_locale_id; 0usize];
}
extern "C" {
    #[link_name = "?_S_id_collate@_Impl@locale@std@@0QBQEBVid@23@B"]
    pub static mut std_locale__Impl__S_id_collate:
               [*const std_locale_id; 0usize];
}
extern "C" {
    #[link_name = "?_S_id_time@_Impl@locale@std@@0QBQEBVid@23@B"]
    pub static mut std_locale__Impl__S_id_time:
               [*const std_locale_id; 0usize];
}
extern "C" {
    #[link_name = "?_S_id_monetary@_Impl@locale@std@@0QBQEBVid@23@B"]
    pub static mut std_locale__Impl__S_id_monetary:
               [*const std_locale_id; 0usize];
}
extern "C" {
    #[link_name = "?_S_id_messages@_Impl@locale@std@@0QBQEBVid@23@B"]
    pub static mut std_locale__Impl__S_id_messages:
               [*const std_locale_id; 0usize];
}
extern "C" {
    #[link_name = "?_S_facet_categories@_Impl@locale@std@@0QBQEBQEBVid@23@B"]
    pub static mut std_locale__Impl__S_facet_categories:
               [*const *const std_locale_id; 0usize];
}
#[test]
fn bindgen_test_layout_std_locale__Impl() {
    assert_eq!(::std::mem::size_of::<std_locale__Impl>() , 40usize , concat !
               ( "Size of: " , stringify ! ( std_locale__Impl ) ));
    assert_eq! (::std::mem::align_of::<std_locale__Impl>() , 8usize , concat !
                ( "Alignment of " , stringify ! ( std_locale__Impl ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const std_locale__Impl ) ) . _M_refcount as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( std_locale__Impl ) ,
                "::" , stringify ! ( _M_refcount ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const std_locale__Impl ) ) . _M_facets as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( std_locale__Impl ) ,
                "::" , stringify ! ( _M_facets ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const std_locale__Impl ) ) . _M_facets_size as
                * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( std_locale__Impl ) ,
                "::" , stringify ! ( _M_facets_size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const std_locale__Impl ) ) . _M_caches as *
                const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( std_locale__Impl ) ,
                "::" , stringify ! ( _M_caches ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const std_locale__Impl ) ) . _M_names as *
                const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( std_locale__Impl ) ,
                "::" , stringify ! ( _M_names ) ));
}
pub const std_locale__S_categories_size: std_locale__bindgen_ty_1 =
    std_locale__bindgen_ty_1::_S_categories_size;
#[repr(i32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum std_locale__bindgen_ty_1 { _S_categories_size = 6, }
pub const std_locale_none: std_locale_category = 0;
pub const std_locale_ctype: std_locale_category = 1;
pub const std_locale_numeric: std_locale_category = 2;
pub const std_locale_collate: std_locale_category = 4;
pub const std_locale_time: std_locale_category = 8;
pub const std_locale_monetary: std_locale_category = 16;
pub const std_locale_messages: std_locale_category = 32;
pub const std_locale_all: std_locale_category = 63;
extern "C" {
    #[link_name = "?_S_classic@locale@std@@0PEAV_Impl@12@EA"]
    pub static mut std_locale__S_classic: *mut std_locale__Impl;
}
extern "C" {
    #[link_name = "?_S_global@locale@std@@0PEAV_Impl@12@EA"]
    pub static mut std_locale__S_global: *mut std_locale__Impl;
}
extern "C" {
    #[link_name = "?_S_categories@locale@std@@0QEBQEBDEB"]
    pub static std_locale__S_categories: *const *const ::std::os::raw::c_char;
}
extern "C" {
    #[link_name = "?_S_once@locale@std@@0U__gthread_once_t@@A"]
    pub static mut std_locale__S_once: std___gthread_once_t;
}
#[test]
fn bindgen_test_layout_std_locale() {
    assert_eq!(::std::mem::size_of::<std_locale>() , 8usize , concat ! (
               "Size of: " , stringify ! ( std_locale ) ));
    assert_eq! (::std::mem::align_of::<std_locale>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( std_locale ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const std_locale ) ) . _M_impl as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( std_locale ) , "::" ,
                stringify ! ( _M_impl ) ));
}
extern "C" {
    #[link_name =
          "?name@locale@std@@QEBA?AV?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@@2@XZ"]
    pub fn std_locale_name(this: *const std_locale) -> std_string;
}
extern "C" {
    #[link_name = "?global@locale@std@@SA?AV12@AEBV12@@Z"]
    pub fn std_locale_global(__loc: *const std_locale) -> std_locale;
}
extern "C" {
    #[link_name = "?classic@locale@std@@SAAEBV12@XZ"]
    pub fn std_locale_classic() -> *const std_locale;
}
extern "C" {
    #[link_name = "??0locale@std@@QEAA@XZ"]
    pub fn std_locale_locale(this: *mut std_locale);
}
extern "C" {
    #[link_name = "??0locale@std@@QEAA@AEBV01@@Z"]
    pub fn std_locale_locale1(this: *mut std_locale,
                              __other: *const std_locale);
}
extern "C" {
    #[link_name = "??0locale@std@@QEAA@PEBD@Z"]
    pub fn std_locale_locale2(this: *mut std_locale,
                              __s: *const ::std::os::raw::c_char);
}
extern "C" {
    #[link_name = "??0locale@std@@QEAA@AEBV01@PEBDH@Z"]
    pub fn std_locale_locale3(this: *mut std_locale,
                              __base: *const std_locale,
                              __s: *const ::std::os::raw::c_char,
                              __cat: std_locale_category);
}
extern "C" {
    #[link_name = "??0locale@std@@QEAA@AEBV01@0H@Z"]
    pub fn std_locale_locale4(this: *mut std_locale,
                              __base: *const std_locale,
                              __add: *const std_locale,
                              __cat: std_locale_category);
}
extern "C" {
    #[link_name = "??_Dlocale@std@@QEAA@XZ"]
    pub fn std_locale_locale_destructor(this: *mut std_locale);
}
impl std_locale {
    #[inline]
    pub unsafe fn name(&self) -> std_string { std_locale_name(self) }
    #[inline]
    pub unsafe fn global(__loc: *const std_locale) -> std_locale {
        std_locale_global(__loc)
    }
    #[inline]
    pub unsafe fn classic() -> *const std_locale { std_locale_classic() }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::uninitialized();
        std_locale_locale(&mut __bindgen_tmp);
        __bindgen_tmp
    }
    #[inline]
    pub unsafe fn new1(__other: *const std_locale) -> Self {
        let mut __bindgen_tmp = ::std::mem::uninitialized();
        std_locale_locale1(&mut __bindgen_tmp, __other);
        __bindgen_tmp
    }
    #[inline]
    pub unsafe fn new2(__s: *const ::std::os::raw::c_char) -> Self {
        let mut __bindgen_tmp = ::std::mem::uninitialized();
        std_locale_locale2(&mut __bindgen_tmp, __s);
        __bindgen_tmp
    }
    #[inline]
    pub unsafe fn new3(__base: *const std_locale,
                       __s: *const ::std::os::raw::c_char,
                       __cat: std_locale_category) -> Self {
        let mut __bindgen_tmp = ::std::mem::uninitialized();
        std_locale_locale3(&mut __bindgen_tmp, __base, __s, __cat);
        __bindgen_tmp
    }
    #[inline]
    pub unsafe fn new4(__base: *const std_locale, __add: *const std_locale,
                       __cat: std_locale_category) -> Self {
        let mut __bindgen_tmp = ::std::mem::uninitialized();
        std_locale_locale4(&mut __bindgen_tmp, __base, __add, __cat);
        __bindgen_tmp
    }
    #[inline]
    pub unsafe fn destruct(&mut self) { std_locale_locale_destructor(self) }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct std_ctype_base {
    pub _address: u8,
}
pub type std_ctype_base___to_type = *const ::std::os::raw::c_int;
pub type std_ctype_base_mask = ::std::os::raw::c_ushort;
pub const std_ctype_base_upper: std_ctype_base_mask = 1;
pub const std_ctype_base_lower: std_ctype_base_mask = 2;
pub const std_ctype_base_alpha: std_ctype_base_mask = 4;
pub const std_ctype_base_digit: std_ctype_base_mask = 8;
pub const std_ctype_base_xdigit: std_ctype_base_mask = 16;
pub const std_ctype_base_space: std_ctype_base_mask = 32;
pub const std_ctype_base_print: std_ctype_base_mask = 64;
pub const std_ctype_base_graph: std_ctype_base_mask = 524;
pub const std_ctype_base_cntrl: std_ctype_base_mask = 256;
pub const std_ctype_base_punct: std_ctype_base_mask = 512;
pub const std_ctype_base_alnum: std_ctype_base_mask = 12;
#[test]
fn bindgen_test_layout_std_ctype_base() {
    assert_eq!(::std::mem::size_of::<std_ctype_base>() , 1usize , concat ! (
               "Size of: " , stringify ! ( std_ctype_base ) ));
    assert_eq! (::std::mem::align_of::<std_ctype_base>() , 1usize , concat ! (
                "Alignment of " , stringify ! ( std_ctype_base ) ));
}
impl Clone for std_ctype_base {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug)]
pub struct std_ctype {
    pub _base: std___ctype_abstract_base,
}
pub type std_ctype_char_type<_CharT> = _CharT;
pub type std_ctype_mask = std___ctype_abstract_base;
#[test]
fn __bindgen_test_layout_std_ctype_instantiation_7264() {
    assert_eq!(::std::mem::size_of::<std_ctype>() , 576usize , concat ! (
               "Size of template specialization: " , stringify ! ( std_ctype )
               ));
    assert_eq!(::std::mem::align_of::<std_ctype>() , 8usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std_ctype ) ));
}
#[test]
fn __bindgen_test_layout_std_ctype_instantiation_7268() {
    assert_eq!(::std::mem::size_of::<std_ctype>() , 736usize , concat ! (
               "Size of template specialization: " , stringify ! ( std_ctype )
               ));
    assert_eq!(::std::mem::align_of::<std_ctype>() , 8usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std_ctype ) ));
}
#[repr(C)]
#[derive(Debug)]
pub struct std_ctype_byname {
    pub _base: std_ctype,
}
pub type std_ctype_byname_mask = std_ctype;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_codecvt_base([u8; 0]);
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_codecvt {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_codecvt_byname {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug)]
pub struct std_num_get {
    pub _base: std_locale_facet,
}
pub type std_num_get_char_type<_CharT> = _CharT;
pub type std_num_get_iter_type<_InIter> = _InIter;
#[repr(C)]
#[derive(Debug)]
pub struct std_num_put {
    pub _base: std_locale_facet,
}
pub type std_num_put_char_type<_CharT> = _CharT;
pub type std_num_put_iter_type<_OutIter> = _OutIter;
#[repr(C)]
#[derive(Debug)]
pub struct std_numpunct<_CharT> {
    pub _base: std_locale_facet,
    pub _M_data: *mut std_numpunct___cache_type<_CharT>,
}
pub type std_numpunct_char_type<_CharT> = _CharT;
pub type std_numpunct_string_type = std_basic_string<_CharT, _Alloc>;
pub type std_numpunct___cache_type<_CharT> = std___numpunct_cache<_CharT>;
#[repr(C)]
#[derive(Debug)]
pub struct std_numpunct_byname<_CharT> {
    pub _base: std_numpunct<_CharT>,
}
pub type std_numpunct_byname_char_type<_CharT> = _CharT;
pub type std_numpunct_byname_string_type = std_basic_string<_CharT, _Alloc>;
#[repr(C)]
#[derive(Debug)]
pub struct std_collate {
    pub _base: std_locale_facet,
    pub _M_c_locale_collate: std___c_locale,
}
pub type std_collate_char_type<_CharT> = _CharT;
pub type std_collate_string_type = std_basic_string<_CharT, _Alloc>;
#[repr(C)]
#[derive(Debug)]
pub struct std_collate_byname {
    pub _base: std_collate,
}
pub type std_collate_byname_char_type<_CharT> = _CharT;
pub type std_collate_byname_string_type = std_basic_string<_CharT, _Alloc>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_time_base([u8; 0]);
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_time_get {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_time_get_byname {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_time_put {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_time_put_byname {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_money_base([u8; 0]);
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_money_get {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_money_put {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_messages_base([u8; 0]);
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_messages {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_messages_byname {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_unary_function {
    pub _address: u8,
}
pub type std_unary_function_argument_type<_Arg> = _Arg;
pub type std_unary_function_result_type<_Result> = _Result;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_binary_function {
    pub _address: u8,
}
pub type std_binary_function_first_argument_type<_Arg1> = _Arg1;
pub type std_binary_function_second_argument_type<_Arg2> = _Arg2;
pub type std_binary_function_result_type<_Result> = _Result;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_plus {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_minus {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_multiplies {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_divides {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_modulus {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_negate {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_equal_to {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_not_equal_to {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_greater {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_less {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_greater_equal {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_less_equal {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_logical_and {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_logical_or {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_logical_not {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_bit_and {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_bit_or {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_bit_xor {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_bit_not {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_unary_negate<_Predicate> {
    pub _M_pred: _Predicate,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_binary_negate<_Predicate> {
    pub _M_pred: _Predicate,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_pointer_to_unary_function<_Arg, _Result> {
    pub _M_ptr: ::std::option::Option<unsafe extern "C" fn(arg1: _Arg)
                                          -> _Result>,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_pointer_to_binary_function<_Arg1, _Arg2, _Result> {
    pub _M_ptr: ::std::option::Option<unsafe extern "C" fn(arg1: _Arg1,
                                                           arg2: _Arg2)
                                          -> _Result>,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Identity {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Select1st {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Select2nd {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_mem_fun_t<_Ret> {
    pub _M_f: ::std::option::Option<unsafe extern "C" fn() -> _Ret>,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_const_mem_fun_t<_Ret> {
    pub _M_f: ::std::option::Option<unsafe extern "C" fn() -> _Ret>,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_mem_fun_ref_t<_Ret> {
    pub _M_f: ::std::option::Option<unsafe extern "C" fn() -> _Ret>,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_const_mem_fun_ref_t<_Ret> {
    pub _M_f: ::std::option::Option<unsafe extern "C" fn() -> _Ret>,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_mem_fun1_t<_Ret, _Arg> {
    pub _M_f: ::std::option::Option<unsafe extern "C" fn(arg1: _Arg) -> _Ret>,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_const_mem_fun1_t<_Ret, _Arg> {
    pub _M_f: ::std::option::Option<unsafe extern "C" fn(arg1: _Arg) -> _Ret>,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_mem_fun1_ref_t<_Ret, _Arg> {
    pub _M_f: ::std::option::Option<unsafe extern "C" fn(arg1: _Arg) -> _Ret>,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_const_mem_fun1_ref_t<_Ret, _Arg> {
    pub _M_f: ::std::option::Option<unsafe extern "C" fn(arg1: _Arg) -> _Ret>,
}
#[repr(C)]
pub struct std_binder1st<_Operation> {
    pub op: _Operation,
    pub value: [u8; 0usize],
}
#[repr(C)]
pub struct std_binder2nd<_Operation> {
    pub op: _Operation,
    pub value: [u8; 0usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_initializer_list<_E> {
    pub _M_array: std_initializer_list_iterator<_E>,
    pub _M_len: std_initializer_list_size_type,
}
pub type std_initializer_list_value_type<_E> = _E;
pub type std_initializer_list_reference<_E> = *mut _E;
pub type std_initializer_list_const_reference<_E> = *mut _E;
pub type std_initializer_list_size_type = usize;
pub type std_initializer_list_iterator<_E> = *mut _E;
pub type std_initializer_list_const_iterator<_E> = *mut _E;
extern "C" {
    #[link_name =
          "??$getline@DU?$char_traits@D@std@@V?$allocator@D@2@@std@@YAAEAV?$basic_istream@DU?$char_traits@D@std@@@0@AEAV10@AEAV?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@@0@D@Z"]
    pub fn std_getline(__in: *mut std_basic_istream<::std::os::raw::c_char>,
                       __str:
                           *mut std_basic_string<::std::os::raw::c_char,
                                                 std_allocator>,
                       __delim: ::std::os::raw::c_char)
     -> *mut std_basic_istream<::std::os::raw::c_char>;
}
extern "C" {
    #[link_name =
          "??$getline@_WU?$char_traits@_W@std@@V?$allocator@_W@2@@std@@YAAEAV?$basic_istream@_WU?$char_traits@_W@std@@@0@AEAV10@AEAV?$basic_string@_WU?$char_traits@_W@std@@V?$allocator@_W@2@@0@_W@Z"]
    pub fn std_getline1(__in: *mut std_basic_istream<u16>,
                        __str: *mut std_basic_string<u16, std_allocator>,
                        __delim: u16) -> *mut std_basic_istream<u16>;
}
extern "C" {
    #[link_name = "?_Hash_bytes@std@@YA_KPEBX_K1@Z"]
    pub fn std__Hash_bytes(__ptr: *const ::std::os::raw::c_void, __len: usize,
                           __seed: usize) -> usize;
}
extern "C" {
    #[link_name = "?_Fnv_hash_bytes@std@@YA_KPEBX_K1@Z"]
    pub fn std__Fnv_hash_bytes(__ptr: *const ::std::os::raw::c_void,
                               __len: usize, __seed: usize) -> usize;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___hash_base {
    pub _address: u8,
}
pub type std___hash_base_result_type<_Result> = _Result;
pub type std___hash_base_argument_type<_Arg> = _Arg;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_hash {
    pub _address: u8,
}
#[test]
fn __bindgen_test_layout_std_hash_instantiation_9327() {
    assert_eq!(::std::mem::size_of::<std_hash>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! ( std_hash )
               ));
    assert_eq!(::std::mem::align_of::<std_hash>() , 1usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std_hash ) ));
}
#[test]
fn __bindgen_test_layout_std_hash_instantiation_9331() {
    assert_eq!(::std::mem::size_of::<std_hash>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! ( std_hash )
               ));
    assert_eq!(::std::mem::align_of::<std_hash>() , 1usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std_hash ) ));
}
#[test]
fn __bindgen_test_layout_std_hash_instantiation_9335() {
    assert_eq!(::std::mem::size_of::<std_hash>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! ( std_hash )
               ));
    assert_eq!(::std::mem::align_of::<std_hash>() , 1usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std_hash ) ));
}
#[test]
fn __bindgen_test_layout_std_hash_instantiation_9339() {
    assert_eq!(::std::mem::size_of::<std_hash>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! ( std_hash )
               ));
    assert_eq!(::std::mem::align_of::<std_hash>() , 1usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std_hash ) ));
}
#[test]
fn __bindgen_test_layout_std_hash_instantiation_9343() {
    assert_eq!(::std::mem::size_of::<std_hash>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! ( std_hash )
               ));
    assert_eq!(::std::mem::align_of::<std_hash>() , 1usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std_hash ) ));
}
#[test]
fn __bindgen_test_layout_std_hash_instantiation_9347() {
    assert_eq!(::std::mem::size_of::<std_hash>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! ( std_hash )
               ));
    assert_eq!(::std::mem::align_of::<std_hash>() , 1usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std_hash ) ));
}
#[test]
fn __bindgen_test_layout_std_hash_instantiation_9351() {
    assert_eq!(::std::mem::size_of::<std_hash>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! ( std_hash )
               ));
    assert_eq!(::std::mem::align_of::<std_hash>() , 1usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std_hash ) ));
}
#[test]
fn __bindgen_test_layout_std_hash_instantiation_9355() {
    assert_eq!(::std::mem::size_of::<std_hash>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! ( std_hash )
               ));
    assert_eq!(::std::mem::align_of::<std_hash>() , 1usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std_hash ) ));
}
#[test]
fn __bindgen_test_layout_std_hash_instantiation_9359() {
    assert_eq!(::std::mem::size_of::<std_hash>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! ( std_hash )
               ));
    assert_eq!(::std::mem::align_of::<std_hash>() , 1usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std_hash ) ));
}
#[test]
fn __bindgen_test_layout_std_hash_instantiation_9363() {
    assert_eq!(::std::mem::size_of::<std_hash>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! ( std_hash )
               ));
    assert_eq!(::std::mem::align_of::<std_hash>() , 1usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std_hash ) ));
}
#[test]
fn __bindgen_test_layout_std_hash_instantiation_9367() {
    assert_eq!(::std::mem::size_of::<std_hash>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! ( std_hash )
               ));
    assert_eq!(::std::mem::align_of::<std_hash>() , 1usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std_hash ) ));
}
#[test]
fn __bindgen_test_layout_std_hash_instantiation_9371() {
    assert_eq!(::std::mem::size_of::<std_hash>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! ( std_hash )
               ));
    assert_eq!(::std::mem::align_of::<std_hash>() , 1usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std_hash ) ));
}
#[test]
fn __bindgen_test_layout_std_hash_instantiation_9375() {
    assert_eq!(::std::mem::size_of::<std_hash>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! ( std_hash )
               ));
    assert_eq!(::std::mem::align_of::<std_hash>() , 1usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std_hash ) ));
}
#[test]
fn __bindgen_test_layout_std_hash_instantiation_9379() {
    assert_eq!(::std::mem::size_of::<std_hash>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! ( std_hash )
               ));
    assert_eq!(::std::mem::align_of::<std_hash>() , 1usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std_hash ) ));
}
#[test]
fn __bindgen_test_layout_std_hash_instantiation_9383() {
    assert_eq!(::std::mem::size_of::<std_hash>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! ( std_hash )
               ));
    assert_eq!(::std::mem::align_of::<std_hash>() , 1usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std_hash ) ));
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct std__Hash_impl {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std__Hash_impl() {
    assert_eq!(::std::mem::size_of::<std__Hash_impl>() , 1usize , concat ! (
               "Size of: " , stringify ! ( std__Hash_impl ) ));
    assert_eq! (::std::mem::align_of::<std__Hash_impl>() , 1usize , concat ! (
                "Alignment of " , stringify ! ( std__Hash_impl ) ));
}
impl Clone for std__Hash_impl {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct std__Fnv_hash_impl {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std__Fnv_hash_impl() {
    assert_eq!(::std::mem::size_of::<std__Fnv_hash_impl>() , 1usize , concat !
               ( "Size of: " , stringify ! ( std__Fnv_hash_impl ) ));
    assert_eq! (::std::mem::align_of::<std__Fnv_hash_impl>() , 1usize , concat
                ! ( "Alignment of " , stringify ! ( std__Fnv_hash_impl ) ));
}
impl Clone for std__Fnv_hash_impl {
    fn clone(&self) -> Self { *self }
}
#[test]
fn __bindgen_test_layout_std_hash_instantiation_9399() {
    assert_eq!(::std::mem::size_of::<std_hash>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! ( std_hash )
               ));
    assert_eq!(::std::mem::align_of::<std_hash>() , 1usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std_hash ) ));
}
#[test]
fn __bindgen_test_layout_std_hash_instantiation_9403() {
    assert_eq!(::std::mem::size_of::<std_hash>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! ( std_hash )
               ));
    assert_eq!(::std::mem::align_of::<std_hash>() , 1usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std_hash ) ));
}
#[test]
fn __bindgen_test_layout_std_hash_instantiation_9407() {
    assert_eq!(::std::mem::size_of::<std_hash>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! ( std_hash )
               ));
    assert_eq!(::std::mem::align_of::<std_hash>() , 1usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std_hash ) ));
}
#[repr(C)]
pub struct std___is_fast_hash {
    pub _address: u8,
}
#[test]
fn __bindgen_test_layout_std___is_fast_hash_instantiation_9414() {
    assert_eq!(::std::mem::size_of::<std___is_fast_hash>() , 1usize , concat !
               (
               "Size of template specialization: " , stringify ! (
               std___is_fast_hash ) ));
    assert_eq!(::std::mem::align_of::<std___is_fast_hash>() , 1usize , concat
               ! (
               "Alignment of template specialization: " , stringify ! (
               std___is_fast_hash ) ));
}
#[test]
fn __bindgen_test_layout_std_hash_instantiation_9417() {
    assert_eq!(::std::mem::size_of::<std_hash>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! ( std_hash )
               ));
    assert_eq!(::std::mem::align_of::<std_hash>() , 1usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std_hash ) ));
}
#[test]
fn __bindgen_test_layout_std___is_fast_hash_instantiation_9420() {
    assert_eq!(::std::mem::size_of::<std___is_fast_hash>() , 1usize , concat !
               (
               "Size of template specialization: " , stringify ! (
               std___is_fast_hash ) ));
    assert_eq!(::std::mem::align_of::<std___is_fast_hash>() , 1usize , concat
               ! (
               "Alignment of template specialization: " , stringify ! (
               std___is_fast_hash ) ));
}
#[test]
fn __bindgen_test_layout_std_hash_instantiation_9423() {
    assert_eq!(::std::mem::size_of::<std_hash>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! ( std_hash )
               ));
    assert_eq!(::std::mem::align_of::<std_hash>() , 1usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std_hash ) ));
}
#[test]
fn __bindgen_test_layout_std___is_fast_hash_instantiation_9426() {
    assert_eq!(::std::mem::size_of::<std___is_fast_hash>() , 1usize , concat !
               (
               "Size of template specialization: " , stringify ! (
               std___is_fast_hash ) ));
    assert_eq!(::std::mem::align_of::<std___is_fast_hash>() , 1usize , concat
               ! (
               "Alignment of template specialization: " , stringify ! (
               std___is_fast_hash ) ));
}
#[test]
fn __bindgen_test_layout_std_hash_instantiation_9429() {
    assert_eq!(::std::mem::size_of::<std_hash>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! ( std_hash )
               ));
    assert_eq!(::std::mem::align_of::<std_hash>() , 1usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std_hash ) ));
}
#[test]
fn __bindgen_test_layout_std___is_fast_hash_instantiation_9432() {
    assert_eq!(::std::mem::size_of::<std___is_fast_hash>() , 1usize , concat !
               (
               "Size of template specialization: " , stringify ! (
               std___is_fast_hash ) ));
    assert_eq!(::std::mem::align_of::<std___is_fast_hash>() , 1usize , concat
               ! (
               "Alignment of template specialization: " , stringify ! (
               std___is_fast_hash ) ));
}
#[test]
fn __bindgen_test_layout_std_hash_instantiation_9435() {
    assert_eq!(::std::mem::size_of::<std_hash>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! ( std_hash )
               ));
    assert_eq!(::std::mem::align_of::<std_hash>() , 1usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std_hash ) ));
}
#[test]
fn __bindgen_test_layout_std___is_fast_hash_instantiation_9438() {
    assert_eq!(::std::mem::size_of::<std___is_fast_hash>() , 1usize , concat !
               (
               "Size of template specialization: " , stringify ! (
               std___is_fast_hash ) ));
    assert_eq!(::std::mem::align_of::<std___is_fast_hash>() , 1usize , concat
               ! (
               "Alignment of template specialization: " , stringify ! (
               std___is_fast_hash ) ));
}
extern "C" {
    #[link_name = "_S_max_size"]
    pub static std__S_max_size: std_basic_string_size_type;
}
extern "C" {
    #[link_name = "_S_terminal"]
    pub static std__S_terminal: _CharT;
}
extern "C" {
    #[link_name = "npos"]
    pub static std_npos: std_basic_string_size_type;
}
extern "C" {
    #[link_name = "_S_empty_rep_storage"]
    pub static mut std__S_empty_rep_storage: *mut std_basic_string_size_type;
}
#[test]
fn __bindgen_test_layout_std_basic_string_instantiation_9745() {
    assert_eq!(::std::mem::size_of::<std_basic_string<::std::os::raw::c_char,
                                       std_allocator>>()
               , 8usize , concat ! (
               "Size of template specialization: " , stringify ! (
               std_basic_string<::std::os::raw::c_char, std_allocator> ) ));
    assert_eq!(::std::mem::align_of::<std_basic_string<::std::os::raw::c_char,
                                        std_allocator>>()
               , 8usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std_basic_string<::std::os::raw::c_char, std_allocator> ) ));
}
#[test]
fn __bindgen_test_layout_std_basic_string_instantiation_9751() {
    assert_eq!(::std::mem::size_of::<std_basic_string<u16, std_allocator>>() ,
               8usize , concat ! (
               "Size of template specialization: " , stringify ! (
               std_basic_string<u16, std_allocator> ) ));
    assert_eq!(::std::mem::align_of::<std_basic_string<u16, std_allocator>>()
               , 8usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std_basic_string<u16, std_allocator> ) ));
}
pub type std_size_type = size_type;
pub type std_size_type = size_type;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_tuple_size {
    pub _address: u8,
}
#[test]
fn __bindgen_test_layout_std___pair_get_instantiation_10020() {
    assert_eq!(::std::mem::size_of::<u8>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! ( u8 ) ));
    assert_eq!(::std::mem::align_of::<u8>() , 1usize , concat ! (
               "Alignment of template specialization: " , stringify ! ( u8 )
               ));
}
#[test]
fn __bindgen_test_layout_std___pair_get_instantiation_10022() {
    assert_eq!(::std::mem::size_of::<u8>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! ( u8 ) ));
    assert_eq!(::std::mem::align_of::<u8>() , 1usize , concat ! (
               "Alignment of template specialization: " , stringify ! ( u8 )
               ));
}
#[test]
fn __bindgen_test_layout_std__Build_index_tuple_instantiation_10031() {
    assert_eq!(::std::mem::size_of::<u8>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! ( u8 ) ));
    assert_eq!(::std::mem::align_of::<u8>() , 1usize , concat ! (
               "Alignment of template specialization: " , stringify ! ( u8 )
               ));
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___alloctr_rebind_helper {
    pub _address: u8,
}
pub type std___alloctr_rebind_helper___type<_Alloc> = _Alloc;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_allocator_traits {
    pub _address: u8,
}
pub type std_allocator_traits_allocator_type<_Alloc> = _Alloc;
pub type std_allocator_traits_value_type = [u8; 0usize];
pub type std_allocator_traits___pointer<_Alloc> = _Alloc;
pub type std_allocator_traits_pointer<_Alloc> =
    std_allocator_traits___pointer<_Alloc>;
pub type std_allocator_traits___const_pointer<_Alloc> = _Alloc;
pub type std_allocator_traits_const_pointer<_Alloc> =
    std_allocator_traits___const_pointer<_Alloc>;
pub type std_allocator_traits___void_pointer<_Alloc> = _Alloc;
pub type std_allocator_traits_void_pointer<_Alloc> =
    std_allocator_traits___void_pointer<_Alloc>;
pub type std_allocator_traits___const_void_pointer<_Alloc> = _Alloc;
pub type std_allocator_traits_const_void_pointer<_Alloc> =
    std_allocator_traits___const_void_pointer<_Alloc>;
pub type std_allocator_traits___difference_type<_Alloc> = _Alloc;
pub type std_allocator_traits_difference_type<_Alloc> =
    std_allocator_traits___difference_type<_Alloc>;
pub type std_allocator_traits___size_type<_Alloc> = _Alloc;
pub type std_allocator_traits_size_type<_Alloc> =
    std_allocator_traits___size_type<_Alloc>;
pub type std_allocator_traits___propagate_on_container_copy_assignment<_Alloc>
    = _Alloc;
pub type std_allocator_traits_propagate_on_container_copy_assignment<_Alloc> =
    std_allocator_traits___propagate_on_container_copy_assignment<_Alloc>;
pub type std_allocator_traits___propagate_on_container_move_assignment<_Alloc>
    = _Alloc;
pub type std_allocator_traits_propagate_on_container_move_assignment<_Alloc> =
    std_allocator_traits___propagate_on_container_move_assignment<_Alloc>;
pub type std_allocator_traits___propagate_on_container_swap<_Alloc> = _Alloc;
pub type std_allocator_traits_propagate_on_container_swap<_Alloc> =
    std_allocator_traits___propagate_on_container_swap<_Alloc>;
pub type std_allocator_traits_rebind_alloc = u8;
pub type std_allocator_traits_rebind_traits = std_allocator_traits;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_allocator_traits___allocate_helper {
    pub _address: u8,
}
pub type std_allocator_traits___allocate_helper_type<_Alloc> = _Alloc;
pub type std_allocator_traits___has_allocate =
    std_allocator_traits___allocate_helper;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_allocator_traits___construct_helper {
    pub _address: u8,
}
pub type std_allocator_traits___construct_helper_type<_Alloc> = _Alloc;
pub type std_allocator_traits___has_construct =
    std_allocator_traits___construct_helper;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_allocator_traits___destroy_helper {
    pub _address: u8,
}
pub type std_allocator_traits___destroy_helper_type<_Alloc> = _Alloc;
pub type std_allocator_traits___has_destroy =
    std_allocator_traits___destroy_helper;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_allocator_traits___maxsize_helper {
    pub _address: u8,
}
pub type std_allocator_traits___maxsize_helper_type<_Alloc2> = _Alloc2;
pub type std_allocator_traits___has_max_size =
    std_allocator_traits___maxsize_helper;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_allocator_traits___select_helper {
    pub _address: u8,
}
pub type std_allocator_traits___select_helper_type<_Alloc2> = _Alloc2;
pub type std_allocator_traits___has_soccc =
    std_allocator_traits___select_helper;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_copy_insertable_impl {
    pub _address: u8,
}
pub type std___is_copy_insertable_impl__Traits = std_allocator_traits;
pub type std___is_copy_insertable_impl_type<_Alloc> = _Alloc;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_copy_insertable {
    pub _address: u8,
}
#[test]
fn __bindgen_test_layout_std__Destroy_aux_instantiation_10368() {
    assert_eq!(::std::mem::size_of::<u8>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! ( u8 ) ));
    assert_eq!(::std::mem::align_of::<u8>() , 1usize , concat ! (
               "Alignment of template specialization: " , stringify ! ( u8 )
               ));
}
#[repr(C)]
#[derive(Debug)]
pub struct std__Temporary_buffer<_Tp> {
    pub _M_original_len: std__Temporary_buffer_size_type,
    pub _M_len: std__Temporary_buffer_size_type,
    pub _M_buffer: std__Temporary_buffer_pointer<_Tp>,
}
pub type std__Temporary_buffer_value_type<_Tp> = _Tp;
pub type std__Temporary_buffer_pointer<_Tp> =
    *mut std__Temporary_buffer_value_type<_Tp>;
pub type std__Temporary_buffer_iterator<_Tp> =
    std__Temporary_buffer_pointer<_Tp>;
pub type std__Temporary_buffer_size_type = isize;
#[test]
fn __bindgen_test_layout_std___uninitialized_construct_buf_dispatch_instantiation_10390() {
    assert_eq!(::std::mem::size_of::<u8>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! ( u8 ) ));
    assert_eq!(::std::mem::align_of::<u8>() , 1usize , concat ! (
               "Alignment of template specialization: " , stringify ! ( u8 )
               ));
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum std_float_round_style {
    round_indeterminate = -1,
    round_toward_zero = 0,
    round_to_nearest = 1,
    round_toward_infinity = 2,
    round_toward_neg_infinity = 3,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum std_float_denorm_style {
    denorm_indeterminate = -1,
    denorm_absent = 0,
    denorm_present = 1,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct std___numeric_limits_base {
    pub _address: u8,
}
pub const std___numeric_limits_base_is_specialized: bool = false;
pub const std___numeric_limits_base_digits: ::std::os::raw::c_int = 0;
pub const std___numeric_limits_base_digits10: ::std::os::raw::c_int = 0;
pub const std___numeric_limits_base_max_digits10: ::std::os::raw::c_int = 0;
pub const std___numeric_limits_base_is_signed: bool = false;
pub const std___numeric_limits_base_is_integer: bool = false;
pub const std___numeric_limits_base_is_exact: bool = false;
pub const std___numeric_limits_base_radix: ::std::os::raw::c_int = 0;
pub const std___numeric_limits_base_min_exponent: ::std::os::raw::c_int = 0;
pub const std___numeric_limits_base_min_exponent10: ::std::os::raw::c_int = 0;
pub const std___numeric_limits_base_max_exponent: ::std::os::raw::c_int = 0;
pub const std___numeric_limits_base_max_exponent10: ::std::os::raw::c_int = 0;
pub const std___numeric_limits_base_has_infinity: bool = false;
pub const std___numeric_limits_base_has_quiet_NaN: bool = false;
pub const std___numeric_limits_base_has_signaling_NaN: bool = false;
extern "C" {
    #[link_name =
          "?has_denorm@__numeric_limits_base@std@@2W4float_denorm_style@2@B"]
    pub static std___numeric_limits_base_has_denorm: std_float_denorm_style;
}
pub const std___numeric_limits_base_has_denorm_loss: bool = false;
pub const std___numeric_limits_base_is_iec559: bool = false;
pub const std___numeric_limits_base_is_bounded: bool = false;
pub const std___numeric_limits_base_is_modulo: bool = false;
pub const std___numeric_limits_base_traps: bool = false;
pub const std___numeric_limits_base_tinyness_before: bool = false;
extern "C" {
    #[link_name =
          "?round_style@__numeric_limits_base@std@@2W4float_round_style@2@B"]
    pub static std___numeric_limits_base_round_style: std_float_round_style;
}
#[test]
fn bindgen_test_layout_std___numeric_limits_base() {
    assert_eq!(::std::mem::size_of::<std___numeric_limits_base>() , 1usize ,
               concat ! (
               "Size of: " , stringify ! ( std___numeric_limits_base ) ));
    assert_eq! (::std::mem::align_of::<std___numeric_limits_base>() , 1usize ,
                concat ! (
                "Alignment of " , stringify ! ( std___numeric_limits_base )
                ));
}
impl Clone for std___numeric_limits_base {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_numeric_limits {
    pub _address: u8,
}
#[test]
fn __bindgen_test_layout_std_numeric_limits_instantiation_12903() {
    assert_eq!(::std::mem::size_of::<std_numeric_limits>() , 1usize , concat !
               (
               "Size of template specialization: " , stringify ! (
               std_numeric_limits ) ));
    assert_eq!(::std::mem::align_of::<std_numeric_limits>() , 1usize , concat
               ! (
               "Alignment of template specialization: " , stringify ! (
               std_numeric_limits ) ));
}
#[test]
fn __bindgen_test_layout_std_numeric_limits_instantiation_12907() {
    assert_eq!(::std::mem::size_of::<std_numeric_limits>() , 1usize , concat !
               (
               "Size of template specialization: " , stringify ! (
               std_numeric_limits ) ));
    assert_eq!(::std::mem::align_of::<std_numeric_limits>() , 1usize , concat
               ! (
               "Alignment of template specialization: " , stringify ! (
               std_numeric_limits ) ));
}
#[test]
fn __bindgen_test_layout_std_numeric_limits_instantiation_12911() {
    assert_eq!(::std::mem::size_of::<std_numeric_limits>() , 1usize , concat !
               (
               "Size of template specialization: " , stringify ! (
               std_numeric_limits ) ));
    assert_eq!(::std::mem::align_of::<std_numeric_limits>() , 1usize , concat
               ! (
               "Alignment of template specialization: " , stringify ! (
               std_numeric_limits ) ));
}
#[test]
fn __bindgen_test_layout_std_numeric_limits_instantiation_12915() {
    assert_eq!(::std::mem::size_of::<std_numeric_limits>() , 1usize , concat !
               (
               "Size of template specialization: " , stringify ! (
               std_numeric_limits ) ));
    assert_eq!(::std::mem::align_of::<std_numeric_limits>() , 1usize , concat
               ! (
               "Alignment of template specialization: " , stringify ! (
               std_numeric_limits ) ));
}
#[test]
fn __bindgen_test_layout_std_numeric_limits_instantiation_12919() {
    assert_eq!(::std::mem::size_of::<std_numeric_limits>() , 1usize , concat !
               (
               "Size of template specialization: " , stringify ! (
               std_numeric_limits ) ));
    assert_eq!(::std::mem::align_of::<std_numeric_limits>() , 1usize , concat
               ! (
               "Alignment of template specialization: " , stringify ! (
               std_numeric_limits ) ));
}
#[test]
fn __bindgen_test_layout_std_numeric_limits_instantiation_12923() {
    assert_eq!(::std::mem::size_of::<std_numeric_limits>() , 1usize , concat !
               (
               "Size of template specialization: " , stringify ! (
               std_numeric_limits ) ));
    assert_eq!(::std::mem::align_of::<std_numeric_limits>() , 1usize , concat
               ! (
               "Alignment of template specialization: " , stringify ! (
               std_numeric_limits ) ));
}
#[test]
fn __bindgen_test_layout_std_numeric_limits_instantiation_12927() {
    assert_eq!(::std::mem::size_of::<std_numeric_limits>() , 1usize , concat !
               (
               "Size of template specialization: " , stringify ! (
               std_numeric_limits ) ));
    assert_eq!(::std::mem::align_of::<std_numeric_limits>() , 1usize , concat
               ! (
               "Alignment of template specialization: " , stringify ! (
               std_numeric_limits ) ));
}
#[test]
fn __bindgen_test_layout_std_numeric_limits_instantiation_12931() {
    assert_eq!(::std::mem::size_of::<std_numeric_limits>() , 1usize , concat !
               (
               "Size of template specialization: " , stringify ! (
               std_numeric_limits ) ));
    assert_eq!(::std::mem::align_of::<std_numeric_limits>() , 1usize , concat
               ! (
               "Alignment of template specialization: " , stringify ! (
               std_numeric_limits ) ));
}
#[test]
fn __bindgen_test_layout_std_numeric_limits_instantiation_12935() {
    assert_eq!(::std::mem::size_of::<std_numeric_limits>() , 1usize , concat !
               (
               "Size of template specialization: " , stringify ! (
               std_numeric_limits ) ));
    assert_eq!(::std::mem::align_of::<std_numeric_limits>() , 1usize , concat
               ! (
               "Alignment of template specialization: " , stringify ! (
               std_numeric_limits ) ));
}
#[test]
fn __bindgen_test_layout_std_numeric_limits_instantiation_12939() {
    assert_eq!(::std::mem::size_of::<std_numeric_limits>() , 1usize , concat !
               (
               "Size of template specialization: " , stringify ! (
               std_numeric_limits ) ));
    assert_eq!(::std::mem::align_of::<std_numeric_limits>() , 1usize , concat
               ! (
               "Alignment of template specialization: " , stringify ! (
               std_numeric_limits ) ));
}
#[test]
fn __bindgen_test_layout_std_numeric_limits_instantiation_12943() {
    assert_eq!(::std::mem::size_of::<std_numeric_limits>() , 1usize , concat !
               (
               "Size of template specialization: " , stringify ! (
               std_numeric_limits ) ));
    assert_eq!(::std::mem::align_of::<std_numeric_limits>() , 1usize , concat
               ! (
               "Alignment of template specialization: " , stringify ! (
               std_numeric_limits ) ));
}
#[test]
fn __bindgen_test_layout_std_numeric_limits_instantiation_12947() {
    assert_eq!(::std::mem::size_of::<std_numeric_limits>() , 1usize , concat !
               (
               "Size of template specialization: " , stringify ! (
               std_numeric_limits ) ));
    assert_eq!(::std::mem::align_of::<std_numeric_limits>() , 1usize , concat
               ! (
               "Alignment of template specialization: " , stringify ! (
               std_numeric_limits ) ));
}
#[test]
fn __bindgen_test_layout_std_numeric_limits_instantiation_12951() {
    assert_eq!(::std::mem::size_of::<std_numeric_limits>() , 1usize , concat !
               (
               "Size of template specialization: " , stringify ! (
               std_numeric_limits ) ));
    assert_eq!(::std::mem::align_of::<std_numeric_limits>() , 1usize , concat
               ! (
               "Alignment of template specialization: " , stringify ! (
               std_numeric_limits ) ));
}
#[test]
fn __bindgen_test_layout_std_numeric_limits_instantiation_12955() {
    assert_eq!(::std::mem::size_of::<std_numeric_limits>() , 1usize , concat !
               (
               "Size of template specialization: " , stringify ! (
               std_numeric_limits ) ));
    assert_eq!(::std::mem::align_of::<std_numeric_limits>() , 1usize , concat
               ! (
               "Alignment of template specialization: " , stringify ! (
               std_numeric_limits ) ));
}
#[test]
fn __bindgen_test_layout_std_numeric_limits_instantiation_12959() {
    assert_eq!(::std::mem::size_of::<std_numeric_limits>() , 1usize , concat !
               (
               "Size of template specialization: " , stringify ! (
               std_numeric_limits ) ));
    assert_eq!(::std::mem::align_of::<std_numeric_limits>() , 1usize , concat
               ! (
               "Alignment of template specialization: " , stringify ! (
               std_numeric_limits ) ));
}
#[test]
fn __bindgen_test_layout_std_numeric_limits_instantiation_12963() {
    assert_eq!(::std::mem::size_of::<std_numeric_limits>() , 1usize , concat !
               (
               "Size of template specialization: " , stringify ! (
               std_numeric_limits ) ));
    assert_eq!(::std::mem::align_of::<std_numeric_limits>() , 1usize , concat
               ! (
               "Alignment of template specialization: " , stringify ! (
               std_numeric_limits ) ));
}
#[test]
fn __bindgen_test_layout_std_numeric_limits_instantiation_12967() {
    assert_eq!(::std::mem::size_of::<std_numeric_limits>() , 1usize , concat !
               (
               "Size of template specialization: " , stringify ! (
               std_numeric_limits ) ));
    assert_eq!(::std::mem::align_of::<std_numeric_limits>() , 1usize , concat
               ! (
               "Alignment of template specialization: " , stringify ! (
               std_numeric_limits ) ));
}
#[test]
fn __bindgen_test_layout_std_numeric_limits_instantiation_12971() {
    assert_eq!(::std::mem::size_of::<std_numeric_limits>() , 1usize , concat !
               (
               "Size of template specialization: " , stringify ! (
               std_numeric_limits ) ));
    assert_eq!(::std::mem::align_of::<std_numeric_limits>() , 1usize , concat
               ! (
               "Alignment of template specialization: " , stringify ! (
               std_numeric_limits ) ));
}
#[test]
fn __bindgen_test_layout_std___uninitialized_copy_instantiation_12976() {
    assert_eq!(::std::mem::size_of::<u8>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! ( u8 ) ));
    assert_eq!(::std::mem::align_of::<u8>() , 1usize , concat ! (
               "Alignment of template specialization: " , stringify ! ( u8 )
               ));
}
#[test]
fn __bindgen_test_layout_std___uninitialized_fill_instantiation_12980() {
    assert_eq!(::std::mem::size_of::<u8>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! ( u8 ) ));
    assert_eq!(::std::mem::align_of::<u8>() , 1usize , concat ! (
               "Alignment of template specialization: " , stringify ! ( u8 )
               ));
}
#[test]
fn __bindgen_test_layout_std___uninitialized_fill_n_instantiation_12984() {
    assert_eq!(::std::mem::size_of::<u8>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! ( u8 ) ));
    assert_eq!(::std::mem::align_of::<u8>() , 1usize , concat ! (
               "Alignment of template specialization: " , stringify ! ( u8 )
               ));
}
#[test]
fn __bindgen_test_layout_std___uninitialized_default_1_instantiation_13000() {
    assert_eq!(::std::mem::size_of::<u8>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! ( u8 ) ));
    assert_eq!(::std::mem::align_of::<u8>() , 1usize , concat ! (
               "Alignment of template specialization: " , stringify ! ( u8 )
               ));
}
#[test]
fn __bindgen_test_layout_std___uninitialized_default_n_1_instantiation_13003() {
    assert_eq!(::std::mem::size_of::<u8>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! ( u8 ) ));
    assert_eq!(::std::mem::align_of::<u8>() , 1usize , concat ! (
               "Alignment of template specialization: " , stringify ! ( u8 )
               ));
}
#[repr(C)]
#[derive(Debug)]
pub struct std__Vector_base {
    pub _M_impl: std__Vector_base__Vector_impl,
}
pub type std__Vector_base__Tp_alloc_type = __gnu_cxx___alloc_traits;
pub type std__Vector_base_pointer = __gnu_cxx___alloc_traits;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Vector_base__Vector_impl {
    pub _M_start: std__Vector_base_pointer,
    pub _M_finish: std__Vector_base_pointer,
    pub _M_end_of_storage: std__Vector_base_pointer,
}
pub type std__Vector_base_allocator_type<_Alloc> = _Alloc;
#[repr(C)]
#[derive(Debug)]
pub struct std_vector {
    pub _base: std__Vector_base,
}
pub type std_vector__Alloc_value_type = [u8; 0usize];
pub type std_vector__Base = std__Vector_base;
pub type std_vector__Tp_alloc_type = std_vector__Base;
pub type std_vector__Alloc_traits = __gnu_cxx___alloc_traits;
pub type std_vector_value_type<_Tp> = _Tp;
pub type std_vector_pointer = std_vector__Base;
pub type std_vector_const_pointer = std_vector__Alloc_traits;
pub type std_vector_reference = std_vector__Alloc_traits;
pub type std_vector_const_reference = std_vector__Alloc_traits;
pub type std_vector_iterator =
    __gnu_cxx___normal_iterator<std_vector_pointer>;
pub type std_vector_const_iterator =
    __gnu_cxx___normal_iterator<std_vector_const_pointer>;
pub type std_vector_const_reverse_iterator =
    std_reverse_iterator<std_vector_const_iterator>;
pub type std_vector_reverse_iterator =
    std_reverse_iterator<std_vector_iterator>;
pub type std_vector_size_type = usize;
pub type std_vector_difference_type = isize;
pub type std_vector_allocator_type<_Alloc> = _Alloc;
pub type std__Bit_type = ::std::os::raw::c_ulong;
pub const _S_word_bit: std__bindgen_ty_1 = std__bindgen_ty_1::_S_word_bit;
#[repr(i32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum std__bindgen_ty_1 { _S_word_bit = 32, }
#[repr(C)]
#[derive(Debug, Copy)]
pub struct std__Bit_reference {
    pub _M_p: *mut std__Bit_type,
    pub _M_mask: std__Bit_type,
}
#[test]
fn bindgen_test_layout_std__Bit_reference() {
    assert_eq!(::std::mem::size_of::<std__Bit_reference>() , 16usize , concat
               ! ( "Size of: " , stringify ! ( std__Bit_reference ) ));
    assert_eq! (::std::mem::align_of::<std__Bit_reference>() , 8usize , concat
                ! ( "Alignment of " , stringify ! ( std__Bit_reference ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const std__Bit_reference ) ) . _M_p as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( std__Bit_reference ) ,
                "::" , stringify ! ( _M_p ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const std__Bit_reference ) ) . _M_mask as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( std__Bit_reference ) ,
                "::" , stringify ! ( _M_mask ) ));
}
impl Clone for std__Bit_reference {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct std__Bit_iterator_base {
    pub _M_p: *mut std__Bit_type,
    pub _M_offset: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_std__Bit_iterator_base() {
    assert_eq!(::std::mem::size_of::<std__Bit_iterator_base>() , 16usize ,
               concat ! ( "Size of: " , stringify ! ( std__Bit_iterator_base )
               ));
    assert_eq! (::std::mem::align_of::<std__Bit_iterator_base>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( std__Bit_iterator_base ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const std__Bit_iterator_base ) ) . _M_p as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( std__Bit_iterator_base
                ) , "::" , stringify ! ( _M_p ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const std__Bit_iterator_base ) ) . _M_offset as
                * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( std__Bit_iterator_base
                ) , "::" , stringify ! ( _M_offset ) ));
}
impl Clone for std__Bit_iterator_base {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct std__Bit_iterator {
    pub _base: std__Bit_iterator_base,
}
pub type std__Bit_iterator_reference = std__Bit_reference;
pub type std__Bit_iterator_pointer = *mut std__Bit_reference;
pub type std__Bit_iterator_iterator = std__Bit_iterator;
#[test]
fn bindgen_test_layout_std__Bit_iterator() {
    assert_eq!(::std::mem::size_of::<std__Bit_iterator>() , 16usize , concat !
               ( "Size of: " , stringify ! ( std__Bit_iterator ) ));
    assert_eq! (::std::mem::align_of::<std__Bit_iterator>() , 8usize , concat
                ! ( "Alignment of " , stringify ! ( std__Bit_iterator ) ));
}
impl Clone for std__Bit_iterator {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct std__Bit_const_iterator {
    pub _base: std__Bit_iterator_base,
}
pub type std__Bit_const_iterator_reference = bool;
pub type std__Bit_const_iterator_const_reference = bool;
pub type std__Bit_const_iterator_pointer = *const bool;
pub type std__Bit_const_iterator_const_iterator = std__Bit_const_iterator;
#[test]
fn bindgen_test_layout_std__Bit_const_iterator() {
    assert_eq!(::std::mem::size_of::<std__Bit_const_iterator>() , 16usize ,
               concat ! (
               "Size of: " , stringify ! ( std__Bit_const_iterator ) ));
    assert_eq! (::std::mem::align_of::<std__Bit_const_iterator>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( std__Bit_const_iterator ) ));
}
impl Clone for std__Bit_const_iterator {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
pub struct std__Bvector_base {
    pub _M_impl: std__Bvector_base__Bvector_impl,
}
pub type std__Bvector_base__Bit_alloc_type = [u8; 0usize];
#[repr(C)]
pub struct std__Bvector_base__Bvector_impl {
    pub _M_start: std__Bit_iterator,
    pub _M_finish: std__Bit_iterator,
    pub _M_end_of_storage: *mut std__Bit_type,
}
pub type std__Bvector_base_allocator_type<_Alloc> = _Alloc;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___detail__Adaptor<_Engine> {
    pub _M_g: *mut _Engine,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct std___detail__List_node_base {
    pub _M_next: *mut std___detail__List_node_base,
    pub _M_prev: *mut std___detail__List_node_base,
}
#[test]
fn bindgen_test_layout_std___detail__List_node_base() {
    assert_eq!(::std::mem::size_of::<std___detail__List_node_base>() , 16usize
               , concat ! (
               "Size of: " , stringify ! ( std___detail__List_node_base ) ));
    assert_eq! (::std::mem::align_of::<std___detail__List_node_base>() ,
                8usize , concat ! (
                "Alignment of " , stringify ! ( std___detail__List_node_base )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const std___detail__List_node_base ) ) .
                _M_next as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                std___detail__List_node_base ) , "::" , stringify ! ( _M_next
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const std___detail__List_node_base ) ) .
                _M_prev as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                std___detail__List_node_base ) , "::" , stringify ! ( _M_prev
                ) ));
}
extern "C" {
    #[link_name = "?swap@_List_node_base@__detail@std@@SAXAEAU123@0@Z"]
    pub fn std___detail__List_node_base_swap(__x:
                                                 *mut std___detail__List_node_base,
                                             __y:
                                                 *mut std___detail__List_node_base);
}
extern "C" {
    #[link_name =
          "?_M_transfer@_List_node_base@__detail@std@@QEAAXQEAU123@0@Z"]
    pub fn std___detail__List_node_base__M_transfer(this:
                                                        *mut std___detail__List_node_base,
                                                    __first:
                                                        *const std___detail__List_node_base,
                                                    __last:
                                                        *const std___detail__List_node_base);
}
extern "C" {
    #[link_name = "?_M_reverse@_List_node_base@__detail@std@@QEAAXXZ"]
    pub fn std___detail__List_node_base__M_reverse(this:
                                                       *mut std___detail__List_node_base);
}
extern "C" {
    #[link_name = "?_M_hook@_List_node_base@__detail@std@@QEAAXQEAU123@@Z"]
    pub fn std___detail__List_node_base__M_hook(this:
                                                    *mut std___detail__List_node_base,
                                                __position:
                                                    *const std___detail__List_node_base);
}
extern "C" {
    #[link_name = "?_M_unhook@_List_node_base@__detail@std@@QEAAXXZ"]
    pub fn std___detail__List_node_base__M_unhook(this:
                                                      *mut std___detail__List_node_base);
}
impl Clone for std___detail__List_node_base {
    fn clone(&self) -> Self { *self }
}
impl std___detail__List_node_base {
    #[inline]
    pub unsafe fn swap(__x: *mut std___detail__List_node_base,
                       __y: *mut std___detail__List_node_base) {
        std___detail__List_node_base_swap(__x, __y)
    }
    #[inline]
    pub unsafe fn _M_transfer(&mut self,
                              __first: *const std___detail__List_node_base,
                              __last: *const std___detail__List_node_base) {
        std___detail__List_node_base__M_transfer(self, __first, __last)
    }
    #[inline]
    pub unsafe fn _M_reverse(&mut self) {
        std___detail__List_node_base__M_reverse(self)
    }
    #[inline]
    pub unsafe fn _M_hook(&mut self,
                          __position: *const std___detail__List_node_base) {
        std___detail__List_node_base__M_hook(self, __position)
    }
    #[inline]
    pub unsafe fn _M_unhook(&mut self) {
        std___detail__List_node_base__M_unhook(self)
    }
}
pub type std_minstd_rand0 = u8;
pub type std_minstd_rand = u8;
pub type std_mt19937 = [u64; 313usize];
pub type std_mt19937_64 = u8;
pub type std_ranlux24_base = u8;
pub type std_ranlux48_base = u8;
pub type std_ranlux24 = u8;
pub type std_ranlux48 = u8;
pub type std_knuth_b = u8;
pub type std_default_random_engine = std_minstd_rand0;
#[repr(C)]
pub struct std_random_device {
    pub __bindgen_anon_1: std_random_device__bindgen_ty_1,
}
pub type std_random_device_result_type = ::std::os::raw::c_uint;
#[repr(C)]
pub union std_random_device__bindgen_ty_1 {
    pub _M_file: *mut ::std::os::raw::c_void,
    pub _M_mt: std_mt19937,
}
#[test]
fn bindgen_test_layout_std_random_device__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<std_random_device__bindgen_ty_1>() ,
               2504usize , concat ! (
               "Size of: " , stringify ! ( std_random_device__bindgen_ty_1 )
               ));
    assert_eq! (::std::mem::align_of::<std_random_device__bindgen_ty_1>() ,
                8usize , concat ! (
                "Alignment of " , stringify ! (
                std_random_device__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const std_random_device__bindgen_ty_1 ) ) .
                _M_file as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                std_random_device__bindgen_ty_1 ) , "::" , stringify ! (
                _M_file ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const std_random_device__bindgen_ty_1 ) ) .
                _M_mt as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                std_random_device__bindgen_ty_1 ) , "::" , stringify ! ( _M_mt
                ) ));
}
#[test]
fn bindgen_test_layout_std_random_device() {
    assert_eq!(::std::mem::size_of::<std_random_device>() , 2504usize , concat
               ! ( "Size of: " , stringify ! ( std_random_device ) ));
    assert_eq! (::std::mem::align_of::<std_random_device>() , 8usize , concat
                ! ( "Alignment of " , stringify ! ( std_random_device ) ));
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_uniform_int_distribution<_IntType> {
    pub _M_param: std_uniform_int_distribution_param_type<_IntType>,
}
pub type std_uniform_int_distribution_result_type<_IntType> = _IntType;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_uniform_int_distribution_param_type<_IntType> {
    pub _M_a: _IntType,
    pub _M_b: _IntType,
}
pub type std_uniform_int_distribution_param_type_distribution_type<_IntType> =
    std_uniform_int_distribution<_IntType>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_uniform_real_distribution<_RealType> {
    pub _M_param: std_uniform_real_distribution_param_type<_RealType>,
}
pub type std_uniform_real_distribution_result_type<_RealType> = _RealType;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_uniform_real_distribution_param_type<_RealType> {
    pub _M_a: _RealType,
    pub _M_b: _RealType,
}
pub type std_uniform_real_distribution_param_type_distribution_type<_RealType>
    = std_uniform_real_distribution<_RealType>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_normal_distribution<_RealType> {
    pub _M_param: std_normal_distribution_param_type<_RealType>,
    pub _M_saved: std_normal_distribution_result_type<_RealType>,
    pub _M_saved_available: bool,
}
pub type std_normal_distribution_result_type<_RealType> = _RealType;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_normal_distribution_param_type<_RealType> {
    pub _M_mean: _RealType,
    pub _M_stddev: _RealType,
}
pub type std_normal_distribution_param_type_distribution_type<_RealType> =
    std_normal_distribution<_RealType>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_lognormal_distribution<_RealType> {
    pub _M_param: std_lognormal_distribution_param_type<_RealType>,
    pub _M_nd: std_normal_distribution<std_lognormal_distribution_result_type<_RealType>>,
}
pub type std_lognormal_distribution_result_type<_RealType> = _RealType;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_lognormal_distribution_param_type<_RealType> {
    pub _M_m: _RealType,
    pub _M_s: _RealType,
}
pub type std_lognormal_distribution_param_type_distribution_type<_RealType> =
    std_lognormal_distribution<_RealType>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_gamma_distribution<_RealType> {
    pub _M_param: std_gamma_distribution_param_type<_RealType>,
    pub _M_nd: std_normal_distribution<std_gamma_distribution_result_type<_RealType>>,
}
pub type std_gamma_distribution_result_type<_RealType> = _RealType;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_gamma_distribution_param_type<_RealType> {
    pub _M_alpha: _RealType,
    pub _M_beta: _RealType,
    pub _M_malpha: _RealType,
    pub _M_a2: _RealType,
}
pub type std_gamma_distribution_param_type_distribution_type<_RealType> =
    std_gamma_distribution<_RealType>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_chi_squared_distribution<_RealType> {
    pub _M_param: std_chi_squared_distribution_param_type<_RealType>,
    pub _M_gd: std_gamma_distribution<std_chi_squared_distribution_result_type<_RealType>>,
}
pub type std_chi_squared_distribution_result_type<_RealType> = _RealType;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_chi_squared_distribution_param_type<_RealType> {
    pub _M_n: _RealType,
}
pub type std_chi_squared_distribution_param_type_distribution_type<_RealType>
    = std_chi_squared_distribution<_RealType>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_cauchy_distribution<_RealType> {
    pub _M_param: std_cauchy_distribution_param_type<_RealType>,
}
pub type std_cauchy_distribution_result_type<_RealType> = _RealType;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_cauchy_distribution_param_type<_RealType> {
    pub _M_a: _RealType,
    pub _M_b: _RealType,
}
pub type std_cauchy_distribution_param_type_distribution_type<_RealType> =
    std_cauchy_distribution<_RealType>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_fisher_f_distribution<_RealType> {
    pub _M_param: std_fisher_f_distribution_param_type<_RealType>,
    pub _M_gd_x: std_gamma_distribution<std_fisher_f_distribution_result_type<_RealType>>,
    pub _M_gd_y: std_gamma_distribution<std_fisher_f_distribution_result_type<_RealType>>,
}
pub type std_fisher_f_distribution_result_type<_RealType> = _RealType;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_fisher_f_distribution_param_type<_RealType> {
    pub _M_m: _RealType,
    pub _M_n: _RealType,
}
pub type std_fisher_f_distribution_param_type_distribution_type<_RealType> =
    std_fisher_f_distribution<_RealType>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_student_t_distribution<_RealType> {
    pub _M_param: std_student_t_distribution_param_type<_RealType>,
    pub _M_nd: std_normal_distribution<std_student_t_distribution_result_type<_RealType>>,
    pub _M_gd: std_gamma_distribution<std_student_t_distribution_result_type<_RealType>>,
}
pub type std_student_t_distribution_result_type<_RealType> = _RealType;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_student_t_distribution_param_type<_RealType> {
    pub _M_n: _RealType,
}
pub type std_student_t_distribution_param_type_distribution_type<_RealType> =
    std_student_t_distribution<_RealType>;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct std_bernoulli_distribution {
    pub _M_param: std_bernoulli_distribution_param_type,
}
pub type std_bernoulli_distribution_result_type = bool;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct std_bernoulli_distribution_param_type {
    pub _M_p: f64,
}
pub type std_bernoulli_distribution_param_type_distribution_type =
    std_bernoulli_distribution;
#[test]
fn bindgen_test_layout_std_bernoulli_distribution_param_type() {
    assert_eq!(::std::mem::size_of::<std_bernoulli_distribution_param_type>()
               , 8usize , concat ! (
               "Size of: " , stringify ! (
               std_bernoulli_distribution_param_type ) ));
    assert_eq! (::std::mem::align_of::<std_bernoulli_distribution_param_type>()
                , 8usize , concat ! (
                "Alignment of " , stringify ! (
                std_bernoulli_distribution_param_type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const std_bernoulli_distribution_param_type ) )
                . _M_p as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                std_bernoulli_distribution_param_type ) , "::" , stringify ! (
                _M_p ) ));
}
impl Clone for std_bernoulli_distribution_param_type {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout_std_bernoulli_distribution() {
    assert_eq!(::std::mem::size_of::<std_bernoulli_distribution>() , 8usize ,
               concat ! (
               "Size of: " , stringify ! ( std_bernoulli_distribution ) ));
    assert_eq! (::std::mem::align_of::<std_bernoulli_distribution>() , 8usize
                , concat ! (
                "Alignment of " , stringify ! ( std_bernoulli_distribution )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const std_bernoulli_distribution ) ) . _M_param
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                std_bernoulli_distribution ) , "::" , stringify ! ( _M_param )
                ));
}
impl Clone for std_bernoulli_distribution {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_binomial_distribution<_IntType> {
    pub _M_param: std_binomial_distribution_param_type<_IntType>,
    pub _M_nd: std_normal_distribution<f64>,
}
pub type std_binomial_distribution_result_type<_IntType> = _IntType;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_binomial_distribution_param_type<_IntType> {
    pub _M_t: _IntType,
    pub _M_p: f64,
    pub _M_q: f64,
    pub _M_d1: f64,
    pub _M_d2: f64,
    pub _M_s1: f64,
    pub _M_s2: f64,
    pub _M_c: f64,
    pub _M_a1: f64,
    pub _M_a123: f64,
    pub _M_s: f64,
    pub _M_lf: f64,
    pub _M_lp1p: f64,
    pub _M_easy: bool,
}
pub type std_binomial_distribution_param_type_distribution_type<_IntType> =
    std_binomial_distribution<_IntType>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_geometric_distribution {
    pub _M_param: std_geometric_distribution_param_type,
}
pub type std_geometric_distribution_result_type<_IntType> = _IntType;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_geometric_distribution_param_type {
    pub _M_p: f64,
    pub _M_log_1_p: f64,
}
pub type std_geometric_distribution_param_type_distribution_type =
    std_geometric_distribution;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_negative_binomial_distribution<_IntType> {
    pub _M_param: std_negative_binomial_distribution_param_type<_IntType>,
    pub _M_gd: std_gamma_distribution<f64>,
}
pub type std_negative_binomial_distribution_result_type<_IntType> = _IntType;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_negative_binomial_distribution_param_type<_IntType> {
    pub _M_k: _IntType,
    pub _M_p: f64,
}
pub type std_negative_binomial_distribution_param_type_distribution_type<_IntType>
    = std_negative_binomial_distribution<_IntType>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_poisson_distribution {
    pub _M_param: std_poisson_distribution_param_type,
    pub _M_nd: std_normal_distribution<f64>,
}
pub type std_poisson_distribution_result_type<_IntType> = _IntType;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_poisson_distribution_param_type {
    pub _M_mean: f64,
    pub _M_lm_thr: f64,
    pub _M_lfm: f64,
    pub _M_sm: f64,
    pub _M_d: f64,
    pub _M_scx: f64,
    pub _M_1cx: f64,
    pub _M_c2b: f64,
    pub _M_cb: f64,
}
pub type std_poisson_distribution_param_type_distribution_type =
    std_poisson_distribution;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_exponential_distribution<_RealType> {
    pub _M_param: std_exponential_distribution_param_type<_RealType>,
}
pub type std_exponential_distribution_result_type<_RealType> = _RealType;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_exponential_distribution_param_type<_RealType> {
    pub _M_lambda: _RealType,
}
pub type std_exponential_distribution_param_type_distribution_type<_RealType>
    = std_exponential_distribution<_RealType>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_weibull_distribution<_RealType> {
    pub _M_param: std_weibull_distribution_param_type<_RealType>,
}
pub type std_weibull_distribution_result_type<_RealType> = _RealType;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_weibull_distribution_param_type<_RealType> {
    pub _M_a: _RealType,
    pub _M_b: _RealType,
}
pub type std_weibull_distribution_param_type_distribution_type<_RealType> =
    std_weibull_distribution<_RealType>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_extreme_value_distribution<_RealType> {
    pub _M_param: std_extreme_value_distribution_param_type<_RealType>,
}
pub type std_extreme_value_distribution_result_type<_RealType> = _RealType;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_extreme_value_distribution_param_type<_RealType> {
    pub _M_a: _RealType,
    pub _M_b: _RealType,
}
pub type std_extreme_value_distribution_param_type_distribution_type<_RealType>
    = std_extreme_value_distribution<_RealType>;
#[repr(C)]
#[derive(Debug)]
pub struct std_discrete_distribution {
    pub _M_param: std_discrete_distribution_param_type,
}
pub type std_discrete_distribution_result_type<_IntType> = _IntType;
#[repr(C)]
#[derive(Debug)]
pub struct std_discrete_distribution_param_type {
    pub _M_prob: std_vector,
    pub _M_cp: std_vector,
}
pub type std_discrete_distribution_param_type_distribution_type =
    std_discrete_distribution;
#[repr(C)]
#[derive(Debug)]
pub struct std_piecewise_constant_distribution {
    pub _M_param: std_piecewise_constant_distribution_param_type,
}
pub type std_piecewise_constant_distribution_result_type<_RealType> =
    _RealType;
#[repr(C)]
#[derive(Debug)]
pub struct std_piecewise_constant_distribution_param_type {
    pub _M_int: std_vector,
    pub _M_den: std_vector,
    pub _M_cp: std_vector,
}
pub type std_piecewise_constant_distribution_param_type_distribution_type =
    std_piecewise_constant_distribution;
#[repr(C)]
#[derive(Debug)]
pub struct std_piecewise_linear_distribution {
    pub _M_param: std_piecewise_linear_distribution_param_type,
}
pub type std_piecewise_linear_distribution_result_type<_RealType> = _RealType;
#[repr(C)]
#[derive(Debug)]
pub struct std_piecewise_linear_distribution_param_type {
    pub _M_int: std_vector,
    pub _M_den: std_vector,
    pub _M_cp: std_vector,
    pub _M_m: std_vector,
}
pub type std_piecewise_linear_distribution_param_type_distribution_type =
    std_piecewise_linear_distribution;
#[repr(C)]
#[derive(Debug)]
pub struct std_seed_seq {
    pub _M_v: std_vector,
}
pub type std_seed_seq_result_type = uint_least32_t;
#[test]
fn bindgen_test_layout_std_seed_seq() {
    assert_eq!(::std::mem::size_of::<std_seed_seq>() , 24usize , concat ! (
               "Size of: " , stringify ! ( std_seed_seq ) ));
    assert_eq! (::std::mem::align_of::<std_seed_seq>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( std_seed_seq ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const std_seed_seq ) ) . _M_v as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( std_seed_seq ) , "::" ,
                stringify ! ( _M_v ) ));
}
extern "C" {
    #[link_name = "multiplier"]
    pub static std_multiplier: _UIntType;
}
extern "C" {
    #[link_name = "increment"]
    pub static std_increment: _UIntType;
}
extern "C" {
    #[link_name = "modulus"]
    pub static std_modulus: _UIntType;
}
extern "C" {
    #[link_name = "default_seed"]
    pub static std_default_seed: _UIntType;
}
extern "C" {
    #[link_name = "word_size"]
    pub static std_word_size: usize;
}
extern "C" {
    #[link_name = "state_size"]
    pub static std_state_size: usize;
}
extern "C" {
    #[link_name = "shift_size"]
    pub static std_shift_size: usize;
}
extern "C" {
    #[link_name = "mask_bits"]
    pub static std_mask_bits: usize;
}
extern "C" {
    #[link_name = "xor_mask"]
    pub static std_xor_mask: _UIntType;
}
extern "C" {
    #[link_name = "tempering_u"]
    pub static std_tempering_u: usize;
}
extern "C" {
    #[link_name = "tempering_d"]
    pub static std_tempering_d: _UIntType;
}
extern "C" {
    #[link_name = "tempering_s"]
    pub static std_tempering_s: usize;
}
extern "C" {
    #[link_name = "tempering_b"]
    pub static std_tempering_b: _UIntType;
}
extern "C" {
    #[link_name = "tempering_t"]
    pub static std_tempering_t: usize;
}
extern "C" {
    #[link_name = "tempering_c"]
    pub static std_tempering_c: _UIntType;
}
extern "C" {
    #[link_name = "tempering_l"]
    pub static std_tempering_l: usize;
}
extern "C" {
    #[link_name = "initialization_multiplier"]
    pub static std_initialization_multiplier: _UIntType;
}
extern "C" {
    #[link_name = "short_lag"]
    pub static std_short_lag: usize;
}
extern "C" {
    #[link_name = "long_lag"]
    pub static std_long_lag: usize;
}
extern "C" {
    #[link_name = "block_size"]
    pub static std_block_size: usize;
}
extern "C" {
    #[link_name = "used_block"]
    pub static std_used_block: usize;
}
extern "C" {
    #[link_name = "table_size"]
    pub static std_table_size: usize;
}
pub const _S_threshold: std__bindgen_ty_2 = std__bindgen_ty_2::_S_threshold;
#[repr(i32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum std__bindgen_ty_2 { _S_threshold = 16, }
pub const _S_chunk_size: std__bindgen_ty_3 = std__bindgen_ty_3::_S_chunk_size;
#[repr(i32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum std__bindgen_ty_3 { _S_chunk_size = 7, }
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_raw_storage_iterator<_OutputIterator> {
    pub _M_iter: _OutputIterator,
}
#[repr(C)]
#[derive(Debug)]
pub struct std_bad_cast {
    pub _base: std_exception,
}
#[test]
fn bindgen_test_layout_std_bad_cast() {
    assert_eq!(::std::mem::size_of::<std_bad_cast>() , 8usize , concat ! (
               "Size of: " , stringify ! ( std_bad_cast ) ));
    assert_eq! (::std::mem::align_of::<std_bad_cast>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( std_bad_cast ) ));
}
#[repr(C)]
#[derive(Debug)]
pub struct std_bad_typeid {
    pub _base: std_exception,
}
#[test]
fn bindgen_test_layout_std_bad_typeid() {
    assert_eq!(::std::mem::size_of::<std_bad_typeid>() , 8usize , concat ! (
               "Size of: " , stringify ! ( std_bad_typeid ) ));
    assert_eq! (::std::mem::align_of::<std_bad_typeid>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( std_bad_typeid ) ));
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct std_allocator_arg_t {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std_allocator_arg_t() {
    assert_eq!(::std::mem::size_of::<std_allocator_arg_t>() , 1usize , concat
               ! ( "Size of: " , stringify ! ( std_allocator_arg_t ) ));
    assert_eq! (::std::mem::align_of::<std_allocator_arg_t>() , 1usize ,
                concat ! (
                "Alignment of " , stringify ! ( std_allocator_arg_t ) ));
}
impl Clone for std_allocator_arg_t {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    #[link_name = "?allocator_arg@std@@3Uallocator_arg_t@1@B"]
    pub static std_allocator_arg: std_allocator_arg_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_allocator_type_helper {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_allocator_type_helper__Wrap_type {
    pub _address: u8,
}
pub type std___has_allocator_type_helper_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_allocator_type {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___uses_allocator_arg {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct std___uses_alloc_base {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std___uses_alloc_base() {
    assert_eq!(::std::mem::size_of::<std___uses_alloc_base>() , 1usize ,
               concat ! ( "Size of: " , stringify ! ( std___uses_alloc_base )
               ));
    assert_eq! (::std::mem::align_of::<std___uses_alloc_base>() , 1usize ,
                concat ! (
                "Alignment of " , stringify ! ( std___uses_alloc_base ) ));
}
impl Clone for std___uses_alloc_base {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct std___uses_alloc0 {
    pub _M_a: std___uses_alloc0__Anything,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct std___uses_alloc0__Anything {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std___uses_alloc0__Anything() {
    assert_eq!(::std::mem::size_of::<std___uses_alloc0__Anything>() , 1usize ,
               concat ! (
               "Size of: " , stringify ! ( std___uses_alloc0__Anything ) ));
    assert_eq! (::std::mem::align_of::<std___uses_alloc0__Anything>() , 1usize
                , concat ! (
                "Alignment of " , stringify ! ( std___uses_alloc0__Anything )
                ));
}
impl Clone for std___uses_alloc0__Anything {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout_std___uses_alloc0() {
    assert_eq!(::std::mem::size_of::<std___uses_alloc0>() , 1usize , concat !
               ( "Size of: " , stringify ! ( std___uses_alloc0 ) ));
    assert_eq! (::std::mem::align_of::<std___uses_alloc0>() , 1usize , concat
                ! ( "Alignment of " , stringify ! ( std___uses_alloc0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const std___uses_alloc0 ) ) . _M_a as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( std___uses_alloc0 ) ,
                "::" , stringify ! ( _M_a ) ));
}
impl Clone for std___uses_alloc0 {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___uses_alloc1<_Alloc> {
    pub _M_a: *mut _Alloc,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___uses_alloc2<_Alloc> {
    pub _M_a: *mut _Alloc,
}
#[repr(C)]
pub struct std___uses_alloc_impl {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug)]
pub struct std_logic_error {
    pub _base: std_exception,
    pub _M_msg: std_string,
}
#[test]
fn bindgen_test_layout_std_logic_error() {
    assert_eq!(::std::mem::size_of::<std_logic_error>() , 16usize , concat ! (
               "Size of: " , stringify ! ( std_logic_error ) ));
    assert_eq! (::std::mem::align_of::<std_logic_error>() , 8usize , concat !
                ( "Alignment of " , stringify ! ( std_logic_error ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const std_logic_error ) ) . _M_msg as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( std_logic_error ) ,
                "::" , stringify ! ( _M_msg ) ));
}
extern "C" {
    #[link_name =
          "??0logic_error@std@@QEAA@AEBV?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@@1@@Z"]
    pub fn std_logic_error_logic_error(this: *mut std_logic_error,
                                       __arg: *const std_string);
}
impl std_logic_error {
    #[inline]
    pub unsafe fn new(__arg: *const std_string) -> Self {
        let mut __bindgen_tmp = ::std::mem::uninitialized();
        std_logic_error_logic_error(&mut __bindgen_tmp, __arg);
        __bindgen_tmp
    }
}
#[repr(C)]
#[derive(Debug)]
pub struct std_domain_error {
    pub _base: std_logic_error,
}
#[test]
fn bindgen_test_layout_std_domain_error() {
    assert_eq!(::std::mem::size_of::<std_domain_error>() , 16usize , concat !
               ( "Size of: " , stringify ! ( std_domain_error ) ));
    assert_eq! (::std::mem::align_of::<std_domain_error>() , 8usize , concat !
                ( "Alignment of " , stringify ! ( std_domain_error ) ));
}
extern "C" {
    #[link_name =
          "??0domain_error@std@@QEAA@AEBV?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@@1@@Z"]
    pub fn std_domain_error_domain_error(this: *mut std_domain_error,
                                         __arg: *const std_string);
}
impl std_domain_error {
    #[inline]
    pub unsafe fn new(__arg: *const std_string) -> Self {
        let mut __bindgen_tmp = ::std::mem::uninitialized();
        std_domain_error_domain_error(&mut __bindgen_tmp, __arg);
        __bindgen_tmp
    }
}
#[repr(C)]
#[derive(Debug)]
pub struct std_invalid_argument {
    pub _base: std_logic_error,
}
#[test]
fn bindgen_test_layout_std_invalid_argument() {
    assert_eq!(::std::mem::size_of::<std_invalid_argument>() , 16usize ,
               concat ! ( "Size of: " , stringify ! ( std_invalid_argument )
               ));
    assert_eq! (::std::mem::align_of::<std_invalid_argument>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( std_invalid_argument ) ));
}
extern "C" {
    #[link_name =
          "??0invalid_argument@std@@QEAA@AEBV?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@@1@@Z"]
    pub fn std_invalid_argument_invalid_argument(this:
                                                     *mut std_invalid_argument,
                                                 __arg: *const std_string);
}
impl std_invalid_argument {
    #[inline]
    pub unsafe fn new(__arg: *const std_string) -> Self {
        let mut __bindgen_tmp = ::std::mem::uninitialized();
        std_invalid_argument_invalid_argument(&mut __bindgen_tmp, __arg);
        __bindgen_tmp
    }
}
#[repr(C)]
#[derive(Debug)]
pub struct std_length_error {
    pub _base: std_logic_error,
}
#[test]
fn bindgen_test_layout_std_length_error() {
    assert_eq!(::std::mem::size_of::<std_length_error>() , 16usize , concat !
               ( "Size of: " , stringify ! ( std_length_error ) ));
    assert_eq! (::std::mem::align_of::<std_length_error>() , 8usize , concat !
                ( "Alignment of " , stringify ! ( std_length_error ) ));
}
extern "C" {
    #[link_name =
          "??0length_error@std@@QEAA@AEBV?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@@1@@Z"]
    pub fn std_length_error_length_error(this: *mut std_length_error,
                                         __arg: *const std_string);
}
impl std_length_error {
    #[inline]
    pub unsafe fn new(__arg: *const std_string) -> Self {
        let mut __bindgen_tmp = ::std::mem::uninitialized();
        std_length_error_length_error(&mut __bindgen_tmp, __arg);
        __bindgen_tmp
    }
}
#[repr(C)]
#[derive(Debug)]
pub struct std_out_of_range {
    pub _base: std_logic_error,
}
#[test]
fn bindgen_test_layout_std_out_of_range() {
    assert_eq!(::std::mem::size_of::<std_out_of_range>() , 16usize , concat !
               ( "Size of: " , stringify ! ( std_out_of_range ) ));
    assert_eq! (::std::mem::align_of::<std_out_of_range>() , 8usize , concat !
                ( "Alignment of " , stringify ! ( std_out_of_range ) ));
}
extern "C" {
    #[link_name =
          "??0out_of_range@std@@QEAA@AEBV?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@@1@@Z"]
    pub fn std_out_of_range_out_of_range(this: *mut std_out_of_range,
                                         __arg: *const std_string);
}
impl std_out_of_range {
    #[inline]
    pub unsafe fn new(__arg: *const std_string) -> Self {
        let mut __bindgen_tmp = ::std::mem::uninitialized();
        std_out_of_range_out_of_range(&mut __bindgen_tmp, __arg);
        __bindgen_tmp
    }
}
#[repr(C)]
#[derive(Debug)]
pub struct std_runtime_error {
    pub _base: std_exception,
    pub _M_msg: std_string,
}
#[test]
fn bindgen_test_layout_std_runtime_error() {
    assert_eq!(::std::mem::size_of::<std_runtime_error>() , 16usize , concat !
               ( "Size of: " , stringify ! ( std_runtime_error ) ));
    assert_eq! (::std::mem::align_of::<std_runtime_error>() , 8usize , concat
                ! ( "Alignment of " , stringify ! ( std_runtime_error ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const std_runtime_error ) ) . _M_msg as * const
                _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( std_runtime_error ) ,
                "::" , stringify ! ( _M_msg ) ));
}
extern "C" {
    #[link_name =
          "??0runtime_error@std@@QEAA@AEBV?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@@1@@Z"]
    pub fn std_runtime_error_runtime_error(this: *mut std_runtime_error,
                                           __arg: *const std_string);
}
impl std_runtime_error {
    #[inline]
    pub unsafe fn new(__arg: *const std_string) -> Self {
        let mut __bindgen_tmp = ::std::mem::uninitialized();
        std_runtime_error_runtime_error(&mut __bindgen_tmp, __arg);
        __bindgen_tmp
    }
}
#[repr(C)]
#[derive(Debug)]
pub struct std_range_error {
    pub _base: std_runtime_error,
}
#[test]
fn bindgen_test_layout_std_range_error() {
    assert_eq!(::std::mem::size_of::<std_range_error>() , 16usize , concat ! (
               "Size of: " , stringify ! ( std_range_error ) ));
    assert_eq! (::std::mem::align_of::<std_range_error>() , 8usize , concat !
                ( "Alignment of " , stringify ! ( std_range_error ) ));
}
extern "C" {
    #[link_name =
          "??0range_error@std@@QEAA@AEBV?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@@1@@Z"]
    pub fn std_range_error_range_error(this: *mut std_range_error,
                                       __arg: *const std_string);
}
impl std_range_error {
    #[inline]
    pub unsafe fn new(__arg: *const std_string) -> Self {
        let mut __bindgen_tmp = ::std::mem::uninitialized();
        std_range_error_range_error(&mut __bindgen_tmp, __arg);
        __bindgen_tmp
    }
}
#[repr(C)]
#[derive(Debug)]
pub struct std_overflow_error {
    pub _base: std_runtime_error,
}
#[test]
fn bindgen_test_layout_std_overflow_error() {
    assert_eq!(::std::mem::size_of::<std_overflow_error>() , 16usize , concat
               ! ( "Size of: " , stringify ! ( std_overflow_error ) ));
    assert_eq! (::std::mem::align_of::<std_overflow_error>() , 8usize , concat
                ! ( "Alignment of " , stringify ! ( std_overflow_error ) ));
}
extern "C" {
    #[link_name =
          "??0overflow_error@std@@QEAA@AEBV?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@@1@@Z"]
    pub fn std_overflow_error_overflow_error(this: *mut std_overflow_error,
                                             __arg: *const std_string);
}
impl std_overflow_error {
    #[inline]
    pub unsafe fn new(__arg: *const std_string) -> Self {
        let mut __bindgen_tmp = ::std::mem::uninitialized();
        std_overflow_error_overflow_error(&mut __bindgen_tmp, __arg);
        __bindgen_tmp
    }
}
#[repr(C)]
#[derive(Debug)]
pub struct std_underflow_error {
    pub _base: std_runtime_error,
}
#[test]
fn bindgen_test_layout_std_underflow_error() {
    assert_eq!(::std::mem::size_of::<std_underflow_error>() , 16usize , concat
               ! ( "Size of: " , stringify ! ( std_underflow_error ) ));
    assert_eq! (::std::mem::align_of::<std_underflow_error>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( std_underflow_error ) ));
}
extern "C" {
    #[link_name =
          "??0underflow_error@std@@QEAA@AEBV?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@@1@@Z"]
    pub fn std_underflow_error_underflow_error(this: *mut std_underflow_error,
                                               __arg: *const std_string);
}
impl std_underflow_error {
    #[inline]
    pub unsafe fn new(__arg: *const std_string) -> Self {
        let mut __bindgen_tmp = ::std::mem::uninitialized();
        std_underflow_error_underflow_error(&mut __bindgen_tmp, __arg);
        __bindgen_tmp
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___add_c_ref {
    pub _address: u8,
}
pub type std___add_c_ref_type<_Tp> = *mut _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___add_ref {
    pub _address: u8,
}
pub type std___add_ref_type<_Tp> = *mut _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___add_r_ref {
    pub _address: u8,
}
pub type std___add_r_ref_type<_Tp> = *mut _Tp;
#[repr(C)]
pub struct std___is_empty_non_tuple {
    pub _address: u8,
}
pub type std___empty_not_final = u8;
#[test]
fn __bindgen_test_layout_std_tuple_instantiation_15814() {
    assert_eq!(::std::mem::size_of::<std_tuple>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! ( std_tuple )
               ));
    assert_eq!(::std::mem::align_of::<std_tuple>() , 1usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std_tuple ) ));
}
#[repr(C)]
pub struct std___is_tuple_like_impl {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_tuple_like {
    pub _address: u8,
}
#[repr(C)]
pub struct std___do_make_tuple {
    pub _address: u8,
}
#[repr(C)]
pub struct std___make_tuple {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___combine_tuples {
    pub _address: u8,
}
#[test]
fn __bindgen_test_layout_std___combine_tuples_instantiation_15873() {
    assert_eq!(::std::mem::size_of::<std___combine_tuples>() , 1usize , concat
               ! (
               "Size of template specialization: " , stringify ! (
               std___combine_tuples ) ));
    assert_eq!(::std::mem::align_of::<std___combine_tuples>() , 1usize ,
               concat ! (
               "Alignment of template specialization: " , stringify ! (
               std___combine_tuples ) ));
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___tuple_cat_result {
    pub _address: u8,
}
pub type std___tuple_cat_result___type = std___combine_tuples;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___make_1st_indices {
    pub _address: u8,
}
#[test]
fn __bindgen_test_layout_std___make_1st_indices_instantiation_15883() {
    assert_eq!(::std::mem::size_of::<std___make_1st_indices>() , 1usize ,
               concat ! (
               "Size of template specialization: " , stringify ! (
               std___make_1st_indices ) ));
    assert_eq!(::std::mem::align_of::<std___make_1st_indices>() , 1usize ,
               concat ! (
               "Alignment of template specialization: " , stringify ! (
               std___make_1st_indices ) ));
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___tuple_concater {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct std__Swallow_assign {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std__Swallow_assign() {
    assert_eq!(::std::mem::size_of::<std__Swallow_assign>() , 1usize , concat
               ! ( "Size of: " , stringify ! ( std__Swallow_assign ) ));
    assert_eq! (::std::mem::align_of::<std__Swallow_assign>() , 1usize ,
                concat ! (
                "Alignment of " , stringify ! ( std__Swallow_assign ) ));
}
impl Clone for std__Swallow_assign {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    #[link_name = "?ignore@std@@3U_Swallow_assign@1@B"]
    pub static std_ignore: std__Swallow_assign;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Mem_fn {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_result_type_helper {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_result_type_helper__Wrap_type {
    pub _address: u8,
}
pub type std___has_result_type_helper_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_result_type {
    pub _address: u8,
}
#[repr(C)]
pub struct std__Weak_result_type_impl {
    pub _address: u8,
}
#[repr(C)]
pub struct std__Weak_result_type {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_argument_type_helper {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_argument_type_helper__Wrap_type {
    pub _address: u8,
}
pub type std___has_argument_type_helper_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_argument_type {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_first_argument_type_helper {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_first_argument_type_helper__Wrap_type {
    pub _address: u8,
}
pub type std___has_first_argument_type_helper_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_first_argument_type {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_second_argument_type_helper {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_second_argument_type_helper__Wrap_type {
    pub _address: u8,
}
pub type std___has_second_argument_type_helper_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___has_second_argument_type {
    pub _address: u8,
}
#[repr(C)]
pub struct std__Reference_wrapper_base {
    pub _address: u8,
}
#[repr(C)]
pub struct std__Pack {
    pub _address: u8,
}
pub type std__NotSame = std___not_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Maybe_unary_or_binary_function {
    pub _address: u8,
}
#[repr(C)]
pub struct std_is_bind_expression {
    pub _address: u8,
}
#[repr(C)]
pub struct std_is_placeholder {
    pub _address: u8,
}
extern "C" {
    #[link_name = "?_1@placeholders@std@@3U?$_Placeholder@$00@2@B"]
    pub static std_placeholders__1: u8;
}
extern "C" {
    #[link_name = "?_2@placeholders@std@@3U?$_Placeholder@$01@2@B"]
    pub static std_placeholders__2: u8;
}
extern "C" {
    #[link_name = "?_3@placeholders@std@@3U?$_Placeholder@$02@2@B"]
    pub static std_placeholders__3: u8;
}
extern "C" {
    #[link_name = "?_4@placeholders@std@@3U?$_Placeholder@$03@2@B"]
    pub static std_placeholders__4: u8;
}
extern "C" {
    #[link_name = "?_5@placeholders@std@@3U?$_Placeholder@$04@2@B"]
    pub static std_placeholders__5: u8;
}
extern "C" {
    #[link_name = "?_6@placeholders@std@@3U?$_Placeholder@$05@2@B"]
    pub static std_placeholders__6: u8;
}
extern "C" {
    #[link_name = "?_7@placeholders@std@@3U?$_Placeholder@$06@2@B"]
    pub static std_placeholders__7: u8;
}
extern "C" {
    #[link_name = "?_8@placeholders@std@@3U?$_Placeholder@$07@2@B"]
    pub static std_placeholders__8: u8;
}
extern "C" {
    #[link_name = "?_9@placeholders@std@@3U?$_Placeholder@$08@2@B"]
    pub static std_placeholders__9: u8;
}
extern "C" {
    #[link_name = "?_10@placeholders@std@@3U?$_Placeholder@$09@2@B"]
    pub static std_placeholders__10: u8;
}
extern "C" {
    #[link_name = "?_11@placeholders@std@@3U?$_Placeholder@$0L@@2@B"]
    pub static std_placeholders__11: u8;
}
extern "C" {
    #[link_name = "?_12@placeholders@std@@3U?$_Placeholder@$0M@@2@B"]
    pub static std_placeholders__12: u8;
}
extern "C" {
    #[link_name = "?_13@placeholders@std@@3U?$_Placeholder@$0N@@2@B"]
    pub static std_placeholders__13: u8;
}
extern "C" {
    #[link_name = "?_14@placeholders@std@@3U?$_Placeholder@$0O@@2@B"]
    pub static std_placeholders__14: u8;
}
extern "C" {
    #[link_name = "?_15@placeholders@std@@3U?$_Placeholder@$0P@@2@B"]
    pub static std_placeholders__15: u8;
}
extern "C" {
    #[link_name = "?_16@placeholders@std@@3U?$_Placeholder@$0BA@@2@B"]
    pub static std_placeholders__16: u8;
}
extern "C" {
    #[link_name = "?_17@placeholders@std@@3U?$_Placeholder@$0BB@@2@B"]
    pub static std_placeholders__17: u8;
}
extern "C" {
    #[link_name = "?_18@placeholders@std@@3U?$_Placeholder@$0BC@@2@B"]
    pub static std_placeholders__18: u8;
}
extern "C" {
    #[link_name = "?_19@placeholders@std@@3U?$_Placeholder@$0BD@@2@B"]
    pub static std_placeholders__19: u8;
}
extern "C" {
    #[link_name = "?_20@placeholders@std@@3U?$_Placeholder@$0BE@@2@B"]
    pub static std_placeholders__20: u8;
}
extern "C" {
    #[link_name = "?_21@placeholders@std@@3U?$_Placeholder@$0BF@@2@B"]
    pub static std_placeholders__21: u8;
}
extern "C" {
    #[link_name = "?_22@placeholders@std@@3U?$_Placeholder@$0BG@@2@B"]
    pub static std_placeholders__22: u8;
}
extern "C" {
    #[link_name = "?_23@placeholders@std@@3U?$_Placeholder@$0BH@@2@B"]
    pub static std_placeholders__23: u8;
}
extern "C" {
    #[link_name = "?_24@placeholders@std@@3U?$_Placeholder@$0BI@@2@B"]
    pub static std_placeholders__24: u8;
}
extern "C" {
    #[link_name = "?_25@placeholders@std@@3U?$_Placeholder@$0BJ@@2@B"]
    pub static std_placeholders__25: u8;
}
extern "C" {
    #[link_name = "?_26@placeholders@std@@3U?$_Placeholder@$0BK@@2@B"]
    pub static std_placeholders__26: u8;
}
extern "C" {
    #[link_name = "?_27@placeholders@std@@3U?$_Placeholder@$0BL@@2@B"]
    pub static std_placeholders__27: u8;
}
extern "C" {
    #[link_name = "?_28@placeholders@std@@3U?$_Placeholder@$0BM@@2@B"]
    pub static std_placeholders__28: u8;
}
extern "C" {
    #[link_name = "?_29@placeholders@std@@3U?$_Placeholder@$0BN@@2@B"]
    pub static std_placeholders__29: u8;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__No_tuple_element([u8; 0]);
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Maybe_wrap_member_pointer {
    pub _address: u8,
}
pub type std__Maybe_wrap_member_pointer_type<_Tp> = _Tp;
#[test]
fn __bindgen_test_layout_std__Maybe_wrap_member_pointer_instantiation_16166() {
    assert_eq!(::std::mem::size_of::<std__Maybe_wrap_member_pointer>() ,
               1usize , concat ! (
               "Size of template specialization: " , stringify ! (
               std__Maybe_wrap_member_pointer ) ));
    assert_eq!(::std::mem::align_of::<std__Maybe_wrap_member_pointer>() ,
               1usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std__Maybe_wrap_member_pointer ) ));
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Bind {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Bind_result {
    pub _address: u8,
}
pub type std___is_socketlike = std___or_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Bindres_helper {
    pub _address: u8,
}
pub type std__Bindres_helper___maybe_type = std__Maybe_wrap_member_pointer;
pub type std__Bindres_helper___functor_type =
    std__Bindres_helper___maybe_type;
pub type std__Bindres_helper_type = std__Bind_result;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Bind_simple {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Bind_simple_helper {
    pub _address: u8,
}
pub type std__Bind_simple_helper___maybe_type =
    std__Maybe_wrap_member_pointer;
pub type std__Bind_simple_helper___func_type =
    std__Bind_simple_helper___maybe_type;
pub type std__Bind_simple_helper___type = std__Bind_simple;
#[repr(C)]
#[derive(Debug)]
pub struct std_bad_function_call {
    pub _base: std_exception,
}
#[test]
fn bindgen_test_layout_std_bad_function_call() {
    assert_eq!(::std::mem::size_of::<std_bad_function_call>() , 8usize ,
               concat ! ( "Size of: " , stringify ! ( std_bad_function_call )
               ));
    assert_eq! (::std::mem::align_of::<std_bad_function_call>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( std_bad_function_call ) ));
}
#[repr(C)]
pub struct std___is_location_invariant {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Undefined_class([u8; 0]);
#[repr(C)]
#[derive(Copy)]
pub union std__Nocopy_types {
    pub _M_object: *mut ::std::os::raw::c_void,
    pub _M_const_object: *const ::std::os::raw::c_void,
    pub _M_function_pointer: ::std::option::Option<unsafe extern "C" fn()>,
    pub _M_member_pointer: ::std::option::Option<unsafe extern "C" fn()>,
}
#[test]
fn bindgen_test_layout_std__Nocopy_types() {
    assert_eq!(::std::mem::size_of::<std__Nocopy_types>() , 24usize , concat !
               ( "Size of: " , stringify ! ( std__Nocopy_types ) ));
    assert_eq! (::std::mem::align_of::<std__Nocopy_types>() , 8usize , concat
                ! ( "Alignment of " , stringify ! ( std__Nocopy_types ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const std__Nocopy_types ) ) . _M_object as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( std__Nocopy_types ) ,
                "::" , stringify ! ( _M_object ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const std__Nocopy_types ) ) . _M_const_object
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( std__Nocopy_types ) ,
                "::" , stringify ! ( _M_const_object ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const std__Nocopy_types ) ) .
                _M_function_pointer as * const _ as usize } , 0usize , concat
                ! (
                "Alignment of field: " , stringify ! ( std__Nocopy_types ) ,
                "::" , stringify ! ( _M_function_pointer ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const std__Nocopy_types ) ) . _M_member_pointer
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( std__Nocopy_types ) ,
                "::" , stringify ! ( _M_member_pointer ) ));
}
impl Clone for std__Nocopy_types {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub union std__Any_data {
    pub _M_unused: std__Nocopy_types,
    pub _M_pod_data: [::std::os::raw::c_char; 24usize],
}
#[test]
fn bindgen_test_layout_std__Any_data() {
    assert_eq!(::std::mem::size_of::<std__Any_data>() , 24usize , concat ! (
               "Size of: " , stringify ! ( std__Any_data ) ));
    assert_eq! (::std::mem::align_of::<std__Any_data>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( std__Any_data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const std__Any_data ) ) . _M_unused as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( std__Any_data ) , "::"
                , stringify ! ( _M_unused ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const std__Any_data ) ) . _M_pod_data as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( std__Any_data ) , "::"
                , stringify ! ( _M_pod_data ) ));
}
impl Clone for std__Any_data {
    fn clone(&self) -> Self { *self }
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum std__Manager_operation {
    __get_type_info = 0,
    __get_functor_ptr = 1,
    __clone_functor = 2,
    __destroy_functor = 3,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Simple_type_wrapper<_Tp> {
    pub __value: _Tp,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_function {
    pub _address: u8,
}
#[repr(C)]
pub struct std__Function_base {
    pub _M_functor: std__Any_data,
    pub _M_manager: std__Function_base__Manager_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Function_base__Base_manager {
    pub _address: u8,
}
pub type std__Function_base__Base_manager__Local_storage = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Function_base__Ref_manager {
    pub _address: u8,
}
pub type std__Function_base__Ref_manager__Base =
    std__Function_base__Base_manager;
pub type std__Function_base__Manager_type =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut std__Any_data,
                                               arg2: *const std__Any_data,
                                               arg3: std__Manager_operation)
                              -> bool>;
pub const std__Function_base__M_max_size: usize = 24;
pub const std__Function_base__M_max_align: usize = 8;
#[test]
fn bindgen_test_layout_std__Function_base() {
    assert_eq!(::std::mem::size_of::<std__Function_base>() , 32usize , concat
               ! ( "Size of: " , stringify ! ( std__Function_base ) ));
    assert_eq! (::std::mem::align_of::<std__Function_base>() , 8usize , concat
                ! ( "Alignment of " , stringify ! ( std__Function_base ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const std__Function_base ) ) . _M_functor as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( std__Function_base ) ,
                "::" , stringify ! ( _M_functor ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const std__Function_base ) ) . _M_manager as *
                const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( std__Function_base ) ,
                "::" , stringify ! ( _M_manager ) ));
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Function_handler {
    pub _address: u8,
}
pub type std___check_func_return_type = std___or_;
#[repr(C)]
#[derive(Debug)]
pub struct std_auto_ptr<_Tp> {
    pub _M_ptr: *mut _Tp,
}
pub type std_auto_ptr_element_type<_Tp> = _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_default_delete {
    pub _address: u8,
}
#[repr(C)]
pub struct std_unique_ptr {
    pub _M_t: std_unique_ptr___tuple_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_unique_ptr__Pointer {
    pub _address: u8,
}
pub type std_unique_ptr__Pointer__Del = std_remove_reference;
pub type std_unique_ptr__Pointer_type = std_unique_ptr__Pointer__Del;
pub type std_unique_ptr___tuple_type = std_tuple;
pub type std_unique_ptr_pointer = std_unique_ptr__Pointer;
pub type std_unique_ptr_element_type<_Tp> = _Tp;
pub type std_unique_ptr_deleter_type<_Dp> = _Dp;
#[repr(C)]
#[derive(Debug)]
pub struct std_bad_weak_ptr {
    pub _base: std_exception,
}
#[test]
fn bindgen_test_layout_std_bad_weak_ptr() {
    assert_eq!(::std::mem::size_of::<std_bad_weak_ptr>() , 8usize , concat ! (
               "Size of: " , stringify ! ( std_bad_weak_ptr ) ));
    assert_eq! (::std::mem::align_of::<std_bad_weak_ptr>() , 8usize , concat !
                ( "Alignment of " , stringify ! ( std_bad_weak_ptr ) ));
}
#[test]
fn __bindgen_test_layout_std__Mutex_base_instantiation_16443() {
    assert_eq!(::std::mem::size_of::<[u64; 2usize]>() , 16usize , concat ! (
               "Size of template specialization: " , stringify ! (
               [u64; 2usize] ) ));
    assert_eq!(::std::mem::align_of::<[u64; 2usize]>() , 8usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               [u64; 2usize] ) ));
}
#[repr(C)]
pub struct std_shared_ptr<_Tp> {
    pub _base: u8,
}
#[repr(C)]
pub struct std_weak_ptr<_Tp> {
    pub _base: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_owner_less {
    pub _address: u8,
}
#[repr(C)]
pub struct std_enable_shared_from_this<_Tp> {
    pub _M_weak_this: std_weak_ptr<_Tp>,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct std__Sp_make_shared_tag {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std__Sp_make_shared_tag() {
    assert_eq!(::std::mem::size_of::<std__Sp_make_shared_tag>() , 1usize ,
               concat ! (
               "Size of: " , stringify ! ( std__Sp_make_shared_tag ) ));
    assert_eq! (::std::mem::align_of::<std__Sp_make_shared_tag>() , 1usize ,
                concat ! (
                "Alignment of " , stringify ! ( std__Sp_make_shared_tag ) ));
}
impl Clone for std__Sp_make_shared_tag {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Sp_less {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Sp_owner_less {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_auto_ptr_ref<_Tp1> {
    pub _M_ptr: *mut _Tp1,
}
#[test]
fn __bindgen_test_layout_std_auto_ptr_instantiation_16840() {
    assert_eq!(::std::mem::size_of::<std_auto_ptr<::std::os::raw::c_void>>() ,
               1usize , concat ! (
               "Size of template specialization: " , stringify ! (
               std_auto_ptr<::std::os::raw::c_void> ) ));
    assert_eq!(::std::mem::align_of::<std_auto_ptr<::std::os::raw::c_void>>()
               , 1usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std_auto_ptr<::std::os::raw::c_void> ) ));
}
extern "C" {
    #[link_name = "id"]
    pub static mut std_id: std_locale_id;
}
#[test]
fn __bindgen_test_layout_std_collate_instantiation_18357() {
    assert_eq!(::std::mem::size_of::<std_collate>() , 24usize , concat ! (
               "Size of template specialization: " , stringify ! ( std_collate
               ) ));
    assert_eq!(::std::mem::align_of::<std_collate>() , 8usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std_collate ) ));
}
#[test]
fn __bindgen_test_layout_std_collate_byname_instantiation_18361() {
    assert_eq!(::std::mem::size_of::<std_collate_byname>() , 24usize , concat
               ! (
               "Size of template specialization: " , stringify ! (
               std_collate_byname ) ));
    assert_eq!(::std::mem::align_of::<std_collate_byname>() , 8usize , concat
               ! (
               "Alignment of template specialization: " , stringify ! (
               std_collate_byname ) ));
}
#[test]
fn __bindgen_test_layout_std_collate_instantiation_18365() {
    assert_eq!(::std::mem::size_of::<std_collate>() , 24usize , concat ! (
               "Size of template specialization: " , stringify ! ( std_collate
               ) ));
    assert_eq!(::std::mem::align_of::<std_collate>() , 8usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std_collate ) ));
}
#[test]
fn __bindgen_test_layout_std_collate_byname_instantiation_18369() {
    assert_eq!(::std::mem::size_of::<std_collate_byname>() , 24usize , concat
               ! (
               "Size of template specialization: " , stringify ! (
               std_collate_byname ) ));
    assert_eq!(::std::mem::align_of::<std_collate_byname>() , 8usize , concat
               ! (
               "Alignment of template specialization: " , stringify ! (
               std_collate_byname ) ));
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum std__Ios_Fmtflags {
    _S_boolalpha = 1,
    _S_dec = 2,
    _S_fixed = 4,
    _S_hex = 8,
    _S_internal = 16,
    _S_left = 32,
    _S_oct = 64,
    _S_right = 128,
    _S_scientific = 256,
    _S_showbase = 512,
    _S_showpoint = 1024,
    _S_showpos = 2048,
    _S_skipws = 4096,
    _S_unitbuf = 8192,
    _S_uppercase = 16384,
    _S_adjustfield = 176,
    _S_basefield = 74,
    _S_floatfield = 260,
    _S_ios_fmtflags_end = 65536,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum std__Ios_Openmode {
    _S_app = 1,
    _S_ate = 2,
    _S_bin = 4,
    _S_in = 8,
    _S_out = 16,
    _S_trunc = 32,
    _S_ios_openmode_end = 65536,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum std__Ios_Iostate {
    _S_goodbit = 0,
    _S_badbit = 1,
    _S_eofbit = 2,
    _S_failbit = 4,
    _S_ios_iostate_end = 65536,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum std__Ios_Seekdir {
    _S_beg = 0,
    _S_cur = 1,
    _S_end = 2,
    _S_ios_seekdir_end = 65536,
}
extern "C" {
    #[link_name =
          "??$__copy_streambufs_eof@DU?$char_traits@D@std@@@std@@YA_JPEAV?$basic_streambuf@DU?$char_traits@D@std@@@0@0AEA_N@Z"]
    pub fn std___copy_streambufs_eof(__sbin:
                                         *mut std_basic_streambuf<::std::os::raw::c_char>,
                                     __sbout:
                                         *mut std_basic_streambuf<::std::os::raw::c_char>,
                                     __ineof: *mut bool) -> std_streamsize;
}
extern "C" {
    #[link_name =
          "??$__copy_streambufs_eof@_WU?$char_traits@_W@std@@@std@@YA_JPEAV?$basic_streambuf@_WU?$char_traits@_W@std@@@0@0AEA_N@Z"]
    pub fn std___copy_streambufs_eof1(__sbin: *mut std_basic_streambuf<u16>,
                                      __sbout: *mut std_basic_streambuf<u16>,
                                      __ineof: *mut bool) -> std_streamsize;
}
#[test]
fn __bindgen_test_layout_std_basic_streambuf_instantiation_18501() {
    assert_eq!(::std::mem::size_of::<std_basic_streambuf<::std::os::raw::c_char>>()
               , 64usize , concat ! (
               "Size of template specialization: " , stringify ! (
               std_basic_streambuf<::std::os::raw::c_char> ) ));
    assert_eq!(::std::mem::align_of::<std_basic_streambuf<::std::os::raw::c_char>>()
               , 8usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std_basic_streambuf<::std::os::raw::c_char> ) ));
}
#[test]
fn __bindgen_test_layout_std_basic_streambuf_instantiation_18506() {
    assert_eq!(::std::mem::size_of::<std_basic_streambuf<u16>>() , 64usize ,
               concat ! (
               "Size of template specialization: " , stringify ! (
               std_basic_streambuf<u16> ) ));
    assert_eq!(::std::mem::align_of::<std_basic_streambuf<u16>>() , 8usize ,
               concat ! (
               "Alignment of template specialization: " , stringify ! (
               std_basic_streambuf<u16> ) ));
}
extern "C" {
    #[link_name =
          "??$__convert_to_v@M@std@@YAXPEBDAEAMAEAW4_Ios_Iostate@0@AEBQEAH@Z"]
    pub fn std___convert_to_v(arg1: *const ::std::os::raw::c_char,
                              arg2: *mut f32, arg3: *mut std_ios_base_iostate,
                              arg4: *const std___c_locale);
}
extern "C" {
    #[link_name =
          "??$__convert_to_v@N@std@@YAXPEBDAEANAEAW4_Ios_Iostate@0@AEBQEAH@Z"]
    pub fn std___convert_to_v1(arg1: *const ::std::os::raw::c_char,
                               arg2: *mut f64,
                               arg3: *mut std_ios_base_iostate,
                               arg4: *const std___c_locale);
}
extern "C" {
    #[link_name =
          "??$__convert_to_v@O@std@@YAXPEBDAEAOAEAW4_Ios_Iostate@0@AEBQEAH@Z"]
    pub fn std___convert_to_v2(arg1: *const ::std::os::raw::c_char,
                               arg2: *mut f64,
                               arg3: *mut std_ios_base_iostate,
                               arg4: *const std___c_locale);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___pad {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug)]
pub struct std___ctype_abstract_base {
    pub _base: std_locale_facet,
}
pub type std___ctype_abstract_base_char_type<_CharT> = _CharT;
#[test]
fn __bindgen_test_layout_std_ctype_byname_instantiation_18602() {
    assert_eq!(::std::mem::size_of::<std_ctype_byname>() , 576usize , concat !
               (
               "Size of template specialization: " , stringify ! (
               std_ctype_byname ) ));
    assert_eq!(::std::mem::align_of::<std_ctype_byname>() , 8usize , concat !
               (
               "Alignment of template specialization: " , stringify ! (
               std_ctype_byname ) ));
}
#[test]
fn __bindgen_test_layout_std_ctype_byname_instantiation_18606() {
    assert_eq!(::std::mem::size_of::<std_ctype_byname>() , 736usize , concat !
               (
               "Size of template specialization: " , stringify ! (
               std_ctype_byname ) ));
    assert_eq!(::std::mem::align_of::<std_ctype_byname>() , 8usize , concat !
               (
               "Alignment of template specialization: " , stringify ! (
               std_ctype_byname ) ));
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct std___num_base {
    pub _address: u8,
}
pub const std___num_base__S_ominus: std___num_base__bindgen_ty_1 =
    std___num_base__bindgen_ty_1::_S_ominus;
pub const std___num_base__S_oplus: std___num_base__bindgen_ty_1 =
    std___num_base__bindgen_ty_1::_S_oplus;
pub const std___num_base__S_ox: std___num_base__bindgen_ty_1 =
    std___num_base__bindgen_ty_1::_S_ox;
pub const std___num_base__S_oX: std___num_base__bindgen_ty_1 =
    std___num_base__bindgen_ty_1::_S_oX;
pub const std___num_base__S_odigits: std___num_base__bindgen_ty_1 =
    std___num_base__bindgen_ty_1::_S_odigits;
pub const std___num_base__S_odigits_end: std___num_base__bindgen_ty_1 =
    std___num_base__bindgen_ty_1::_S_odigits_end;
pub const std___num_base__S_oudigits: std___num_base__bindgen_ty_1 =
    std___num_base__bindgen_ty_1::_S_odigits_end;
pub const std___num_base__S_oudigits_end: std___num_base__bindgen_ty_1 =
    std___num_base__bindgen_ty_1::_S_oudigits_end;
pub const std___num_base__S_oe: std___num_base__bindgen_ty_1 =
    std___num_base__bindgen_ty_1::_S_oe;
pub const std___num_base__S_oE: std___num_base__bindgen_ty_1 =
    std___num_base__bindgen_ty_1::_S_oE;
pub const std___num_base__S_oend: std___num_base__bindgen_ty_1 =
    std___num_base__bindgen_ty_1::_S_oudigits_end;
#[repr(i32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum std___num_base__bindgen_ty_1 {
    _S_ominus = 0,
    _S_oplus = 1,
    _S_ox = 2,
    _S_oX = 3,
    _S_odigits = 4,
    _S_odigits_end = 20,
    _S_oudigits_end = 36,
    _S_oe = 18,
    _S_oE = 34,
}
pub const std___num_base__S_iminus: std___num_base__bindgen_ty_2 =
    std___num_base__bindgen_ty_2::_S_iminus;
pub const std___num_base__S_iplus: std___num_base__bindgen_ty_2 =
    std___num_base__bindgen_ty_2::_S_iplus;
pub const std___num_base__S_ix: std___num_base__bindgen_ty_2 =
    std___num_base__bindgen_ty_2::_S_ix;
pub const std___num_base__S_iX: std___num_base__bindgen_ty_2 =
    std___num_base__bindgen_ty_2::_S_iX;
pub const std___num_base__S_izero: std___num_base__bindgen_ty_2 =
    std___num_base__bindgen_ty_2::_S_izero;
pub const std___num_base__S_ie: std___num_base__bindgen_ty_2 =
    std___num_base__bindgen_ty_2::_S_ie;
pub const std___num_base__S_iE: std___num_base__bindgen_ty_2 =
    std___num_base__bindgen_ty_2::_S_iE;
pub const std___num_base__S_iend: std___num_base__bindgen_ty_2 =
    std___num_base__bindgen_ty_2::_S_iend;
#[repr(i32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum std___num_base__bindgen_ty_2 {
    _S_iminus = 0,
    _S_iplus = 1,
    _S_ix = 2,
    _S_iX = 3,
    _S_izero = 4,
    _S_ie = 18,
    _S_iE = 24,
    _S_iend = 26,
}
extern "C" {
    #[link_name = "?_S_atoms_out@__num_base@std@@2PEBDEB"]
    pub static mut std___num_base__S_atoms_out: *const ::std::os::raw::c_char;
}
extern "C" {
    #[link_name = "?_S_atoms_in@__num_base@std@@2PEBDEB"]
    pub static mut std___num_base__S_atoms_in: *const ::std::os::raw::c_char;
}
#[test]
fn bindgen_test_layout_std___num_base() {
    assert_eq!(::std::mem::size_of::<std___num_base>() , 1usize , concat ! (
               "Size of: " , stringify ! ( std___num_base ) ));
    assert_eq! (::std::mem::align_of::<std___num_base>() , 1usize , concat ! (
                "Alignment of " , stringify ! ( std___num_base ) ));
}
extern "C" {
    #[link_name =
          "?_S_format_float@__num_base@std@@SAXAEBVios_base@2@PEADD@Z"]
    pub fn std___num_base__S_format_float(__io: *const std_ios_base,
                                          __fptr: *mut ::std::os::raw::c_char,
                                          __mod: ::std::os::raw::c_char);
}
impl Clone for std___num_base {
    fn clone(&self) -> Self { *self }
}
impl std___num_base {
    #[inline]
    pub unsafe fn _S_format_float(__io: *const std_ios_base,
                                  __fptr: *mut ::std::os::raw::c_char,
                                  __mod: ::std::os::raw::c_char) {
        std___num_base__S_format_float(__io, __fptr, __mod)
    }
}
#[repr(C)]
pub struct std___numpunct_cache<_CharT> {
    pub _base: std_locale_facet,
    pub _M_grouping: *const ::std::os::raw::c_char,
    pub _M_grouping_size: usize,
    pub _M_use_grouping: bool,
    pub _M_truename: *mut _CharT,
    pub _M_truename_size: usize,
    pub _M_falsename: *mut _CharT,
    pub _M_falsename_size: usize,
    pub _M_decimal_point: _CharT,
    pub _M_thousands_sep: _CharT,
    pub _M_atoms_out: [_CharT; 36usize],
    pub _M_atoms_in: [_CharT; 26usize],
    pub _M_allocated: bool,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___use_cache {
    pub _address: u8,
}
extern "C" {
    #[link_name =
          "?__verify_grouping@std@@YA_NPEBD_KAEBV?$basic_string@DU?$char_traits@D@std@@V?$allocator@D@2@@1@@Z"]
    pub fn std___verify_grouping(__grouping: *const ::std::os::raw::c_char,
                                 __grouping_size: usize,
                                 __grouping_tmp: *const std_string) -> bool;
}
#[test]
fn __bindgen_test_layout_std_numpunct_instantiation_18900() {
    assert_eq!(::std::mem::size_of::<std_numpunct<::std::os::raw::c_char>>() ,
               24usize , concat ! (
               "Size of template specialization: " , stringify ! (
               std_numpunct<::std::os::raw::c_char> ) ));
    assert_eq!(::std::mem::align_of::<std_numpunct<::std::os::raw::c_char>>()
               , 8usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std_numpunct<::std::os::raw::c_char> ) ));
}
#[test]
fn __bindgen_test_layout_std_numpunct_byname_instantiation_18904() {
    assert_eq!(::std::mem::size_of::<std_numpunct_byname<::std::os::raw::c_char>>()
               , 24usize , concat ! (
               "Size of template specialization: " , stringify ! (
               std_numpunct_byname<::std::os::raw::c_char> ) ));
    assert_eq!(::std::mem::align_of::<std_numpunct_byname<::std::os::raw::c_char>>()
               , 8usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std_numpunct_byname<::std::os::raw::c_char> ) ));
}
#[test]
fn __bindgen_test_layout_std_num_get_instantiation_18908() {
    assert_eq!(::std::mem::size_of::<std_num_get>() , 16usize , concat ! (
               "Size of template specialization: " , stringify ! ( std_num_get
               ) ));
    assert_eq!(::std::mem::align_of::<std_num_get>() , 8usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std_num_get ) ));
}
#[test]
fn __bindgen_test_layout_std_num_put_instantiation_18913() {
    assert_eq!(::std::mem::size_of::<std_num_put>() , 16usize , concat ! (
               "Size of template specialization: " , stringify ! ( std_num_put
               ) ));
    assert_eq!(::std::mem::align_of::<std_num_put>() , 8usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std_num_put ) ));
}
#[test]
fn __bindgen_test_layout_std_numpunct_instantiation_18919() {
    assert_eq!(::std::mem::size_of::<std_numpunct<u16>>() , 24usize , concat !
               (
               "Size of template specialization: " , stringify ! (
               std_numpunct<u16> ) ));
    assert_eq!(::std::mem::align_of::<std_numpunct<u16>>() , 8usize , concat !
               (
               "Alignment of template specialization: " , stringify ! (
               std_numpunct<u16> ) ));
}
#[test]
fn __bindgen_test_layout_std_numpunct_byname_instantiation_18923() {
    assert_eq!(::std::mem::size_of::<std_numpunct_byname<u16>>() , 24usize ,
               concat ! (
               "Size of template specialization: " , stringify ! (
               std_numpunct_byname<u16> ) ));
    assert_eq!(::std::mem::align_of::<std_numpunct_byname<u16>>() , 8usize ,
               concat ! (
               "Alignment of template specialization: " , stringify ! (
               std_numpunct_byname<u16> ) ));
}
#[test]
fn __bindgen_test_layout_std_num_get_instantiation_18927() {
    assert_eq!(::std::mem::size_of::<std_num_get>() , 16usize , concat ! (
               "Size of template specialization: " , stringify ! ( std_num_get
               ) ));
    assert_eq!(::std::mem::align_of::<std_num_get>() , 8usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std_num_get ) ));
}
#[test]
fn __bindgen_test_layout_std_num_put_instantiation_18932() {
    assert_eq!(::std::mem::size_of::<std_num_put>() , 16usize , concat ! (
               "Size of template specialization: " , stringify ! ( std_num_put
               ) ));
    assert_eq!(::std::mem::align_of::<std_num_put>() , 8usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std_num_put ) ));
}
#[test]
fn __bindgen_test_layout_std_basic_ios_instantiation_18964() {
    assert_eq!(::std::mem::size_of::<std_basic_ios<::std::os::raw::c_char>>()
               , 264usize , concat ! (
               "Size of template specialization: " , stringify ! (
               std_basic_ios<::std::os::raw::c_char> ) ));
    assert_eq!(::std::mem::align_of::<std_basic_ios<::std::os::raw::c_char>>()
               , 8usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std_basic_ios<::std::os::raw::c_char> ) ));
}
#[test]
fn __bindgen_test_layout_std_basic_ios_instantiation_18969() {
    assert_eq!(::std::mem::size_of::<std_basic_ios<u16>>() , 264usize , concat
               ! (
               "Size of template specialization: " , stringify ! (
               std_basic_ios<u16> ) ));
    assert_eq!(::std::mem::align_of::<std_basic_ios<u16>>() , 8usize , concat
               ! (
               "Alignment of template specialization: " , stringify ! (
               std_basic_ios<u16> ) ));
}
#[test]
fn __bindgen_test_layout_std_basic_ostream_instantiation_19026() {
    assert_eq!(::std::mem::size_of::<std_basic_ostream<::std::os::raw::c_char>>()
               , 272usize , concat ! (
               "Size of template specialization: " , stringify ! (
               std_basic_ostream<::std::os::raw::c_char> ) ));
    assert_eq!(::std::mem::align_of::<std_basic_ostream<::std::os::raw::c_char>>()
               , 8usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std_basic_ostream<::std::os::raw::c_char> ) ));
}
#[test]
fn __bindgen_test_layout_std_basic_ostream_instantiation_19031() {
    assert_eq!(::std::mem::size_of::<std_basic_ostream<u16>>() , 272usize ,
               concat ! (
               "Size of template specialization: " , stringify ! (
               std_basic_ostream<u16> ) ));
    assert_eq!(::std::mem::align_of::<std_basic_ostream<u16>>() , 8usize ,
               concat ! (
               "Alignment of template specialization: " , stringify ! (
               std_basic_ostream<u16> ) ));
}
#[test]
fn __bindgen_test_layout_std_basic_istream_instantiation_19177() {
    assert_eq!(::std::mem::size_of::<std_basic_istream<::std::os::raw::c_char>>()
               , 280usize , concat ! (
               "Size of template specialization: " , stringify ! (
               std_basic_istream<::std::os::raw::c_char> ) ));
    assert_eq!(::std::mem::align_of::<std_basic_istream<::std::os::raw::c_char>>()
               , 8usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std_basic_istream<::std::os::raw::c_char> ) ));
}
#[test]
fn __bindgen_test_layout_std_basic_iostream_instantiation_19182() {
    assert_eq!(::std::mem::size_of::<std_basic_iostream<::std::os::raw::c_char>>()
               , 288usize , concat ! (
               "Size of template specialization: " , stringify ! (
               std_basic_iostream<::std::os::raw::c_char> ) ));
    assert_eq!(::std::mem::align_of::<std_basic_iostream<::std::os::raw::c_char>>()
               , 8usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std_basic_iostream<::std::os::raw::c_char> ) ));
}
#[test]
fn __bindgen_test_layout_std_basic_istream_instantiation_19187() {
    assert_eq!(::std::mem::size_of::<std_basic_istream<u16>>() , 280usize ,
               concat ! (
               "Size of template specialization: " , stringify ! (
               std_basic_istream<u16> ) ));
    assert_eq!(::std::mem::align_of::<std_basic_istream<u16>>() , 8usize ,
               concat ! (
               "Alignment of template specialization: " , stringify ! (
               std_basic_istream<u16> ) ));
}
#[test]
fn __bindgen_test_layout_std_basic_iostream_instantiation_19192() {
    assert_eq!(::std::mem::size_of::<std_basic_iostream<u16>>() , 288usize ,
               concat ! (
               "Size of template specialization: " , stringify ! (
               std_basic_iostream<u16> ) ));
    assert_eq!(::std::mem::align_of::<std_basic_iostream<u16>>() , 8usize ,
               concat ! (
               "Alignment of template specialization: " , stringify ! (
               std_basic_iostream<u16> ) ));
}
extern "C" {
    #[link_name = "?cin@std@@3V?$basic_istream@DU?$char_traits@D@std@@@1@A"]
    pub static mut std_cin: std_istream;
}
extern "C" {
    #[link_name = "?cout@std@@3V?$basic_ostream@DU?$char_traits@D@std@@@1@A"]
    pub static mut std_cout: std_ostream;
}
extern "C" {
    #[link_name = "?cerr@std@@3V?$basic_ostream@DU?$char_traits@D@std@@@1@A"]
    pub static mut std_cerr: std_ostream;
}
extern "C" {
    #[link_name = "?clog@std@@3V?$basic_ostream@DU?$char_traits@D@std@@@1@A"]
    pub static mut std_clog: std_ostream;
}
extern "C" {
    #[link_name =
          "?wcin@std@@3V?$basic_istream@_WU?$char_traits@_W@std@@@1@A"]
    pub static mut std_wcin: std_wistream;
}
extern "C" {
    #[link_name =
          "?wcout@std@@3V?$basic_ostream@_WU?$char_traits@_W@std@@@1@A"]
    pub static mut std_wcout: std_wostream;
}
extern "C" {
    #[link_name =
          "?wcerr@std@@3V?$basic_ostream@_WU?$char_traits@_W@std@@@1@A"]
    pub static mut std_wcerr: std_wostream;
}
extern "C" {
    #[link_name =
          "?wclog@std@@3V?$basic_ostream@_WU?$char_traits@_W@std@@@1@A"]
    pub static mut std_wclog: std_wostream;
}
extern "C" {
    #[link_name = "?__ioinit@std@@3VInit@ios_base@1@A"]
    pub static mut std___ioinit: std_ios_base_Init;
}
#[test]
fn __bindgen_test_layout_std_basic_stringbuf_instantiation_19304() {
    assert_eq!(::std::mem::size_of::<std_basic_stringbuf<::std::os::raw::c_char,
                                          std_allocator>>()
               , 80usize , concat ! (
               "Size of template specialization: " , stringify ! (
               std_basic_stringbuf<::std::os::raw::c_char, std_allocator> )
               ));
    assert_eq!(::std::mem::align_of::<std_basic_stringbuf<::std::os::raw::c_char,
                                           std_allocator>>()
               , 8usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std_basic_stringbuf<::std::os::raw::c_char, std_allocator> )
               ));
}
#[test]
fn __bindgen_test_layout_std_basic_istringstream_instantiation_19310() {
    assert_eq!(::std::mem::size_of::<std_basic_istringstream<::std::os::raw::c_char,
                                              std_allocator>>()
               , 360usize , concat ! (
               "Size of template specialization: " , stringify ! (
               std_basic_istringstream<::std::os::raw::c_char, std_allocator>
               ) ));
    assert_eq!(::std::mem::align_of::<std_basic_istringstream<::std::os::raw::c_char,
                                               std_allocator>>()
               , 8usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std_basic_istringstream<::std::os::raw::c_char, std_allocator>
               ) ));
}
#[test]
fn __bindgen_test_layout_std_basic_ostringstream_instantiation_19316() {
    assert_eq!(::std::mem::size_of::<std_basic_ostringstream<::std::os::raw::c_char,
                                              std_allocator>>()
               , 352usize , concat ! (
               "Size of template specialization: " , stringify ! (
               std_basic_ostringstream<::std::os::raw::c_char, std_allocator>
               ) ));
    assert_eq!(::std::mem::align_of::<std_basic_ostringstream<::std::os::raw::c_char,
                                               std_allocator>>()
               , 8usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std_basic_ostringstream<::std::os::raw::c_char, std_allocator>
               ) ));
}
#[test]
fn __bindgen_test_layout_std_basic_stringstream_instantiation_19322() {
    assert_eq!(::std::mem::size_of::<std_basic_stringstream<::std::os::raw::c_char,
                                             std_allocator>>()
               , 368usize , concat ! (
               "Size of template specialization: " , stringify ! (
               std_basic_stringstream<::std::os::raw::c_char, std_allocator> )
               ));
    assert_eq!(::std::mem::align_of::<std_basic_stringstream<::std::os::raw::c_char,
                                              std_allocator>>()
               , 8usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std_basic_stringstream<::std::os::raw::c_char, std_allocator> )
               ));
}
#[test]
fn __bindgen_test_layout_std_basic_stringbuf_instantiation_19328() {
    assert_eq!(::std::mem::size_of::<std_basic_stringbuf<u16, std_allocator>>()
               , 80usize , concat ! (
               "Size of template specialization: " , stringify ! (
               std_basic_stringbuf<u16, std_allocator> ) ));
    assert_eq!(::std::mem::align_of::<std_basic_stringbuf<u16, std_allocator>>()
               , 8usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std_basic_stringbuf<u16, std_allocator> ) ));
}
#[test]
fn __bindgen_test_layout_std_basic_istringstream_instantiation_19334() {
    assert_eq!(::std::mem::size_of::<std_basic_istringstream<u16, std_allocator>>()
               , 360usize , concat ! (
               "Size of template specialization: " , stringify ! (
               std_basic_istringstream<u16, std_allocator> ) ));
    assert_eq!(::std::mem::align_of::<std_basic_istringstream<u16, std_allocator>>()
               , 8usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std_basic_istringstream<u16, std_allocator> ) ));
}
#[test]
fn __bindgen_test_layout_std_basic_ostringstream_instantiation_19340() {
    assert_eq!(::std::mem::size_of::<std_basic_ostringstream<u16, std_allocator>>()
               , 352usize , concat ! (
               "Size of template specialization: " , stringify ! (
               std_basic_ostringstream<u16, std_allocator> ) ));
    assert_eq!(::std::mem::align_of::<std_basic_ostringstream<u16, std_allocator>>()
               , 8usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std_basic_ostringstream<u16, std_allocator> ) ));
}
#[test]
fn __bindgen_test_layout_std_basic_stringstream_instantiation_19346() {
    assert_eq!(::std::mem::size_of::<std_basic_stringstream<u16, std_allocator>>()
               , 368usize , concat ! (
               "Size of template specialization: " , stringify ! (
               std_basic_stringstream<u16, std_allocator> ) ));
    assert_eq!(::std::mem::align_of::<std_basic_stringstream<u16, std_allocator>>()
               , 8usize , concat ! (
               "Alignment of template specialization: " , stringify ! (
               std_basic_stringstream<u16, std_allocator> ) ));
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_complex<_Tp> {
    pub _M_real: _Tp,
    pub _M_imag: _Tp,
}
pub type std_complex_value_type<_Tp> = _Tp;
#[test]
fn __bindgen_test_layout_std_complex_instantiation_19358() {
    assert_eq!(::std::mem::size_of::<std_complex<f32>>() , 8usize , concat ! (
               "Size of template specialization: " , stringify ! (
               std_complex<f32> ) ));
    assert_eq!(::std::mem::align_of::<std_complex<f32>>() , 4usize , concat !
               (
               "Alignment of template specialization: " , stringify ! (
               std_complex<f32> ) ));
}
#[test]
fn __bindgen_test_layout_std_complex_instantiation_19362() {
    assert_eq!(::std::mem::size_of::<std_complex<f64>>() , 16usize , concat !
               (
               "Size of template specialization: " , stringify ! (
               std_complex<f64> ) ));
    assert_eq!(::std::mem::align_of::<std_complex<f64>>() , 8usize , concat !
               (
               "Alignment of template specialization: " , stringify ! (
               std_complex<f64> ) ));
}
#[test]
fn __bindgen_test_layout_std_complex_instantiation_19366() {
    assert_eq!(::std::mem::size_of::<std_complex<f64>>() , 16usize , concat !
               (
               "Size of template specialization: " , stringify ! (
               std_complex<f64> ) ));
    assert_eq!(::std::mem::align_of::<std_complex<f64>>() , 8usize , concat !
               (
               "Alignment of template specialization: " , stringify ! (
               std_complex<f64> ) ));
}
#[test]
fn __bindgen_test_layout_std__Norm_helper_instantiation_19458() {
    assert_eq!(::std::mem::size_of::<u8>() , 1usize , concat ! (
               "Size of template specialization: " , stringify ! ( u8 ) ));
    assert_eq!(::std::mem::align_of::<u8>() , 1usize , concat ! (
               "Alignment of template specialization: " , stringify ! ( u8 )
               ));
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__List_node<_Tp> {
    pub _base: std___detail__List_node_base,
    pub _M_data: _Tp,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__List_iterator {
    pub _M_node: *mut std___detail__List_node_base,
}
pub type std__List_iterator__Self = std__List_iterator;
pub type std__List_iterator__Node<_Tp> = std__List_node<_Tp>;
pub type std__List_iterator_difference_type = isize;
pub type std__List_iterator_iterator_category =
    std_bidirectional_iterator_tag;
pub type std__List_iterator_value_type<_Tp> = _Tp;
pub type std__List_iterator_pointer<_Tp> = *mut _Tp;
pub type std__List_iterator_reference<_Tp> = *mut _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__List_const_iterator {
    pub _M_node: *const std___detail__List_node_base,
}
pub type std__List_const_iterator__Self = std__List_const_iterator;
pub type std__List_const_iterator__Node<_Tp> = std__List_node<_Tp>;
pub type std__List_const_iterator_iterator = std__List_iterator;
pub type std__List_const_iterator_difference_type = isize;
pub type std__List_const_iterator_iterator_category =
    std_bidirectional_iterator_tag;
pub type std__List_const_iterator_value_type<_Tp> = _Tp;
pub type std__List_const_iterator_pointer<_Tp> = *mut _Tp;
pub type std__List_const_iterator_reference<_Tp> = *mut _Tp;
#[repr(C)]
pub struct std__List_base {
    pub _M_impl: std__List_base__List_impl,
}
pub type std__List_base__Node_alloc_type = [u8; 0usize];
pub type std__List_base__Tp_alloc_type = [u8; 0usize];
#[repr(C)]
pub struct std__List_base__List_impl {
    pub _M_node: std___detail__List_node_base,
}
pub type std__List_base_allocator_type<_Alloc> = _Alloc;
#[repr(C)]
pub struct std_list {
    pub _base: std__List_base,
}
pub type std_list__Alloc_value_type = [u8; 0usize];
pub type std_list__Base = std__List_base;
pub type std_list__Tp_alloc_type = std_list__Base;
pub type std_list__Node_alloc_type = std_list__Base;
pub type std_list_value_type<_Tp> = _Tp;
pub type std_list_pointer = std_list__Tp_alloc_type;
pub type std_list_const_pointer = std_list__Tp_alloc_type;
pub type std_list_reference = std_list__Tp_alloc_type;
pub type std_list_const_reference = std_list__Tp_alloc_type;
pub type std_list_iterator = std__List_iterator;
pub type std_list_const_iterator = std__List_const_iterator;
pub type std_list_const_reverse_iterator =
    std_reverse_iterator<std_list_const_iterator>;
pub type std_list_reverse_iterator = std_reverse_iterator<std_list_iterator>;
pub type std_list_size_type = usize;
pub type std_list_difference_type = isize;
pub type std_list_allocator_type<_Alloc> = _Alloc;
pub type std_list__Node<_Tp> = std__List_node<_Tp>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Deque_iterator<_Tp> {
    pub _M_cur: *mut _Tp,
    pub _M_first: *mut _Tp,
    pub _M_last: *mut _Tp,
    pub _M_node: std__Deque_iterator__Map_pointer<_Tp>,
}
pub type std__Deque_iterator_iterator<_Tp> = std__Deque_iterator<_Tp>;
pub type std__Deque_iterator_const_iterator<_Tp> = std__Deque_iterator<_Tp>;
pub type std__Deque_iterator_iterator_category =
    std_random_access_iterator_tag;
pub type std__Deque_iterator_value_type<_Tp> = _Tp;
pub type std__Deque_iterator_pointer<_Ptr> = _Ptr;
pub type std__Deque_iterator_reference<_Ref> = _Ref;
pub type std__Deque_iterator_size_type = usize;
pub type std__Deque_iterator_difference_type = isize;
pub type std__Deque_iterator__Map_pointer<_Tp> = *mut *mut _Tp;
pub type std__Deque_iterator__Self<_Tp> = std__Deque_iterator<_Tp>;
#[repr(C)]
pub struct std__Deque_base<_Tp> {
    pub _M_impl: std__Deque_base__Deque_impl<_Tp>,
}
pub type std__Deque_base_allocator_type<_Alloc> = _Alloc;
pub type std__Deque_base_iterator<_Tp> = std__Deque_iterator<_Tp>;
pub type std__Deque_base_const_iterator<_Tp> = std__Deque_iterator<_Tp>;
pub type std__Deque_base__Map_alloc_type = [u8; 0usize];
pub type std__Deque_base__Tp_alloc_type = [u8; 0usize];
#[repr(C)]
pub struct std__Deque_base__Deque_impl<_Tp> {
    pub _M_map: *mut *mut _Tp,
    pub _M_map_size: usize,
    pub _M_start: std__Deque_base_iterator<_Tp>,
    pub _M_finish: std__Deque_base_iterator<_Tp>,
}
pub const std__Deque_base__S_initial_map_size: std__Deque_base__bindgen_ty_1 =
    std__Deque_base__bindgen_ty_1::_S_initial_map_size;
#[repr(i32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum std__Deque_base__bindgen_ty_1 { _S_initial_map_size = 0, }
#[repr(C)]
pub struct std_deque<_Tp> {
    pub _base: std__Deque_base<_Tp>,
}
pub type std_deque__Alloc_value_type = [u8; 0usize];
pub type std_deque__Base<_Tp> = std__Deque_base<_Tp>;
pub type std_deque__Tp_alloc_type<_Tp> = std_deque__Base<_Tp>;
pub type std_deque_value_type<_Tp> = _Tp;
pub type std_deque_pointer<_Tp> = std_deque__Tp_alloc_type<_Tp>;
pub type std_deque_const_pointer<_Tp> = std_deque__Tp_alloc_type<_Tp>;
pub type std_deque_reference<_Tp> = std_deque__Tp_alloc_type<_Tp>;
pub type std_deque_const_reference<_Tp> = std_deque__Tp_alloc_type<_Tp>;
pub type std_deque_iterator<_Tp> = std_deque__Base<_Tp>;
pub type std_deque_const_iterator<_Tp> = std_deque__Base<_Tp>;
pub type std_deque_const_reverse_iterator =
    std_reverse_iterator<std_deque_const_iterator<_Tp>>;
pub type std_deque_reverse_iterator =
    std_reverse_iterator<std_deque_iterator<_Tp>>;
pub type std_deque_size_type = usize;
pub type std_deque_difference_type = isize;
pub type std_deque_allocator_type<_Alloc> = _Alloc;
pub type std_deque__Map_pointer<_Tp> = *mut std_deque_pointer<_Tp>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_stack<_Sequence> {
    pub c: _Sequence,
}
pub type std_stack__Sequence_value_type = [u8; 0usize];
pub type std_stack_value_type = [u8; 0usize];
pub type std_stack_reference = [u8; 0usize];
pub type std_stack_const_reference = [u8; 0usize];
pub type std_stack_size_type = [u8; 0usize];
pub type std_stack_container_type<_Sequence> = _Sequence;
#[repr(i32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum std__Rb_tree_color { _S_red = 0, _S_black = 1, }
#[repr(C)]
#[derive(Debug, Copy)]
pub struct std__Rb_tree_node_base {
    pub _M_color: std__Rb_tree_color,
    pub _M_parent: std__Rb_tree_node_base__Base_ptr,
    pub _M_left: std__Rb_tree_node_base__Base_ptr,
    pub _M_right: std__Rb_tree_node_base__Base_ptr,
}
pub type std__Rb_tree_node_base__Base_ptr = *mut std__Rb_tree_node_base;
pub type std__Rb_tree_node_base__Const_Base_ptr =
    *const std__Rb_tree_node_base;
#[test]
fn bindgen_test_layout_std__Rb_tree_node_base() {
    assert_eq!(::std::mem::size_of::<std__Rb_tree_node_base>() , 32usize ,
               concat ! ( "Size of: " , stringify ! ( std__Rb_tree_node_base )
               ));
    assert_eq! (::std::mem::align_of::<std__Rb_tree_node_base>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( std__Rb_tree_node_base ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const std__Rb_tree_node_base ) ) . _M_color as
                * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( std__Rb_tree_node_base
                ) , "::" , stringify ! ( _M_color ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const std__Rb_tree_node_base ) ) . _M_parent as
                * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( std__Rb_tree_node_base
                ) , "::" , stringify ! ( _M_parent ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const std__Rb_tree_node_base ) ) . _M_left as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( std__Rb_tree_node_base
                ) , "::" , stringify ! ( _M_left ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const std__Rb_tree_node_base ) ) . _M_right as
                * const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( std__Rb_tree_node_base
                ) , "::" , stringify ! ( _M_right ) ));
}
impl Clone for std__Rb_tree_node_base {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
pub struct std__Rb_tree_node {
    pub _base: std__Rb_tree_node_base,
    pub _M_storage: __gnu_cxx___aligned_buffer,
}
pub type std__Rb_tree_node__Link_type = *mut std__Rb_tree_node;
extern "C" {
    #[link_name =
          "?_Rb_tree_increment@std@@YAPEAU_Rb_tree_node_base@1@PEAU21@@Z"]
    pub fn std__Rb_tree_increment(__x: *mut std__Rb_tree_node_base)
     -> *mut std__Rb_tree_node_base;
}
extern "C" {
    #[link_name =
          "?_Rb_tree_increment@std@@YAPEBU_Rb_tree_node_base@1@PEBU21@@Z"]
    pub fn std__Rb_tree_increment1(__x: *const std__Rb_tree_node_base)
     -> *const std__Rb_tree_node_base;
}
extern "C" {
    #[link_name =
          "?_Rb_tree_decrement@std@@YAPEAU_Rb_tree_node_base@1@PEAU21@@Z"]
    pub fn std__Rb_tree_decrement(__x: *mut std__Rb_tree_node_base)
     -> *mut std__Rb_tree_node_base;
}
extern "C" {
    #[link_name =
          "?_Rb_tree_decrement@std@@YAPEBU_Rb_tree_node_base@1@PEBU21@@Z"]
    pub fn std__Rb_tree_decrement1(__x: *const std__Rb_tree_node_base)
     -> *const std__Rb_tree_node_base;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Rb_tree_iterator {
    pub _M_node: std__Rb_tree_iterator__Base_ptr,
}
pub type std__Rb_tree_iterator_value_type<_Tp> = _Tp;
pub type std__Rb_tree_iterator_reference<_Tp> = *mut _Tp;
pub type std__Rb_tree_iterator_pointer<_Tp> = *mut _Tp;
pub type std__Rb_tree_iterator_iterator_category =
    std_bidirectional_iterator_tag;
pub type std__Rb_tree_iterator_difference_type = isize;
pub type std__Rb_tree_iterator__Self = std__Rb_tree_iterator;
pub type std__Rb_tree_iterator__Base_ptr = std__Rb_tree_node_base__Base_ptr;
pub type std__Rb_tree_iterator__Link_type = *mut std__Rb_tree_node;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Rb_tree_const_iterator {
    pub _M_node: std__Rb_tree_const_iterator__Base_ptr,
}
pub type std__Rb_tree_const_iterator_value_type<_Tp> = _Tp;
pub type std__Rb_tree_const_iterator_reference<_Tp> = *mut _Tp;
pub type std__Rb_tree_const_iterator_pointer<_Tp> = *mut _Tp;
pub type std__Rb_tree_const_iterator_iterator = std__Rb_tree_iterator;
pub type std__Rb_tree_const_iterator_iterator_category =
    std_bidirectional_iterator_tag;
pub type std__Rb_tree_const_iterator_difference_type = isize;
pub type std__Rb_tree_const_iterator__Self = std__Rb_tree_const_iterator;
pub type std__Rb_tree_const_iterator__Base_ptr =
    std__Rb_tree_node_base__Const_Base_ptr;
pub type std__Rb_tree_const_iterator__Link_type = *const std__Rb_tree_node;
extern "C" {
    #[link_name =
          "?_Rb_tree_insert_and_rebalance@std@@YAX_NPEAU_Rb_tree_node_base@1@1AEAU21@@Z"]
    pub fn std__Rb_tree_insert_and_rebalance(__insert_left: bool,
                                             __x: *mut std__Rb_tree_node_base,
                                             __p: *mut std__Rb_tree_node_base,
                                             __header:
                                                 *mut std__Rb_tree_node_base);
}
extern "C" {
    #[link_name =
          "?_Rb_tree_rebalance_for_erase@std@@YAPEAU_Rb_tree_node_base@1@QEAU21@AEAU21@@Z"]
    pub fn std__Rb_tree_rebalance_for_erase(__z:
                                                *const std__Rb_tree_node_base,
                                            __header:
                                                *mut std__Rb_tree_node_base)
     -> *mut std__Rb_tree_node_base;
}
#[repr(C)]
pub struct std__Rb_tree<_Compare> {
    pub _M_impl: u8,
}
pub type std__Rb_tree__Node_allocator = __gnu_cxx___alloc_traits;
pub type std__Rb_tree__Alloc_traits = __gnu_cxx___alloc_traits;
pub type std__Rb_tree__Base_ptr = *mut std__Rb_tree_node_base;
pub type std__Rb_tree__Const_Base_ptr = *const std__Rb_tree_node_base;
pub type std__Rb_tree_key_type<_Key> = _Key;
pub type std__Rb_tree_value_type<_Val> = _Val;
pub type std__Rb_tree_pointer<_Val> = *mut std__Rb_tree_value_type<_Val>;
pub type std__Rb_tree_const_pointer<_Val> =
    *const std__Rb_tree_value_type<_Val>;
pub type std__Rb_tree_reference<_Val> = *mut std__Rb_tree_value_type<_Val>;
pub type std__Rb_tree_const_reference<_Val> =
    *const std__Rb_tree_value_type<_Val>;
pub type std__Rb_tree__Link_type = *mut std__Rb_tree_node;
pub type std__Rb_tree__Const_Link_type = *const std__Rb_tree_node;
pub type std__Rb_tree_size_type = usize;
pub type std__Rb_tree_difference_type = isize;
pub type std__Rb_tree_allocator_type<_Alloc> = _Alloc;
pub type std__Rb_tree_reverse_iterator =
    std_reverse_iterator<std__Rb_tree_iterator>;
pub type std__Rb_tree_const_reverse_iterator =
    std_reverse_iterator<std__Rb_tree_const_iterator>;
extern "C" {
    #[link_name =
          "?_Rb_tree_black_count@std@@YAIPEBU_Rb_tree_node_base@1@0@Z"]
    pub fn std__Rb_tree_black_count(__node: *const std__Rb_tree_node_base,
                                    __root: *const std__Rb_tree_node_base)
     -> ::std::os::raw::c_uint;
}
#[repr(C)]
pub struct std_map {
    pub _M_t: std_map__Rep_type,
}
pub type std_map_key_type<_Key> = _Key;
pub type std_map_mapped_type<_Tp> = _Tp;
pub type std_map_value_type<_Key, _Tp> = std_pair<_Key, _Tp>;
pub type std_map_key_compare<_Compare> = _Compare;
pub type std_map_allocator_type<_Alloc> = _Alloc;
pub type std_map__Alloc_value_type = [u8; 0usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_map_value_compare<_Compare> {
    pub comp: _Compare,
}
pub type std_map__Pair_alloc_type = __gnu_cxx___alloc_traits;
pub type std_map__Rep_type = std__Rb_tree<std_map_key_compare<_Compare>>;
pub type std_map__Alloc_traits = __gnu_cxx___alloc_traits;
pub type std_map_pointer = std_map__Alloc_traits;
pub type std_map_const_pointer = std_map__Alloc_traits;
pub type std_map_reference = std_map__Alloc_traits;
pub type std_map_const_reference = std_map__Alloc_traits;
pub type std_map_iterator = std_map__Rep_type;
pub type std_map_const_iterator = std_map__Rep_type;
pub type std_map_size_type = std_map__Rep_type;
pub type std_map_difference_type = std_map__Rep_type;
pub type std_map_reverse_iterator = std_map__Rep_type;
pub type std_map_const_reverse_iterator = std_map__Rep_type;
#[repr(C)]
pub struct std_multimap {
    pub _M_t: std_multimap__Rep_type,
}
pub type std_multimap_key_type<_Key> = _Key;
pub type std_multimap_mapped_type<_Tp> = _Tp;
pub type std_multimap_value_type<_Key, _Tp> = std_pair<_Key, _Tp>;
pub type std_multimap_key_compare<_Compare> = _Compare;
pub type std_multimap_allocator_type<_Alloc> = _Alloc;
pub type std_multimap__Alloc_value_type = [u8; 0usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_multimap_value_compare<_Compare> {
    pub comp: _Compare,
}
pub type std_multimap__Pair_alloc_type = __gnu_cxx___alloc_traits;
pub type std_multimap__Rep_type =
    std__Rb_tree<std_multimap_key_compare<_Compare>>;
pub type std_multimap__Alloc_traits = __gnu_cxx___alloc_traits;
pub type std_multimap_pointer = std_multimap__Alloc_traits;
pub type std_multimap_const_pointer = std_multimap__Alloc_traits;
pub type std_multimap_reference = std_multimap__Alloc_traits;
pub type std_multimap_const_reference = std_multimap__Alloc_traits;
pub type std_multimap_iterator = std_multimap__Rep_type;
pub type std_multimap_const_iterator = std_multimap__Rep_type;
pub type std_multimap_size_type = std_multimap__Rep_type;
pub type std_multimap_difference_type = std_multimap__Rep_type;
pub type std_multimap_reverse_iterator = std_multimap__Rep_type;
pub type std_multimap_const_reverse_iterator = std_multimap__Rep_type;
#[repr(C)]
pub struct std_set {
    pub _M_t: std_set__Rep_type,
}
pub type std_set__Alloc_value_type = [u8; 0usize];
pub type std_set_key_type<_Key> = _Key;
pub type std_set_value_type<_Key> = _Key;
pub type std_set_key_compare<_Compare> = _Compare;
pub type std_set_value_compare<_Compare> = _Compare;
pub type std_set_allocator_type<_Alloc> = _Alloc;
pub type std_set__Key_alloc_type = __gnu_cxx___alloc_traits;
pub type std_set__Rep_type = std__Rb_tree<std_set_key_compare<_Compare>>;
pub type std_set__Alloc_traits = __gnu_cxx___alloc_traits;
pub type std_set_pointer = std_set__Alloc_traits;
pub type std_set_const_pointer = std_set__Alloc_traits;
pub type std_set_reference = std_set__Alloc_traits;
pub type std_set_const_reference = std_set__Alloc_traits;
pub type std_set_iterator = std_set__Rep_type;
pub type std_set_const_iterator = std_set__Rep_type;
pub type std_set_reverse_iterator = std_set__Rep_type;
pub type std_set_const_reverse_iterator = std_set__Rep_type;
pub type std_set_size_type = std_set__Rep_type;
pub type std_set_difference_type = std_set__Rep_type;
#[repr(C)]
pub struct std_multiset {
    pub _M_t: std_multiset__Rep_type,
}
pub type std_multiset__Alloc_value_type = [u8; 0usize];
pub type std_multiset_key_type<_Key> = _Key;
pub type std_multiset_value_type<_Key> = _Key;
pub type std_multiset_key_compare<_Compare> = _Compare;
pub type std_multiset_value_compare<_Compare> = _Compare;
pub type std_multiset_allocator_type<_Alloc> = _Alloc;
pub type std_multiset__Key_alloc_type = __gnu_cxx___alloc_traits;
pub type std_multiset__Rep_type =
    std__Rb_tree<std_multiset_key_compare<_Compare>>;
pub type std_multiset__Alloc_traits = __gnu_cxx___alloc_traits;
pub type std_multiset_pointer = std_multiset__Alloc_traits;
pub type std_multiset_const_pointer = std_multiset__Alloc_traits;
pub type std_multiset_reference = std_multiset__Alloc_traits;
pub type std_multiset_const_reference = std_multiset__Alloc_traits;
pub type std_multiset_iterator = std_multiset__Rep_type;
pub type std_multiset_const_iterator = std_multiset__Rep_type;
pub type std_multiset_reverse_iterator = std_multiset__Rep_type;
pub type std_multiset_const_reverse_iterator = std_multiset__Rep_type;
pub type std_multiset_size_type = std_multiset__Rep_type;
pub type std_multiset_difference_type = std_multiset__Rep_type;
pub type __gnuc_va_list = __builtin_va_list;
pub type va_list = __gnuc_va_list;
extern "C" {
    pub fn __mingw_get_crt_info() -> *const ::std::os::raw::c_char;
}
pub type rsize_t = usize;
pub type wint_t = ::std::os::raw::c_ushort;
pub type wctype_t = ::std::os::raw::c_ushort;
pub type errno_t = ::std::os::raw::c_int;
pub type __time32_t = ::std::os::raw::c_long;
pub type __time64_t = ::std::os::raw::c_longlong;
pub type time_t = __time64_t;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct threadlocaleinfostruct {
    pub refcount: ::std::os::raw::c_int,
    pub lc_codepage: ::std::os::raw::c_uint,
    pub lc_collate_cp: ::std::os::raw::c_uint,
    pub lc_handle: [::std::os::raw::c_ulong; 6usize],
    pub lc_id: [LC_ID; 6usize],
    pub lc_category: [threadlocaleinfostruct__bindgen_ty_1; 6usize],
    pub lc_clike: ::std::os::raw::c_int,
    pub mb_cur_max: ::std::os::raw::c_int,
    pub lconv_intl_refcount: *mut ::std::os::raw::c_int,
    pub lconv_num_refcount: *mut ::std::os::raw::c_int,
    pub lconv_mon_refcount: *mut ::std::os::raw::c_int,
    pub lconv: *mut lconv,
    pub ctype1_refcount: *mut ::std::os::raw::c_int,
    pub ctype1: *mut ::std::os::raw::c_ushort,
    pub pctype: *const ::std::os::raw::c_ushort,
    pub pclmap: *const ::std::os::raw::c_uchar,
    pub pcumap: *const ::std::os::raw::c_uchar,
    pub lc_time_curr: *mut __lc_time_data,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct threadlocaleinfostruct__bindgen_ty_1 {
    pub locale: *mut ::std::os::raw::c_char,
    pub wlocale: *mut u16,
    pub refcount: *mut ::std::os::raw::c_int,
    pub wrefcount: *mut ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_threadlocaleinfostruct__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<threadlocaleinfostruct__bindgen_ty_1>() ,
               32usize , concat ! (
               "Size of: " , stringify ! (
               threadlocaleinfostruct__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<threadlocaleinfostruct__bindgen_ty_1>()
                , 8usize , concat ! (
                "Alignment of " , stringify ! (
                threadlocaleinfostruct__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const threadlocaleinfostruct__bindgen_ty_1 ) )
                . locale as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                threadlocaleinfostruct__bindgen_ty_1 ) , "::" , stringify ! (
                locale ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const threadlocaleinfostruct__bindgen_ty_1 ) )
                . wlocale as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                threadlocaleinfostruct__bindgen_ty_1 ) , "::" , stringify ! (
                wlocale ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const threadlocaleinfostruct__bindgen_ty_1 ) )
                . refcount as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! (
                threadlocaleinfostruct__bindgen_ty_1 ) , "::" , stringify ! (
                refcount ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const threadlocaleinfostruct__bindgen_ty_1 ) )
                . wrefcount as * const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! (
                threadlocaleinfostruct__bindgen_ty_1 ) , "::" , stringify ! (
                wrefcount ) ));
}
impl Clone for threadlocaleinfostruct__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout_threadlocaleinfostruct() {
    assert_eq!(::std::mem::size_of::<threadlocaleinfostruct>() , 352usize ,
               concat ! ( "Size of: " , stringify ! ( threadlocaleinfostruct )
               ));
    assert_eq! (::std::mem::align_of::<threadlocaleinfostruct>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( threadlocaleinfostruct ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const threadlocaleinfostruct ) ) . refcount as
                * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( threadlocaleinfostruct
                ) , "::" , stringify ! ( refcount ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const threadlocaleinfostruct ) ) . lc_codepage
                as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( threadlocaleinfostruct
                ) , "::" , stringify ! ( lc_codepage ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const threadlocaleinfostruct ) ) .
                lc_collate_cp as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( threadlocaleinfostruct
                ) , "::" , stringify ! ( lc_collate_cp ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const threadlocaleinfostruct ) ) . lc_handle as
                * const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( threadlocaleinfostruct
                ) , "::" , stringify ! ( lc_handle ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const threadlocaleinfostruct ) ) . lc_id as *
                const _ as usize } , 36usize , concat ! (
                "Alignment of field: " , stringify ! ( threadlocaleinfostruct
                ) , "::" , stringify ! ( lc_id ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const threadlocaleinfostruct ) ) . lc_category
                as * const _ as usize } , 72usize , concat ! (
                "Alignment of field: " , stringify ! ( threadlocaleinfostruct
                ) , "::" , stringify ! ( lc_category ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const threadlocaleinfostruct ) ) . lc_clike as
                * const _ as usize } , 264usize , concat ! (
                "Alignment of field: " , stringify ! ( threadlocaleinfostruct
                ) , "::" , stringify ! ( lc_clike ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const threadlocaleinfostruct ) ) . mb_cur_max
                as * const _ as usize } , 268usize , concat ! (
                "Alignment of field: " , stringify ! ( threadlocaleinfostruct
                ) , "::" , stringify ! ( mb_cur_max ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const threadlocaleinfostruct ) ) .
                lconv_intl_refcount as * const _ as usize } , 272usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( threadlocaleinfostruct
                ) , "::" , stringify ! ( lconv_intl_refcount ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const threadlocaleinfostruct ) ) .
                lconv_num_refcount as * const _ as usize } , 280usize , concat
                ! (
                "Alignment of field: " , stringify ! ( threadlocaleinfostruct
                ) , "::" , stringify ! ( lconv_num_refcount ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const threadlocaleinfostruct ) ) .
                lconv_mon_refcount as * const _ as usize } , 288usize , concat
                ! (
                "Alignment of field: " , stringify ! ( threadlocaleinfostruct
                ) , "::" , stringify ! ( lconv_mon_refcount ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const threadlocaleinfostruct ) ) . lconv as *
                const _ as usize } , 296usize , concat ! (
                "Alignment of field: " , stringify ! ( threadlocaleinfostruct
                ) , "::" , stringify ! ( lconv ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const threadlocaleinfostruct ) ) .
                ctype1_refcount as * const _ as usize } , 304usize , concat !
                (
                "Alignment of field: " , stringify ! ( threadlocaleinfostruct
                ) , "::" , stringify ! ( ctype1_refcount ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const threadlocaleinfostruct ) ) . ctype1 as *
                const _ as usize } , 312usize , concat ! (
                "Alignment of field: " , stringify ! ( threadlocaleinfostruct
                ) , "::" , stringify ! ( ctype1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const threadlocaleinfostruct ) ) . pctype as *
                const _ as usize } , 320usize , concat ! (
                "Alignment of field: " , stringify ! ( threadlocaleinfostruct
                ) , "::" , stringify ! ( pctype ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const threadlocaleinfostruct ) ) . pclmap as *
                const _ as usize } , 328usize , concat ! (
                "Alignment of field: " , stringify ! ( threadlocaleinfostruct
                ) , "::" , stringify ! ( pclmap ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const threadlocaleinfostruct ) ) . pcumap as *
                const _ as usize } , 336usize , concat ! (
                "Alignment of field: " , stringify ! ( threadlocaleinfostruct
                ) , "::" , stringify ! ( pcumap ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const threadlocaleinfostruct ) ) . lc_time_curr
                as * const _ as usize } , 344usize , concat ! (
                "Alignment of field: " , stringify ! ( threadlocaleinfostruct
                ) , "::" , stringify ! ( lc_time_curr ) ));
}
impl Clone for threadlocaleinfostruct {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct threadmbcinfostruct([u8; 0]);
pub type pthreadlocinfo = *mut threadlocaleinfostruct;
pub type pthreadmbcinfo = *mut threadmbcinfostruct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __lc_time_data([u8; 0]);
#[repr(C)]
#[derive(Debug, Copy)]
pub struct localeinfo_struct {
    pub locinfo: pthreadlocinfo,
    pub mbcinfo: pthreadmbcinfo,
}
#[test]
fn bindgen_test_layout_localeinfo_struct() {
    assert_eq!(::std::mem::size_of::<localeinfo_struct>() , 16usize , concat !
               ( "Size of: " , stringify ! ( localeinfo_struct ) ));
    assert_eq! (::std::mem::align_of::<localeinfo_struct>() , 8usize , concat
                ! ( "Alignment of " , stringify ! ( localeinfo_struct ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const localeinfo_struct ) ) . locinfo as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( localeinfo_struct ) ,
                "::" , stringify ! ( locinfo ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const localeinfo_struct ) ) . mbcinfo as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( localeinfo_struct ) ,
                "::" , stringify ! ( mbcinfo ) ));
}
impl Clone for localeinfo_struct {
    fn clone(&self) -> Self { *self }
}
pub type _locale_tstruct = localeinfo_struct;
pub type _locale_t = *mut localeinfo_struct;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct tagLC_ID {
    pub wLanguage: ::std::os::raw::c_ushort,
    pub wCountry: ::std::os::raw::c_ushort,
    pub wCodePage: ::std::os::raw::c_ushort,
}
#[test]
fn bindgen_test_layout_tagLC_ID() {
    assert_eq!(::std::mem::size_of::<tagLC_ID>() , 6usize , concat ! (
               "Size of: " , stringify ! ( tagLC_ID ) ));
    assert_eq! (::std::mem::align_of::<tagLC_ID>() , 2usize , concat ! (
                "Alignment of " , stringify ! ( tagLC_ID ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const tagLC_ID ) ) . wLanguage as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( tagLC_ID ) , "::" ,
                stringify ! ( wLanguage ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const tagLC_ID ) ) . wCountry as * const _ as
                usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( tagLC_ID ) , "::" ,
                stringify ! ( wCountry ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const tagLC_ID ) ) . wCodePage as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( tagLC_ID ) , "::" ,
                stringify ! ( wCodePage ) ));
}
impl Clone for tagLC_ID {
    fn clone(&self) -> Self { *self }
}
pub type LC_ID = tagLC_ID;
pub type LPLC_ID = *mut tagLC_ID;
pub type threadlocinfo = threadlocaleinfostruct;
extern "C" {
    pub fn _errno() -> *mut ::std::os::raw::c_int;
}
extern "C" {
    pub fn _set_errno(_Value: ::std::os::raw::c_int) -> errno_t;
}
extern "C" {
    pub fn _get_errno(_Value: *mut ::std::os::raw::c_int) -> errno_t;
}
extern "C" {
    pub fn __threadid() -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn __threadhandle() -> usize;
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct max_align_t {
    pub __max_align_ll: ::std::os::raw::c_longlong,
    pub __max_align_ld: f64,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    assert_eq!(::std::mem::size_of::<max_align_t>() , 16usize , concat ! (
               "Size of: " , stringify ! ( max_align_t ) ));
    assert_eq! (::std::mem::align_of::<max_align_t>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( max_align_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const max_align_t ) ) . __max_align_ll as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( max_align_t ) , "::" ,
                stringify ! ( __max_align_ll ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const max_align_t ) ) . __max_align_ld as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( max_align_t ) , "::" ,
                stringify ! ( __max_align_ld ) ));
}
impl Clone for max_align_t {
    fn clone(&self) -> Self { *self }
}
pub type int_least8_t = ::std::os::raw::c_schar;
pub type uint_least8_t = ::std::os::raw::c_uchar;
