/* automatically generated by rust-bindgen */

#![allow(warnings)]
extern crate core;

#[allow(non_snake_case, non_camel_case_types, non_upper_case_globals)]
pub mod root {
    #[allow(unused_imports)]
    use self::super::root;
    pub mod std {
        #[allow(unused_imports)]
        use self::super::super::root;
        pub type string = [u64; 4usize];
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct basic_string {
            pub _address: u8,
        }
        pub type basic_string__Char_alloc_type = u8;
        pub type basic_string__Alloc_traits = u8;
        pub type basic_string_traits_type = u8;
        pub type basic_string_value_type = u8;
        pub type basic_string_allocator_type = u8;
        pub type basic_string_size_type = u8;
        pub type basic_string_difference_type = u8;
        pub type basic_string_reference = u8;
        pub type basic_string_const_reference = u8;
        pub type basic_string_pointer = u8;
        pub type basic_string_const_pointer = u8;
        pub type basic_string_iterator = u8;
        pub type basic_string_const_iterator = u8;
        pub type basic_string_const_reverse_iterator = u8;
        pub type basic_string_reverse_iterator = u8;
        pub type basic_string___const_iterator = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct basic_string__Alloc_hider {
            pub _address: u8,
        }

        pub type stack_size_type = u8;
        pub type stack_container_type = u8;
    }
    pub mod __gnu_cxx {
        #[allow(unused_imports)]
        use self::super::super::root;
    }
    pub type __int8_t = ::std::os::raw::c_schar;
    pub type __uint8_t = ::std::os::raw::c_uchar;
    pub type __int16_t = ::std::os::raw::c_short;
    pub type __uint16_t = ::std::os::raw::c_ushort;
    pub type __int32_t = ::std::os::raw::c_int;
    pub type __uint32_t = ::std::os::raw::c_uint;
    pub type __int64_t = ::std::os::raw::c_long;
    pub type __uint64_t = ::std::os::raw::c_ulong;
    pub type __off_t = ::std::os::raw::c_long;
    pub type __off64_t = ::std::os::raw::c_long;
    pub type __time_t = ::std::os::raw::c_long;
    pub type octave_idx_type = i64;
    pub type octave_f77_int_type = i32;
    pub type off_t = root::__off_t;
    pub type time_t = root::__time_t;
    pub type __gnuc_va_list = root::__builtin_va_list;
    pub type FILE = root::_IO_FILE;
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct _IO_marker {
        _unused: [u8; 0],
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct _IO_codecvt {
        _unused: [u8; 0],
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct _IO_wide_data {
        _unused: [u8; 0],
    }
    pub type _IO_lock_t = ::std::os::raw::c_void;
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct _IO_FILE {
        pub _flags: ::std::os::raw::c_int,
        pub _IO_read_ptr: *mut ::std::os::raw::c_char,
        pub _IO_read_end: *mut ::std::os::raw::c_char,
        pub _IO_read_base: *mut ::std::os::raw::c_char,
        pub _IO_write_base: *mut ::std::os::raw::c_char,
        pub _IO_write_ptr: *mut ::std::os::raw::c_char,
        pub _IO_write_end: *mut ::std::os::raw::c_char,
        pub _IO_buf_base: *mut ::std::os::raw::c_char,
        pub _IO_buf_end: *mut ::std::os::raw::c_char,
        pub _IO_save_base: *mut ::std::os::raw::c_char,
        pub _IO_backup_base: *mut ::std::os::raw::c_char,
        pub _IO_save_end: *mut ::std::os::raw::c_char,
        pub _markers: *mut root::_IO_marker,
        pub _chain: *mut root::_IO_FILE,
        pub _fileno: ::std::os::raw::c_int,
        pub _flags2: ::std::os::raw::c_int,
        pub _old_offset: root::__off_t,
        pub _cur_column: ::std::os::raw::c_ushort,
        pub _vtable_offset: ::std::os::raw::c_schar,
        pub _shortbuf: [::std::os::raw::c_char; 1usize],
        pub _lock: *mut root::_IO_lock_t,
        pub _offset: root::__off64_t,
        pub _codecvt: *mut root::_IO_codecvt,
        pub _wide_data: *mut root::_IO_wide_data,
        pub _freeres_list: *mut root::_IO_FILE,
        pub _freeres_buf: *mut ::std::os::raw::c_void,
        pub __pad5: usize,
        pub _mode: ::std::os::raw::c_int,
        pub _unused2: [::std::os::raw::c_char; 20usize],
    }
    #[test]
    fn bindgen_test_layout__IO_FILE() {
        assert_eq!(
            ::core::mem::size_of::<_IO_FILE>(),
            216usize,
            concat!("Size of: ", stringify!(_IO_FILE))
        );
        assert_eq!(
            ::core::mem::align_of::<_IO_FILE>(),
            8usize,
            concat!("Alignment of ", stringify!(_IO_FILE))
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._flags as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_flags)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._IO_read_ptr as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_read_ptr)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._IO_read_end as *const _ as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_read_end)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._IO_read_base as *const _ as usize },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_read_base)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._IO_write_base as *const _ as usize },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_write_base)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._IO_write_ptr as *const _ as usize },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_write_ptr)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._IO_write_end as *const _ as usize },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_write_end)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._IO_buf_base as *const _ as usize },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_buf_base)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._IO_buf_end as *const _ as usize },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_buf_end)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._IO_save_base as *const _ as usize },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_save_base)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._IO_backup_base as *const _ as usize },
            80usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_backup_base)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._IO_save_end as *const _ as usize },
            88usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_save_end)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._markers as *const _ as usize },
            96usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_markers)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._chain as *const _ as usize },
            104usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_chain)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._fileno as *const _ as usize },
            112usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_fileno)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._flags2 as *const _ as usize },
            116usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_flags2)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._old_offset as *const _ as usize },
            120usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_old_offset)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._cur_column as *const _ as usize },
            128usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_cur_column)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._vtable_offset as *const _ as usize },
            130usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_vtable_offset)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._shortbuf as *const _ as usize },
            131usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_shortbuf)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._lock as *const _ as usize },
            136usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_lock)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._offset as *const _ as usize },
            144usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_offset)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._codecvt as *const _ as usize },
            152usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_codecvt)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._wide_data as *const _ as usize },
            160usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_wide_data)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._freeres_list as *const _ as usize },
            168usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_freeres_list)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._freeres_buf as *const _ as usize },
            176usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_freeres_buf)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<_IO_FILE>())).__pad5 as *const _ as usize },
            184usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(__pad5)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._mode as *const _ as usize },
            192usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_mode)
            )
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<_IO_FILE>()))._unused2 as *const _ as usize },
            196usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_unused2)
            )
        );
    }
    pub type va_list = root::__gnuc_va_list;
    pub mod octave {
        #[allow(unused_imports)]
        use self::super::super::root;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct refcount<T> {
            pub count: root::octave::refcount_count_type<T>,
            pub _phantom_0: ::core::marker::PhantomData<::core::cell::UnsafeCell<T>>,
        }
        pub type refcount_count_type<T> = T;
        #[repr(C)]
        pub struct execution_exception__bindgen_vtable(::std::os::raw::c_void);
        #[repr(C)]
        #[derive(Debug)]
        pub struct execution_exception {
            pub vtable_: *const execution_exception__bindgen_vtable,
            pub m_stack_trace: root::std::string,
        }
        #[test]
        fn bindgen_test_layout_execution_exception() {
            assert_eq!(
                ::core::mem::size_of::<execution_exception>(),
                40usize,
                concat!("Size of: ", stringify!(execution_exception))
            );
            assert_eq!(
                ::core::mem::align_of::<execution_exception>(),
                8usize,
                concat!("Alignment of ", stringify!(execution_exception))
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<execution_exception>())).m_stack_trace as *const _
                        as usize
                },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(execution_exception),
                    "::",
                    stringify!(m_stack_trace)
                )
            );
        }
        #[repr(C)]
        #[derive(Debug)]
        pub struct exit_exception {
            pub m_exit_status: ::std::os::raw::c_int,
            pub m_safe_to_return: bool,
        }
        #[test]
        fn bindgen_test_layout_exit_exception() {
            assert_eq!(
                ::core::mem::size_of::<exit_exception>(),
                8usize,
                concat!("Size of: ", stringify!(exit_exception))
            );
            assert_eq!(
                ::core::mem::align_of::<exit_exception>(),
                4usize,
                concat!("Alignment of ", stringify!(exit_exception))
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<exit_exception>())).m_exit_status as *const _ as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(exit_exception),
                    "::",
                    stringify!(m_exit_status)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<exit_exception>())).m_safe_to_return as *const _
                        as usize
                },
                4usize,
                concat!(
                    "Offset of field: ",
                    stringify!(exit_exception),
                    "::",
                    stringify!(m_safe_to_return)
                )
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct interrupt_exception {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_interrupt_exception() {
            assert_eq!(
                ::core::mem::size_of::<interrupt_exception>(),
                1usize,
                concat!("Size of: ", stringify!(interrupt_exception))
            );
            assert_eq!(
                ::core::mem::align_of::<interrupt_exception>(),
                1usize,
                concat!("Alignment of ", stringify!(interrupt_exception))
            );
        }
        #[repr(C)]
        #[derive(Debug)]
        pub struct index_exception {
            pub _base: root::octave::execution_exception,
            pub index: root::std::string,
            pub nd: root::octave_idx_type,
            pub dim: root::octave_idx_type,
            pub var: root::std::string,
        }
        #[test]
        fn bindgen_test_layout_index_exception() {
            assert_eq!(
                ::core::mem::size_of::<index_exception>(),
                120usize,
                concat!("Size of: ", stringify!(index_exception))
            );
            assert_eq!(
                ::core::mem::align_of::<index_exception>(),
                8usize,
                concat!("Alignment of ", stringify!(index_exception))
            );
            assert_eq!(
                unsafe { &(*(::core::ptr::null::<index_exception>())).index as *const _ as usize },
                40usize,
                concat!(
                    "Offset of field: ",
                    stringify!(index_exception),
                    "::",
                    stringify!(index)
                )
            );
            assert_eq!(
                unsafe { &(*(::core::ptr::null::<index_exception>())).nd as *const _ as usize },
                72usize,
                concat!(
                    "Offset of field: ",
                    stringify!(index_exception),
                    "::",
                    stringify!(nd)
                )
            );
            assert_eq!(
                unsafe { &(*(::core::ptr::null::<index_exception>())).dim as *const _ as usize },
                80usize,
                concat!(
                    "Offset of field: ",
                    stringify!(index_exception),
                    "::",
                    stringify!(dim)
                )
            );
            assert_eq!(
                unsafe { &(*(::core::ptr::null::<index_exception>())).var as *const _ as usize },
                88usize,
                concat!(
                    "Offset of field: ",
                    stringify!(index_exception),
                    "::",
                    stringify!(var)
                )
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZNK6octave15index_exception10expressionB5cxx11Ev"]
            pub fn index_exception_expression(
                this: *const root::octave::index_exception,
            ) -> root::std::string;
        }
        impl index_exception {
            #[inline]
            pub unsafe fn expression(&self) -> root::std::string {
                index_exception_expression(self)
            }
        }
        extern "C" {
            #[link_name = "\u{1}_ZNK6octave15index_exception7messageB5cxx11Ev"]
            pub fn index_exception_message(this: *mut ::std::os::raw::c_void) -> root::std::string;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave29err_nan_to_logical_conversionEv"]
            pub fn err_nan_to_logical_conversion();
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave31err_nan_to_character_conversionEv"]
            pub fn err_nan_to_character_conversion();
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave17err_nonconformantEPKcll"]
            pub fn err_nonconformant(
                op: *const ::std::os::raw::c_char,
                op1_len: root::octave_idx_type,
                op2_len: root::octave_idx_type,
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave17err_nonconformantEPKcllll"]
            pub fn err_nonconformant1(
                op: *const ::std::os::raw::c_char,
                op1_nr: root::octave_idx_type,
                op1_nc: root::octave_idx_type,
                op2_nr: root::octave_idx_type,
                op2_nc: root::octave_idx_type,
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave17err_nonconformantEPKcRK10dim_vectorS4_"]
            pub fn err_nonconformant2(
                op: *const ::std::os::raw::c_char,
                op1_dims: *const root::dim_vector,
                op2_dims: *const root::dim_vector,
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave22err_index_out_of_rangeEiillRK10dim_vector"]
            pub fn err_index_out_of_range(
                nd: ::std::os::raw::c_int,
                dim: ::std::os::raw::c_int,
                iext: root::octave_idx_type,
                ext: root::octave_idx_type,
                d: *const root::dim_vector,
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave22err_index_out_of_rangeEiill"]
            pub fn err_index_out_of_range1(
                nd: ::std::os::raw::c_int,
                dim: ::std::os::raw::c_int,
                iext: root::octave_idx_type,
                ext: root::octave_idx_type,
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave26err_del_index_out_of_rangeEbll"]
            pub fn err_del_index_out_of_range(
                is1d: bool,
                iext: root::octave_idx_type,
                ext: root::octave_idx_type,
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave17err_invalid_indexEdllRKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
            pub fn err_invalid_index(
                n: f64,
                nd: root::octave_idx_type,
                dim: root::octave_idx_type,
                var: *const root::std::string,
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave17err_invalid_indexElllRKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
            pub fn err_invalid_index1(
                n: root::octave_idx_type,
                nd: root::octave_idx_type,
                dim: root::octave_idx_type,
                var: *const root::std::string,
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave17err_invalid_indexERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEllS7_"]
            pub fn err_invalid_index2(
                idx: *const root::std::string,
                nd: root::octave_idx_type,
                dim: root::octave_idx_type,
                var: *const root::std::string,
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave18err_invalid_resizeEv"]
            pub fn err_invalid_resize();
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave20warn_singular_matrixEd"]
            pub fn warn_singular_matrix(rcond: f64);
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct numeric_limits {
            pub _address: u8,
        }
        #[test]
        fn __bindgen_test_layout_numeric_limits_open0_double_close0_instantiation() {
            assert_eq!(
                ::core::mem::size_of::<root::octave::numeric_limits>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::octave::numeric_limits)
                )
            );
            assert_eq!(
                ::core::mem::align_of::<root::octave::numeric_limits>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::octave::numeric_limits)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_numeric_limits_open0_float_close0_instantiation() {
            assert_eq!(
                ::core::mem::size_of::<root::octave::numeric_limits>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::octave::numeric_limits)
                )
            );
            assert_eq!(
                ::core::mem::align_of::<root::octave::numeric_limits>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::octave::numeric_limits)
                )
            );
        }
        pub mod math {
            #[allow(unused_imports)]
            use self::super::super::super::root;
            extern "C" {
                #[link_name = "\u{1}_ZN6octave4math4isnaEd"]
                pub fn isna(x: f64) -> bool;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN6octave4math4isnaEf"]
                pub fn isna1(x: f32) -> bool;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN6octave4math4isnaERKSt7complexIdE"]
                pub fn isna2(x: *const root::Complex) -> bool;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN6octave4math4isnaERKSt7complexIfE"]
                pub fn isna3(x: *const root::FloatComplex) -> bool;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN6octave4math12is_NaN_or_NAERKSt7complexIdE"]
                pub fn is_NaN_or_NA(x: *const root::Complex) -> bool;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN6octave4math12is_NaN_or_NAERKSt7complexIfE"]
                pub fn is_NaN_or_NA1(x: *const root::FloatComplex) -> bool;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN6octave4math13negative_signEd"]
                pub fn negative_sign(x: f64) -> bool;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN6octave4math13negative_signEf"]
                pub fn negative_sign1(x: f32) -> bool;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN6octave4math4acosERKSt7complexIdE"]
                pub fn acos(x: *const root::Complex) -> root::Complex;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN6octave4math4acosERKSt7complexIfE"]
                pub fn acos1(x: *const root::FloatComplex) -> root::FloatComplex;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN6octave4math4asinERKSt7complexIdE"]
                pub fn asin(x: *const root::Complex) -> root::Complex;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN6octave4math4asinERKSt7complexIfE"]
                pub fn asin1(x: *const root::FloatComplex) -> root::FloatComplex;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN6octave4math4log2ERKSt7complexIdE"]
                pub fn log2(x: *const root::Complex) -> root::Complex;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN6octave4math4log2ERKSt7complexIfE"]
                pub fn log21(x: *const root::FloatComplex) -> root::FloatComplex;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN6octave4math4log2EdRi"]
                pub fn log22(x: f64, exp: *mut ::std::os::raw::c_int) -> f64;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN6octave4math4log2EfRi"]
                pub fn log23(x: f32, exp: *mut ::std::os::raw::c_int) -> f32;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN6octave4math4log2ERKSt7complexIdERi"]
                pub fn log24(
                    x: *const root::Complex,
                    exp: *mut ::std::os::raw::c_int,
                ) -> root::Complex;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN6octave4math4log2ERKSt7complexIfERi"]
                pub fn log25(
                    x: *const root::FloatComplex,
                    exp: *mut ::std::os::raw::c_int,
                ) -> root::FloatComplex;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN6octave4math5frexpEdPi"]
                pub fn frexp(x: f64, expptr: *mut ::std::os::raw::c_int) -> f64;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN6octave4math5frexpEfPi"]
                pub fn frexp1(x: f32, expptr: *mut ::std::os::raw::c_int) -> f32;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN6octave4math8nint_bigEd"]
                pub fn nint_big(x: f64) -> root::octave_idx_type;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN6octave4math8nint_bigEf"]
                pub fn nint_big1(x: f32) -> root::octave_idx_type;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN6octave4math4nintEd"]
                pub fn nint(x: f64) -> ::std::os::raw::c_int;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN6octave4math4nintEf"]
                pub fn nint1(x: f32) -> ::std::os::raw::c_int;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN6octave4math7rc_acosEd"]
                pub fn rc_acos(arg1: f64) -> root::Complex;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN6octave4math7rc_acosEf"]
                pub fn rc_acos1(arg1: f32) -> root::FloatComplex;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN6octave4math8rc_acoshEd"]
                pub fn rc_acosh(arg1: f64) -> root::Complex;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN6octave4math8rc_acoshEf"]
                pub fn rc_acosh1(arg1: f32) -> root::FloatComplex;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN6octave4math7rc_asinEd"]
                pub fn rc_asin(arg1: f64) -> root::Complex;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN6octave4math7rc_asinEf"]
                pub fn rc_asin1(arg1: f32) -> root::FloatComplex;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN6octave4math8rc_atanhEd"]
                pub fn rc_atanh(arg1: f64) -> root::Complex;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN6octave4math8rc_atanhEf"]
                pub fn rc_atanh1(arg1: f32) -> root::FloatComplex;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN6octave4math6rc_logEd"]
                pub fn rc_log(arg1: f64) -> root::Complex;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN6octave4math6rc_logEf"]
                pub fn rc_log1(arg1: f32) -> root::FloatComplex;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN6octave4math7rc_log2Ed"]
                pub fn rc_log2(arg1: f64) -> root::Complex;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN6octave4math7rc_log2Ef"]
                pub fn rc_log21(arg1: f32) -> root::FloatComplex;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN6octave4math8rc_log10Ed"]
                pub fn rc_log10(arg1: f64) -> root::Complex;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN6octave4math8rc_log10Ef"]
                pub fn rc_log101(arg1: f32) -> root::FloatComplex;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN6octave4math7rc_sqrtEd"]
                pub fn rc_sqrt(arg1: f64) -> root::Complex;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN6octave4math7rc_sqrtEf"]
                pub fn rc_sqrt1(arg1: f32) -> root::FloatComplex;
            }
            #[repr(C)]
            pub struct aepbalance__bindgen_vtable(::std::os::raw::c_void);
            #[repr(C)]
            pub struct aepbalance<MT> {
                pub vtable_: *const aepbalance__bindgen_vtable,
                pub balanced_mat: MT,
                pub scale: root::octave::math::aepbalance_VT,
                pub ilo: root::octave_idx_type,
                pub ihi: root::octave_idx_type,
                pub job: ::std::os::raw::c_char,
                pub _phantom_0: ::core::marker::PhantomData<::core::cell::UnsafeCell<MT>>,
            }
            pub type aepbalance_VT = [u8; 0usize];
            #[repr(C)]
            pub struct gepbalance<T> {
                pub balanced_mat: T,
                pub balanced_mat2: T,
                pub balancing_mat: root::octave::math::gepbalance_RT,
                pub balancing_mat2: root::octave::math::gepbalance_RT,
                pub _phantom_0: ::core::marker::PhantomData<::core::cell::UnsafeCell<T>>,
            }
            pub type gepbalance_RT = [u8; 0usize];
            #[repr(C)]
            pub struct chol<T> {
                pub chol_mat: T,
                pub xrcond: root::octave::math::chol_COND_T,
                pub is_upper: bool,
                pub _phantom_0: ::core::marker::PhantomData<::core::cell::UnsafeCell<T>>,
            }
            pub type chol_VT = [u8; 0usize];
            pub type chol_COND_T = [u8; 0usize];
            #[repr(C)]
            #[derive(Debug)]
            pub struct hess<T> {
                pub hess_mat: T,
                pub unitary_hess_mat: T,
                pub _phantom_0: ::core::marker::PhantomData<::core::cell::UnsafeCell<T>>,
            }
            #[repr(C)]
            #[derive(Debug)]
            pub struct schur<T> {
                pub schur_mat: T,
                pub unitary_mat: T,
                pub _phantom_0: ::core::marker::PhantomData<::core::cell::UnsafeCell<T>>,
            }
            #[repr(C)]
            pub struct svd<T> {
                pub m_type: root::octave::math::svd_Type,
                pub m_driver: root::octave::math::svd_Driver,
                pub left_sm: T,
                pub sigma: root::octave::math::svd_DM_T,
                pub right_sm: T,
                pub _phantom_0: ::core::marker::PhantomData<::core::cell::UnsafeCell<T>>,
            }
            pub type svd_DM_T = [u8; 0usize];
            pub const svd_Type_std: root::octave::math::svd_Type = 0;
            pub const svd_Type_economy: root::octave::math::svd_Type = 0;
            pub const svd_Type_sigma_only: root::octave::math::svd_Type = 0;
            pub type svd_Type = i32;
            pub const svd_Driver_GESVD: root::octave::math::svd_Driver = 0;
            pub const svd_Driver_GESDD: root::octave::math::svd_Driver = 0;
            pub type svd_Driver = i32;
            pub type svd_P = [u8; 0usize];
            pub type svd_DM_P = [u8; 0usize];
            #[repr(C)]
            pub struct gsvd<T> {
                pub type_: root::octave::math::gsvd_Type,
                pub sigmaA: [u8; 0usize],
                pub sigmaB: [u8; 0usize],
                pub left_smA: T,
                pub left_smB: T,
                pub right_sm: T,
                pub R: T,
                pub _phantom_0: ::core::marker::PhantomData<::core::cell::UnsafeCell<T>>,
            }
            pub const gsvd_Type_std: root::octave::math::gsvd_Type = 0;
            pub const gsvd_Type_economy: root::octave::math::gsvd_Type = 0;
            pub const gsvd_Type_sigma_only: root::octave::math::gsvd_Type = 0;
            pub type gsvd_Type = i32;
            pub type gsvd_P = [u8; 0usize];
            pub type gsvd_real_matrix = [u8; 0usize];
            #[repr(C)]
            pub struct lu__bindgen_vtable(::std::os::raw::c_void);
            #[repr(C)]
            #[derive(Debug)]
            pub struct lu<T> {
                pub vtable_: *const lu__bindgen_vtable,
                pub a_fact: T,
                pub l_fact: T,
                pub ipvt: root::Array<root::octave_f77_int_type>,
                pub _phantom_0: ::core::marker::PhantomData<::core::cell::UnsafeCell<T>>,
            }
            pub type lu_VT = [u8; 0usize];
            pub type lu_ELT_T = [u8; 0usize];
            #[repr(C)]
            pub struct qr__bindgen_vtable(::std::os::raw::c_void);
            #[repr(C)]
            #[derive(Debug)]
            pub struct qr<T> {
                pub vtable_: *const qr__bindgen_vtable,
                pub q: T,
                pub r: T,
                pub _phantom_0: ::core::marker::PhantomData<::core::cell::UnsafeCell<T>>,
            }
            pub type qr_ELT_T = [u8; 0usize];
            pub type qr_RV_T = [u8; 0usize];
            pub type qr_CV_T = [u8; 0usize];
            pub const qr_type_std: root::octave::math::qr_type = 0;
            pub const qr_type_raw: root::octave::math::qr_type = 0;
            pub const qr_type_economy: root::octave::math::qr_type = 0;
            pub type qr_type = i32;
            extern "C" {
                #[link_name = "\u{1}_ZN6octave4math18warn_qrupdate_onceEv"]
                pub fn warn_qrupdate_once();
            }
        }
        pub mod sys {
            #[allow(unused_imports)]
            use self::super::super::super::root;
            #[repr(C)]
            #[derive(Debug)]
            pub struct time {
                pub ot_unix_time: root::time_t,
                pub ot_usec: ::std::os::raw::c_long,
            }
            #[test]
            fn bindgen_test_layout_time() {
                assert_eq!(
                    ::core::mem::size_of::<time>(),
                    16usize,
                    concat!("Size of: ", stringify!(time))
                );
                assert_eq!(
                    ::core::mem::align_of::<time>(),
                    8usize,
                    concat!("Alignment of ", stringify!(time))
                );
                assert_eq!(
                    unsafe { &(*(::core::ptr::null::<time>())).ot_unix_time as *const _ as usize },
                    0usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(time),
                        "::",
                        stringify!(ot_unix_time)
                    )
                );
                assert_eq!(
                    unsafe { &(*(::core::ptr::null::<time>())).ot_usec as *const _ as usize },
                    8usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(time),
                        "::",
                        stringify!(ot_usec)
                    )
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN6octave3sys4time5stampEv"]
                pub fn time_stamp(this: *mut root::octave::sys::time);
            }
            extern "C" {
                #[link_name = "\u{1}_ZNK6octave3sys4time5ctimeB5cxx11Ev"]
                pub fn time_ctime(this: *const root::octave::sys::time) -> root::std::string;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN6octave3sys4timeC1Ed"]
                pub fn time_time(this: *mut root::octave::sys::time, d: f64);
            }
            extern "C" {
                #[link_name = "\u{1}_ZN6octave3sys4timeC1ERKNS0_7base_tmE"]
                pub fn time_time1(
                    this: *mut root::octave::sys::time,
                    tm: *const root::octave::sys::base_tm,
                );
            }
            impl time {
                #[inline]
                pub unsafe fn stamp(&mut self) {
                    time_stamp(self)
                }
                #[inline]
                pub unsafe fn ctime(&self) -> root::std::string {
                    time_ctime(self)
                }
                #[inline]
                pub unsafe fn new(d: f64) -> Self {
                    let mut __bindgen_tmp = ::core::mem::uninitialized();
                    time_time(&mut __bindgen_tmp, d);
                    __bindgen_tmp
                }
                #[inline]
                pub unsafe fn new1(tm: *const root::octave::sys::base_tm) -> Self {
                    let mut __bindgen_tmp = ::core::mem::uninitialized();
                    time_time1(&mut __bindgen_tmp, tm);
                    __bindgen_tmp
                }
            }
            #[repr(C)]
            pub struct base_tm__bindgen_vtable(::std::os::raw::c_void);
            #[repr(C)]
            #[derive(Debug)]
            pub struct base_tm {
                pub vtable_: *const base_tm__bindgen_vtable,
                pub m_usec: ::std::os::raw::c_int,
                pub m_sec: ::std::os::raw::c_int,
                pub m_min: ::std::os::raw::c_int,
                pub m_hour: ::std::os::raw::c_int,
                pub m_mday: ::std::os::raw::c_int,
                pub m_mon: ::std::os::raw::c_int,
                pub m_year: ::std::os::raw::c_int,
                pub m_wday: ::std::os::raw::c_int,
                pub m_yday: ::std::os::raw::c_int,
                pub m_isdst: ::std::os::raw::c_int,
                pub m_gmtoff: ::std::os::raw::c_long,
                pub m_zone: root::std::string,
            }
            #[test]
            fn bindgen_test_layout_base_tm() {
                assert_eq!(
                    ::core::mem::size_of::<base_tm>(),
                    88usize,
                    concat!("Size of: ", stringify!(base_tm))
                );
                assert_eq!(
                    ::core::mem::align_of::<base_tm>(),
                    8usize,
                    concat!("Alignment of ", stringify!(base_tm))
                );
                assert_eq!(
                    unsafe { &(*(::core::ptr::null::<base_tm>())).m_usec as *const _ as usize },
                    8usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(base_tm),
                        "::",
                        stringify!(m_usec)
                    )
                );
                assert_eq!(
                    unsafe { &(*(::core::ptr::null::<base_tm>())).m_sec as *const _ as usize },
                    12usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(base_tm),
                        "::",
                        stringify!(m_sec)
                    )
                );
                assert_eq!(
                    unsafe { &(*(::core::ptr::null::<base_tm>())).m_min as *const _ as usize },
                    16usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(base_tm),
                        "::",
                        stringify!(m_min)
                    )
                );
                assert_eq!(
                    unsafe { &(*(::core::ptr::null::<base_tm>())).m_hour as *const _ as usize },
                    20usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(base_tm),
                        "::",
                        stringify!(m_hour)
                    )
                );
                assert_eq!(
                    unsafe { &(*(::core::ptr::null::<base_tm>())).m_mday as *const _ as usize },
                    24usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(base_tm),
                        "::",
                        stringify!(m_mday)
                    )
                );
                assert_eq!(
                    unsafe { &(*(::core::ptr::null::<base_tm>())).m_mon as *const _ as usize },
                    28usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(base_tm),
                        "::",
                        stringify!(m_mon)
                    )
                );
                assert_eq!(
                    unsafe { &(*(::core::ptr::null::<base_tm>())).m_year as *const _ as usize },
                    32usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(base_tm),
                        "::",
                        stringify!(m_year)
                    )
                );
                assert_eq!(
                    unsafe { &(*(::core::ptr::null::<base_tm>())).m_wday as *const _ as usize },
                    36usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(base_tm),
                        "::",
                        stringify!(m_wday)
                    )
                );
                assert_eq!(
                    unsafe { &(*(::core::ptr::null::<base_tm>())).m_yday as *const _ as usize },
                    40usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(base_tm),
                        "::",
                        stringify!(m_yday)
                    )
                );
                assert_eq!(
                    unsafe { &(*(::core::ptr::null::<base_tm>())).m_isdst as *const _ as usize },
                    44usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(base_tm),
                        "::",
                        stringify!(m_isdst)
                    )
                );
                assert_eq!(
                    unsafe { &(*(::core::ptr::null::<base_tm>())).m_gmtoff as *const _ as usize },
                    48usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(base_tm),
                        "::",
                        stringify!(m_gmtoff)
                    )
                );
                assert_eq!(
                    unsafe { &(*(::core::ptr::null::<base_tm>())).m_zone as *const _ as usize },
                    56usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(base_tm),
                        "::",
                        stringify!(m_zone)
                    )
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN6octave3sys7base_tm4usecEi"]
                pub fn base_tm_usec(
                    this: *mut root::octave::sys::base_tm,
                    v: ::std::os::raw::c_int,
                ) -> *mut root::octave::sys::base_tm;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN6octave3sys7base_tm3secEi"]
                pub fn base_tm_sec(
                    this: *mut root::octave::sys::base_tm,
                    v: ::std::os::raw::c_int,
                ) -> *mut root::octave::sys::base_tm;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN6octave3sys7base_tm3minEi"]
                pub fn base_tm_min(
                    this: *mut root::octave::sys::base_tm,
                    v: ::std::os::raw::c_int,
                ) -> *mut root::octave::sys::base_tm;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN6octave3sys7base_tm4hourEi"]
                pub fn base_tm_hour(
                    this: *mut root::octave::sys::base_tm,
                    v: ::std::os::raw::c_int,
                ) -> *mut root::octave::sys::base_tm;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN6octave3sys7base_tm4mdayEi"]
                pub fn base_tm_mday(
                    this: *mut root::octave::sys::base_tm,
                    v: ::std::os::raw::c_int,
                ) -> *mut root::octave::sys::base_tm;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN6octave3sys7base_tm3monEi"]
                pub fn base_tm_mon(
                    this: *mut root::octave::sys::base_tm,
                    v: ::std::os::raw::c_int,
                ) -> *mut root::octave::sys::base_tm;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN6octave3sys7base_tm4yearEi"]
                pub fn base_tm_year(
                    this: *mut root::octave::sys::base_tm,
                    v: ::std::os::raw::c_int,
                ) -> *mut root::octave::sys::base_tm;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN6octave3sys7base_tm4wdayEi"]
                pub fn base_tm_wday(
                    this: *mut root::octave::sys::base_tm,
                    v: ::std::os::raw::c_int,
                ) -> *mut root::octave::sys::base_tm;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN6octave3sys7base_tm4ydayEi"]
                pub fn base_tm_yday(
                    this: *mut root::octave::sys::base_tm,
                    v: ::std::os::raw::c_int,
                ) -> *mut root::octave::sys::base_tm;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN6octave3sys7base_tm5isdstEi"]
                pub fn base_tm_isdst(
                    this: *mut root::octave::sys::base_tm,
                    v: ::std::os::raw::c_int,
                ) -> *mut root::octave::sys::base_tm;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN6octave3sys7base_tm6gmtoffEl"]
                pub fn base_tm_gmtoff(
                    this: *mut root::octave::sys::base_tm,
                    v: ::std::os::raw::c_long,
                ) -> *mut root::octave::sys::base_tm;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN6octave3sys7base_tm4zoneERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
                pub fn base_tm_zone(
                    this: *mut root::octave::sys::base_tm,
                    s: *const root::std::string,
                ) -> *mut root::octave::sys::base_tm;
            }
            extern "C" {
                #[link_name = "\u{1}_ZNK6octave3sys7base_tm8strftimeERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
                pub fn base_tm_strftime(
                    this: *const root::octave::sys::base_tm,
                    fmt: *const root::std::string,
                ) -> root::std::string;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN6octave3sys7base_tm4initEPv"]
                pub fn base_tm_init(
                    this: *mut root::octave::sys::base_tm,
                    p: *mut ::std::os::raw::c_void,
                );
            }
            impl base_tm {
                #[inline]
                pub unsafe fn usec(
                    &mut self,
                    v: ::std::os::raw::c_int,
                ) -> *mut root::octave::sys::base_tm {
                    base_tm_usec(self, v)
                }
                #[inline]
                pub unsafe fn sec(
                    &mut self,
                    v: ::std::os::raw::c_int,
                ) -> *mut root::octave::sys::base_tm {
                    base_tm_sec(self, v)
                }
                #[inline]
                pub unsafe fn min(
                    &mut self,
                    v: ::std::os::raw::c_int,
                ) -> *mut root::octave::sys::base_tm {
                    base_tm_min(self, v)
                }
                #[inline]
                pub unsafe fn hour(
                    &mut self,
                    v: ::std::os::raw::c_int,
                ) -> *mut root::octave::sys::base_tm {
                    base_tm_hour(self, v)
                }
                #[inline]
                pub unsafe fn mday(
                    &mut self,
                    v: ::std::os::raw::c_int,
                ) -> *mut root::octave::sys::base_tm {
                    base_tm_mday(self, v)
                }
                #[inline]
                pub unsafe fn mon(
                    &mut self,
                    v: ::std::os::raw::c_int,
                ) -> *mut root::octave::sys::base_tm {
                    base_tm_mon(self, v)
                }
                #[inline]
                pub unsafe fn year(
                    &mut self,
                    v: ::std::os::raw::c_int,
                ) -> *mut root::octave::sys::base_tm {
                    base_tm_year(self, v)
                }
                #[inline]
                pub unsafe fn wday(
                    &mut self,
                    v: ::std::os::raw::c_int,
                ) -> *mut root::octave::sys::base_tm {
                    base_tm_wday(self, v)
                }
                #[inline]
                pub unsafe fn yday(
                    &mut self,
                    v: ::std::os::raw::c_int,
                ) -> *mut root::octave::sys::base_tm {
                    base_tm_yday(self, v)
                }
                #[inline]
                pub unsafe fn isdst(
                    &mut self,
                    v: ::std::os::raw::c_int,
                ) -> *mut root::octave::sys::base_tm {
                    base_tm_isdst(self, v)
                }
                #[inline]
                pub unsafe fn gmtoff(
                    &mut self,
                    v: ::std::os::raw::c_long,
                ) -> *mut root::octave::sys::base_tm {
                    base_tm_gmtoff(self, v)
                }
                #[inline]
                pub unsafe fn zone(
                    &mut self,
                    s: *const root::std::string,
                ) -> *mut root::octave::sys::base_tm {
                    base_tm_zone(self, s)
                }
                #[inline]
                pub unsafe fn strftime(&self, fmt: *const root::std::string) -> root::std::string {
                    base_tm_strftime(self, fmt)
                }
                #[inline]
                pub unsafe fn init(&mut self, p: *mut ::std::os::raw::c_void) {
                    base_tm_init(self, p)
                }
            }
            #[repr(C)]
            #[derive(Debug)]
            pub struct localtime {
                pub _base: root::octave::sys::base_tm,
            }
            #[test]
            fn bindgen_test_layout_localtime() {
                assert_eq!(
                    ::core::mem::size_of::<localtime>(),
                    88usize,
                    concat!("Size of: ", stringify!(localtime))
                );
                assert_eq!(
                    ::core::mem::align_of::<localtime>(),
                    8usize,
                    concat!("Alignment of ", stringify!(localtime))
                );
            }
            #[repr(C)]
            #[derive(Debug)]
            pub struct gmtime {
                pub _base: root::octave::sys::base_tm,
            }
            #[test]
            fn bindgen_test_layout_gmtime() {
                assert_eq!(
                    ::core::mem::size_of::<gmtime>(),
                    88usize,
                    concat!("Size of: ", stringify!(gmtime))
                );
                assert_eq!(
                    ::core::mem::align_of::<gmtime>(),
                    8usize,
                    concat!("Alignment of ", stringify!(gmtime))
                );
            }
            #[repr(C)]
            #[derive(Debug)]
            pub struct strptime {
                pub _base: root::octave::sys::base_tm,
                pub nchars: ::std::os::raw::c_int,
            }
            #[test]
            fn bindgen_test_layout_strptime() {
                assert_eq!(
                    ::core::mem::size_of::<strptime>(),
                    96usize,
                    concat!("Size of: ", stringify!(strptime))
                );
                assert_eq!(
                    ::core::mem::align_of::<strptime>(),
                    8usize,
                    concat!("Alignment of ", stringify!(strptime))
                );
                assert_eq!(
                    unsafe { &(*(::core::ptr::null::<strptime>())).nchars as *const _ as usize },
                    88usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(strptime),
                        "::",
                        stringify!(nchars)
                    )
                );
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct cpu_time {
                pub m_usr_sec: root::time_t,
                pub m_sys_sec: root::time_t,
                pub m_usr_usec: ::std::os::raw::c_long,
                pub m_sys_usec: ::std::os::raw::c_long,
            }
            #[test]
            fn bindgen_test_layout_cpu_time() {
                assert_eq!(
                    ::core::mem::size_of::<cpu_time>(),
                    32usize,
                    concat!("Size of: ", stringify!(cpu_time))
                );
                assert_eq!(
                    ::core::mem::align_of::<cpu_time>(),
                    8usize,
                    concat!("Alignment of ", stringify!(cpu_time))
                );
                assert_eq!(
                    unsafe { &(*(::core::ptr::null::<cpu_time>())).m_usr_sec as *const _ as usize },
                    0usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(cpu_time),
                        "::",
                        stringify!(m_usr_sec)
                    )
                );
                assert_eq!(
                    unsafe { &(*(::core::ptr::null::<cpu_time>())).m_sys_sec as *const _ as usize },
                    8usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(cpu_time),
                        "::",
                        stringify!(m_sys_sec)
                    )
                );
                assert_eq!(
                    unsafe {
                        &(*(::core::ptr::null::<cpu_time>())).m_usr_usec as *const _ as usize
                    },
                    16usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(cpu_time),
                        "::",
                        stringify!(m_usr_usec)
                    )
                );
                assert_eq!(
                    unsafe {
                        &(*(::core::ptr::null::<cpu_time>())).m_sys_usec as *const _ as usize
                    },
                    24usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(cpu_time),
                        "::",
                        stringify!(m_sys_usec)
                    )
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN6octave3sys8cpu_time5stampEv"]
                pub fn cpu_time_stamp(this: *mut root::octave::sys::cpu_time);
            }
            impl cpu_time {
                #[inline]
                pub unsafe fn stamp(&mut self) {
                    cpu_time_stamp(self)
                }
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone)]
            pub struct resource_usage {
                pub m_cpu: root::octave::sys::cpu_time,
                pub m_maxrss: ::std::os::raw::c_long,
                pub m_ixrss: ::std::os::raw::c_long,
                pub m_idrss: ::std::os::raw::c_long,
                pub m_isrss: ::std::os::raw::c_long,
                pub m_minflt: ::std::os::raw::c_long,
                pub m_majflt: ::std::os::raw::c_long,
                pub m_nswap: ::std::os::raw::c_long,
                pub m_inblock: ::std::os::raw::c_long,
                pub m_oublock: ::std::os::raw::c_long,
                pub m_msgsnd: ::std::os::raw::c_long,
                pub m_msgrcv: ::std::os::raw::c_long,
                pub m_nsignals: ::std::os::raw::c_long,
                pub m_nvcsw: ::std::os::raw::c_long,
                pub m_nivcsw: ::std::os::raw::c_long,
            }
            #[test]
            fn bindgen_test_layout_resource_usage() {
                assert_eq!(
                    ::core::mem::size_of::<resource_usage>(),
                    144usize,
                    concat!("Size of: ", stringify!(resource_usage))
                );
                assert_eq!(
                    ::core::mem::align_of::<resource_usage>(),
                    8usize,
                    concat!("Alignment of ", stringify!(resource_usage))
                );
                assert_eq!(
                    unsafe {
                        &(*(::core::ptr::null::<resource_usage>())).m_cpu as *const _ as usize
                    },
                    0usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(resource_usage),
                        "::",
                        stringify!(m_cpu)
                    )
                );
                assert_eq!(
                    unsafe {
                        &(*(::core::ptr::null::<resource_usage>())).m_maxrss as *const _ as usize
                    },
                    32usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(resource_usage),
                        "::",
                        stringify!(m_maxrss)
                    )
                );
                assert_eq!(
                    unsafe {
                        &(*(::core::ptr::null::<resource_usage>())).m_ixrss as *const _ as usize
                    },
                    40usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(resource_usage),
                        "::",
                        stringify!(m_ixrss)
                    )
                );
                assert_eq!(
                    unsafe {
                        &(*(::core::ptr::null::<resource_usage>())).m_idrss as *const _ as usize
                    },
                    48usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(resource_usage),
                        "::",
                        stringify!(m_idrss)
                    )
                );
                assert_eq!(
                    unsafe {
                        &(*(::core::ptr::null::<resource_usage>())).m_isrss as *const _ as usize
                    },
                    56usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(resource_usage),
                        "::",
                        stringify!(m_isrss)
                    )
                );
                assert_eq!(
                    unsafe {
                        &(*(::core::ptr::null::<resource_usage>())).m_minflt as *const _ as usize
                    },
                    64usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(resource_usage),
                        "::",
                        stringify!(m_minflt)
                    )
                );
                assert_eq!(
                    unsafe {
                        &(*(::core::ptr::null::<resource_usage>())).m_majflt as *const _ as usize
                    },
                    72usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(resource_usage),
                        "::",
                        stringify!(m_majflt)
                    )
                );
                assert_eq!(
                    unsafe {
                        &(*(::core::ptr::null::<resource_usage>())).m_nswap as *const _ as usize
                    },
                    80usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(resource_usage),
                        "::",
                        stringify!(m_nswap)
                    )
                );
                assert_eq!(
                    unsafe {
                        &(*(::core::ptr::null::<resource_usage>())).m_inblock as *const _ as usize
                    },
                    88usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(resource_usage),
                        "::",
                        stringify!(m_inblock)
                    )
                );
                assert_eq!(
                    unsafe {
                        &(*(::core::ptr::null::<resource_usage>())).m_oublock as *const _ as usize
                    },
                    96usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(resource_usage),
                        "::",
                        stringify!(m_oublock)
                    )
                );
                assert_eq!(
                    unsafe {
                        &(*(::core::ptr::null::<resource_usage>())).m_msgsnd as *const _ as usize
                    },
                    104usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(resource_usage),
                        "::",
                        stringify!(m_msgsnd)
                    )
                );
                assert_eq!(
                    unsafe {
                        &(*(::core::ptr::null::<resource_usage>())).m_msgrcv as *const _ as usize
                    },
                    112usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(resource_usage),
                        "::",
                        stringify!(m_msgrcv)
                    )
                );
                assert_eq!(
                    unsafe {
                        &(*(::core::ptr::null::<resource_usage>())).m_nsignals as *const _ as usize
                    },
                    120usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(resource_usage),
                        "::",
                        stringify!(m_nsignals)
                    )
                );
                assert_eq!(
                    unsafe {
                        &(*(::core::ptr::null::<resource_usage>())).m_nvcsw as *const _ as usize
                    },
                    128usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(resource_usage),
                        "::",
                        stringify!(m_nvcsw)
                    )
                );
                assert_eq!(
                    unsafe {
                        &(*(::core::ptr::null::<resource_usage>())).m_nivcsw as *const _ as usize
                    },
                    136usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(resource_usage),
                        "::",
                        stringify!(m_nivcsw)
                    )
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN6octave3sys14resource_usage5stampEv"]
                pub fn resource_usage_stamp(this: *mut root::octave::sys::resource_usage);
            }
            impl resource_usage {
                #[inline]
                pub unsafe fn stamp(&mut self) {
                    resource_usage_stamp(self)
                }
            }
        }
        pub mod mach_info {
            #[allow(unused_imports)]
            use self::super::super::super::root;
            pub const float_format_flt_fmt_unknown: root::octave::mach_info::float_format = 0;
            pub const float_format_flt_fmt_ieee_little_endian:
                root::octave::mach_info::float_format = 1;
            pub const float_format_flt_fmt_ieee_big_endian: root::octave::mach_info::float_format =
                2;
            pub type float_format = u32;
            extern "C" {
                #[link_name = "\u{1}_ZN6octave9mach_info19native_float_formatEv"]
                pub fn native_float_format() -> root::octave::mach_info::float_format;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN6octave9mach_info16words_big_endianEv"]
                pub fn words_big_endian() -> bool;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN6octave9mach_info19words_little_endianEv"]
                pub fn words_little_endian() -> bool;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN6octave9mach_info22string_to_float_formatERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
                pub fn string_to_float_format(
                    arg1: *const root::std::string,
                ) -> root::octave::mach_info::float_format;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN6octave9mach_info22float_format_as_stringB5cxx11ENS0_12float_formatE"]
                pub fn float_format_as_string(
                    arg1: root::octave::mach_info::float_format,
                ) -> root::std::string;
            }
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct interpreter {
            _unused: [u8; 0],
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct scanf_format_elt {
            _unused: [u8; 0],
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct scanf_format_list {
            _unused: [u8; 0],
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct printf_format_elt {
            _unused: [u8; 0],
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct printf_format_list {
            _unused: [u8; 0],
        }
        #[repr(C)]
        pub struct base_stream__bindgen_vtable(::std::os::raw::c_void);
        #[repr(C)]
        #[derive(Debug)]
        pub struct base_stream {
            pub vtable_: *const base_stream__bindgen_vtable,
            pub count: root::octave::refcount<root::octave_idx_type>,
            pub md: ::std::os::raw::c_int,
            pub flt_fmt: root::octave::mach_info::float_format,
            pub fail: bool,
            pub open_state: bool,
            pub errmsg: root::std::string,
        }
        #[test]
        fn bindgen_test_layout_base_stream() {
            assert_eq!(
                ::core::mem::size_of::<base_stream>(),
                64usize,
                concat!("Size of: ", stringify!(base_stream))
            );
            assert_eq!(
                ::core::mem::align_of::<base_stream>(),
                8usize,
                concat!("Alignment of ", stringify!(base_stream))
            );
            assert_eq!(
                unsafe { &(*(::core::ptr::null::<base_stream>())).count as *const _ as usize },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(base_stream),
                    "::",
                    stringify!(count)
                )
            );
            assert_eq!(
                unsafe { &(*(::core::ptr::null::<base_stream>())).md as *const _ as usize },
                16usize,
                concat!(
                    "Offset of field: ",
                    stringify!(base_stream),
                    "::",
                    stringify!(md)
                )
            );
            assert_eq!(
                unsafe { &(*(::core::ptr::null::<base_stream>())).flt_fmt as *const _ as usize },
                20usize,
                concat!(
                    "Offset of field: ",
                    stringify!(base_stream),
                    "::",
                    stringify!(flt_fmt)
                )
            );
            assert_eq!(
                unsafe { &(*(::core::ptr::null::<base_stream>())).fail as *const _ as usize },
                24usize,
                concat!(
                    "Offset of field: ",
                    stringify!(base_stream),
                    "::",
                    stringify!(fail)
                )
            );
            assert_eq!(
                unsafe { &(*(::core::ptr::null::<base_stream>())).open_state as *const _ as usize },
                25usize,
                concat!(
                    "Offset of field: ",
                    stringify!(base_stream),
                    "::",
                    stringify!(open_state)
                )
            );
            assert_eq!(
                unsafe { &(*(::core::ptr::null::<base_stream>())).errmsg as *const _ as usize },
                32usize,
                concat!(
                    "Offset of field: ",
                    stringify!(base_stream),
                    "::",
                    stringify!(errmsg)
                )
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave11base_stream5errorB5cxx11EbRi"]
            pub fn base_stream_error(
                this: *mut root::octave::base_stream,
                clear: bool,
                err_num: *mut ::std::os::raw::c_int,
            ) -> root::std::string;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave11base_stream5errorERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
            pub fn base_stream_error1(
                this: *mut root::octave::base_stream,
                msg: *const root::std::string,
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave11base_stream5errorERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEES8_"]
            pub fn base_stream_error2(
                this: *mut root::octave::base_stream,
                who: *const root::std::string,
                msg: *const root::std::string,
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave11base_stream5clearEv"]
            pub fn base_stream_clear(this: *mut root::octave::base_stream);
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave11base_stream8clearerrEv"]
            pub fn base_stream_clearerr(this: *mut root::octave::base_stream);
        }
        impl base_stream {
            #[inline]
            pub unsafe fn error(
                &mut self,
                clear: bool,
                err_num: *mut ::std::os::raw::c_int,
            ) -> root::std::string {
                base_stream_error(self, clear, err_num)
            }
            #[inline]
            pub unsafe fn error1(&mut self, msg: *const root::std::string) {
                base_stream_error1(self, msg)
            }
            #[inline]
            pub unsafe fn error2(
                &mut self,
                who: *const root::std::string,
                msg: *const root::std::string,
            ) {
                base_stream_error2(self, who, msg)
            }
            #[inline]
            pub unsafe fn clear(&mut self) {
                base_stream_clear(self)
            }
            #[inline]
            pub unsafe fn clearerr(&mut self) {
                base_stream_clearerr(self)
            }
        }
        #[repr(C)]
        #[derive(Debug)]
        pub struct stream {
            pub rep: *mut root::octave::base_stream,
        }
        #[test]
        fn bindgen_test_layout_stream() {
            assert_eq!(
                ::core::mem::size_of::<stream>(),
                8usize,
                concat!("Size of: ", stringify!(stream))
            );
            assert_eq!(
                ::core::mem::align_of::<stream>(),
                8usize,
                concat!("Alignment of ", stringify!(stream))
            );
            assert_eq!(
                unsafe { &(*(::core::ptr::null::<stream>())).rep as *const _ as usize },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(stream),
                    "::",
                    stringify!(rep)
                )
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave6stream5flushEv"]
            pub fn stream_flush(this: *mut root::octave::stream) -> ::std::os::raw::c_int;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave6stream4getlElRbRKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
            pub fn stream_getl(
                this: *mut root::octave::stream,
                max_len: root::octave_idx_type,
                err: *mut bool,
                who: *const root::std::string,
            ) -> root::std::string;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave6stream4getlERK12octave_valueRbRKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
            pub fn stream_getl1(
                this: *mut root::octave::stream,
                max_len: *const root::octave_value,
                err: *mut bool,
                who: *const root::std::string,
            ) -> root::std::string;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave6stream4getsElRbRKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
            pub fn stream_gets(
                this: *mut root::octave::stream,
                max_len: root::octave_idx_type,
                err: *mut bool,
                who: *const root::std::string,
            ) -> root::std::string;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave6stream4getsERK12octave_valueRbRKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
            pub fn stream_gets1(
                this: *mut root::octave::stream,
                max_len: *const root::octave_value,
                err: *mut bool,
                who: *const root::std::string,
            ) -> root::std::string;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave6stream5skiplElRbRKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
            pub fn stream_skipl(
                this: *mut root::octave::stream,
                count: root::off_t,
                err: *mut bool,
                who: *const root::std::string,
            ) -> root::off_t;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave6stream5skiplERK12octave_valueRbRKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
            pub fn stream_skipl1(
                this: *mut root::octave::stream,
                count: *const root::octave_value,
                err: *mut bool,
                who: *const root::std::string,
            ) -> root::off_t;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave6stream4seekEli"]
            pub fn stream_seek(
                this: *mut root::octave::stream,
                offset: root::off_t,
                origin: ::std::os::raw::c_int,
            ) -> ::std::os::raw::c_int;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave6stream4seekERK12octave_valueS3_"]
            pub fn stream_seek1(
                this: *mut root::octave::stream,
                offset: *const root::octave_value,
                origin: *const root::octave_value,
            ) -> ::std::os::raw::c_int;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave6stream4tellEv"]
            pub fn stream_tell(this: *mut root::octave::stream) -> root::off_t;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave6stream6rewindEv"]
            pub fn stream_rewind(this: *mut root::octave::stream) -> ::std::os::raw::c_int;
        }
        extern "C" {
            #[link_name = "\u{1}_ZNK6octave6stream7is_openEv"]
            pub fn stream_is_open(this: *const root::octave::stream) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave6stream5closeEv"]
            pub fn stream_close(this: *mut root::octave::stream);
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave6stream4readERK5ArrayIdElN13oct_data_conv9data_typeES6_lNS_9mach_info12float_formatERl"]
            pub fn stream_read(
                this: *mut root::octave::stream,
                size: *const root::Array<f64>,
                block_size: root::octave_idx_type,
                input_type: root::oct_data_conv_data_type,
                output_type: root::oct_data_conv_data_type,
                skip: root::octave_idx_type,
                flt_fmt: root::octave::mach_info::float_format,
                count: *mut root::octave_idx_type,
            ) -> root::octave_value;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave6stream5writeERK12octave_valuelN13oct_data_conv9data_typeElNS_9mach_info12float_formatE"]
            pub fn stream_write(
                this: *mut root::octave::stream,
                data: *const root::octave_value,
                block_size: root::octave_idx_type,
                output_type: root::oct_data_conv_data_type,
                skip: root::octave_idx_type,
                flt_fmt: root::octave::mach_info::float_format,
            ) -> root::octave_idx_type;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave6stream11write_bytesEPKvm"]
            pub fn stream_write_bytes(
                this: *mut root::octave::stream,
                data: *const ::std::os::raw::c_void,
                n_elts: usize,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave6stream10skip_bytesEm"]
            pub fn stream_skip_bytes(this: *mut root::octave::stream, n_elts: usize) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave6stream5scanfERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEERK5ArrayIdERlS8_"]
            pub fn stream_scanf(
                this: *mut root::octave::stream,
                fmt: *const root::std::string,
                size: *const root::Array<f64>,
                count: *mut root::octave_idx_type,
                who: *const root::std::string,
            ) -> root::octave_value;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave6stream5scanfERK12octave_valueRK5ArrayIdERlRKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
            pub fn stream_scanf1(
                this: *mut root::octave::stream,
                fmt: *const root::octave_value,
                size: *const root::Array<f64>,
                count: *mut root::octave_idx_type,
                who: *const root::std::string,
            ) -> root::octave_value;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave6stream6oscanfERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEES8_"]
            pub fn stream_oscanf(
                this: *mut root::octave::stream,
                fmt: *const root::std::string,
                who: *const root::std::string,
            ) -> root::octave_value_list;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave6stream6oscanfERK12octave_valueRKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
            pub fn stream_oscanf1(
                this: *mut root::octave::stream,
                fmt: *const root::octave_value,
                who: *const root::std::string,
            ) -> root::octave_value_list;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave6stream8textscanERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEElRK17octave_value_listS8_Rl"]
            pub fn stream_textscan(
                this: *mut root::octave::stream,
                fmt: *const root::std::string,
                ntimes: root::octave_idx_type,
                options: *const root::octave_value_list,
                who: *const root::std::string,
                count: *mut root::octave_idx_type,
            ) -> root::octave_value;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave6stream6printfERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEERK17octave_value_listS8_"]
            pub fn stream_printf(
                this: *mut root::octave::stream,
                fmt: *const root::std::string,
                args: *const root::octave_value_list,
                who: *const root::std::string,
            ) -> ::std::os::raw::c_int;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave6stream6printfERK12octave_valueRK17octave_value_listRKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
            pub fn stream_printf1(
                this: *mut root::octave::stream,
                fmt: *const root::octave_value,
                args: *const root::octave_value_list,
                who: *const root::std::string,
            ) -> ::std::os::raw::c_int;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave6stream4putsERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEES8_"]
            pub fn stream_puts(
                this: *mut root::octave::stream,
                s: *const root::std::string,
                who: *const root::std::string,
            ) -> ::std::os::raw::c_int;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave6stream4putsERK12octave_valueRKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
            pub fn stream_puts1(
                this: *mut root::octave::stream,
                s: *const root::octave_value,
                who: *const root::std::string,
            ) -> ::std::os::raw::c_int;
        }
        extern "C" {
            #[link_name = "\u{1}_ZNK6octave6stream3eofEv"]
            pub fn stream_eof(this: *const root::octave::stream) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave6stream5errorB5cxx11EbRi"]
            pub fn stream_error(
                this: *mut root::octave::stream,
                clear: bool,
                err_num: *mut ::std::os::raw::c_int,
            ) -> root::std::string;
        }
        extern "C" {
            #[link_name = "\u{1}_ZNK6octave6stream4nameB5cxx11Ev"]
            pub fn stream_name(this: *const root::octave::stream) -> root::std::string;
        }
        extern "C" {
            #[link_name = "\u{1}_ZNK6octave6stream4modeEv"]
            pub fn stream_mode(this: *const root::octave::stream) -> ::std::os::raw::c_int;
        }
        extern "C" {
            #[link_name = "\u{1}_ZNK6octave6stream12float_formatEv"]
            pub fn stream_float_format(
                this: *const root::octave::stream,
            ) -> root::octave::mach_info::float_format;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave6stream14mode_as_stringB5cxx11Ei"]
            pub fn stream_mode_as_string(mode: ::std::os::raw::c_int) -> root::std::string;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave6streamC1EPNS_11base_streamE"]
            pub fn stream_stream(
                this: *mut root::octave::stream,
                bs: *mut root::octave::base_stream,
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave6streamC1ERKS0_"]
            pub fn stream_stream1(
                this: *mut root::octave::stream,
                arg1: *const root::octave::stream,
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave6streamD1Ev"]
            pub fn stream_stream_destructor(this: *mut root::octave::stream);
        }
        impl stream {
            #[inline]
            pub unsafe fn flush(&mut self) -> ::std::os::raw::c_int {
                stream_flush(self)
            }
            #[inline]
            pub unsafe fn getl(
                &mut self,
                max_len: root::octave_idx_type,
                err: *mut bool,
                who: *const root::std::string,
            ) -> root::std::string {
                stream_getl(self, max_len, err, who)
            }
            #[inline]
            pub unsafe fn getl1(
                &mut self,
                max_len: *const root::octave_value,
                err: *mut bool,
                who: *const root::std::string,
            ) -> root::std::string {
                stream_getl1(self, max_len, err, who)
            }
            #[inline]
            pub unsafe fn gets(
                &mut self,
                max_len: root::octave_idx_type,
                err: *mut bool,
                who: *const root::std::string,
            ) -> root::std::string {
                stream_gets(self, max_len, err, who)
            }
            #[inline]
            pub unsafe fn gets1(
                &mut self,
                max_len: *const root::octave_value,
                err: *mut bool,
                who: *const root::std::string,
            ) -> root::std::string {
                stream_gets1(self, max_len, err, who)
            }
            #[inline]
            pub unsafe fn skipl(
                &mut self,
                count: root::off_t,
                err: *mut bool,
                who: *const root::std::string,
            ) -> root::off_t {
                stream_skipl(self, count, err, who)
            }
            #[inline]
            pub unsafe fn skipl1(
                &mut self,
                count: *const root::octave_value,
                err: *mut bool,
                who: *const root::std::string,
            ) -> root::off_t {
                stream_skipl1(self, count, err, who)
            }
            #[inline]
            pub unsafe fn seek(
                &mut self,
                offset: root::off_t,
                origin: ::std::os::raw::c_int,
            ) -> ::std::os::raw::c_int {
                stream_seek(self, offset, origin)
            }
            #[inline]
            pub unsafe fn seek1(
                &mut self,
                offset: *const root::octave_value,
                origin: *const root::octave_value,
            ) -> ::std::os::raw::c_int {
                stream_seek1(self, offset, origin)
            }
            #[inline]
            pub unsafe fn tell(&mut self) -> root::off_t {
                stream_tell(self)
            }
            #[inline]
            pub unsafe fn rewind(&mut self) -> ::std::os::raw::c_int {
                stream_rewind(self)
            }
            #[inline]
            pub unsafe fn is_open(&self) -> bool {
                stream_is_open(self)
            }
            #[inline]
            pub unsafe fn close(&mut self) {
                stream_close(self)
            }
            #[inline]
            pub unsafe fn read(
                &mut self,
                size: *const root::Array<f64>,
                block_size: root::octave_idx_type,
                input_type: root::oct_data_conv_data_type,
                output_type: root::oct_data_conv_data_type,
                skip: root::octave_idx_type,
                flt_fmt: root::octave::mach_info::float_format,
                count: *mut root::octave_idx_type,
            ) -> root::octave_value {
                stream_read(
                    self,
                    size,
                    block_size,
                    input_type,
                    output_type,
                    skip,
                    flt_fmt,
                    count,
                )
            }
            #[inline]
            pub unsafe fn write(
                &mut self,
                data: *const root::octave_value,
                block_size: root::octave_idx_type,
                output_type: root::oct_data_conv_data_type,
                skip: root::octave_idx_type,
                flt_fmt: root::octave::mach_info::float_format,
            ) -> root::octave_idx_type {
                stream_write(self, data, block_size, output_type, skip, flt_fmt)
            }
            #[inline]
            pub unsafe fn write_bytes(
                &mut self,
                data: *const ::std::os::raw::c_void,
                n_elts: usize,
            ) -> bool {
                stream_write_bytes(self, data, n_elts)
            }
            #[inline]
            pub unsafe fn skip_bytes(&mut self, n_elts: usize) -> bool {
                stream_skip_bytes(self, n_elts)
            }
            #[inline]
            pub unsafe fn scanf(
                &mut self,
                fmt: *const root::std::string,
                size: *const root::Array<f64>,
                count: *mut root::octave_idx_type,
                who: *const root::std::string,
            ) -> root::octave_value {
                stream_scanf(self, fmt, size, count, who)
            }
            #[inline]
            pub unsafe fn scanf1(
                &mut self,
                fmt: *const root::octave_value,
                size: *const root::Array<f64>,
                count: *mut root::octave_idx_type,
                who: *const root::std::string,
            ) -> root::octave_value {
                stream_scanf1(self, fmt, size, count, who)
            }
            #[inline]
            pub unsafe fn oscanf(
                &mut self,
                fmt: *const root::std::string,
                who: *const root::std::string,
            ) -> root::octave_value_list {
                stream_oscanf(self, fmt, who)
            }
            #[inline]
            pub unsafe fn oscanf1(
                &mut self,
                fmt: *const root::octave_value,
                who: *const root::std::string,
            ) -> root::octave_value_list {
                stream_oscanf1(self, fmt, who)
            }
            #[inline]
            pub unsafe fn textscan(
                &mut self,
                fmt: *const root::std::string,
                ntimes: root::octave_idx_type,
                options: *const root::octave_value_list,
                who: *const root::std::string,
                count: *mut root::octave_idx_type,
            ) -> root::octave_value {
                stream_textscan(self, fmt, ntimes, options, who, count)
            }
            #[inline]
            pub unsafe fn printf(
                &mut self,
                fmt: *const root::std::string,
                args: *const root::octave_value_list,
                who: *const root::std::string,
            ) -> ::std::os::raw::c_int {
                stream_printf(self, fmt, args, who)
            }
            #[inline]
            pub unsafe fn printf1(
                &mut self,
                fmt: *const root::octave_value,
                args: *const root::octave_value_list,
                who: *const root::std::string,
            ) -> ::std::os::raw::c_int {
                stream_printf1(self, fmt, args, who)
            }
            #[inline]
            pub unsafe fn puts(
                &mut self,
                s: *const root::std::string,
                who: *const root::std::string,
            ) -> ::std::os::raw::c_int {
                stream_puts(self, s, who)
            }
            #[inline]
            pub unsafe fn puts1(
                &mut self,
                s: *const root::octave_value,
                who: *const root::std::string,
            ) -> ::std::os::raw::c_int {
                stream_puts1(self, s, who)
            }
            #[inline]
            pub unsafe fn eof(&self) -> bool {
                stream_eof(self)
            }
            #[inline]
            pub unsafe fn error(
                &mut self,
                clear: bool,
                err_num: *mut ::std::os::raw::c_int,
            ) -> root::std::string {
                stream_error(self, clear, err_num)
            }
            #[inline]
            pub unsafe fn name(&self) -> root::std::string {
                stream_name(self)
            }
            #[inline]
            pub unsafe fn mode(&self) -> ::std::os::raw::c_int {
                stream_mode(self)
            }
            #[inline]
            pub unsafe fn float_format(&self) -> root::octave::mach_info::float_format {
                stream_float_format(self)
            }
            #[inline]
            pub unsafe fn mode_as_string(mode: ::std::os::raw::c_int) -> root::std::string {
                stream_mode_as_string(mode)
            }
            #[inline]
            pub unsafe fn new(bs: *mut root::octave::base_stream) -> Self {
                let mut __bindgen_tmp = ::core::mem::uninitialized();
                stream_stream(&mut __bindgen_tmp, bs);
                __bindgen_tmp
            }
            #[inline]
            pub unsafe fn new1(arg1: *const root::octave::stream) -> Self {
                let mut __bindgen_tmp = ::core::mem::uninitialized();
                stream_stream1(&mut __bindgen_tmp, arg1);
                __bindgen_tmp
            }
            #[inline]
            pub unsafe fn destruct(&mut self) {
                stream_stream_destructor(self)
            }
        }
        #[repr(C)]
        #[derive(Debug)]
        pub struct stream_list {
            pub list: root::octave::stream_list_ostrl_map,
            pub lookup_cache: u64,
            pub m_stdin_file: ::std::os::raw::c_int,
            pub m_stdout_file: ::std::os::raw::c_int,
            pub m_stderr_file: ::std::os::raw::c_int,
        }
        pub type stream_list_ostrl_map = [u64; 6usize];
        #[test]
        fn bindgen_test_layout_stream_list() {
            assert_eq!(
                ::core::mem::size_of::<stream_list>(),
                72usize,
                concat!("Size of: ", stringify!(stream_list))
            );
            assert_eq!(
                ::core::mem::align_of::<stream_list>(),
                8usize,
                concat!("Alignment of ", stringify!(stream_list))
            );
            assert_eq!(
                unsafe { &(*(::core::ptr::null::<stream_list>())).list as *const _ as usize },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(stream_list),
                    "::",
                    stringify!(list)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<stream_list>())).lookup_cache as *const _ as usize
                },
                48usize,
                concat!(
                    "Offset of field: ",
                    stringify!(stream_list),
                    "::",
                    stringify!(lookup_cache)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<stream_list>())).m_stdin_file as *const _ as usize
                },
                56usize,
                concat!(
                    "Offset of field: ",
                    stringify!(stream_list),
                    "::",
                    stringify!(m_stdin_file)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<stream_list>())).m_stdout_file as *const _ as usize
                },
                60usize,
                concat!(
                    "Offset of field: ",
                    stringify!(stream_list),
                    "::",
                    stringify!(m_stdout_file)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<stream_list>())).m_stderr_file as *const _ as usize
                },
                64usize,
                concat!(
                    "Offset of field: ",
                    stringify!(stream_list),
                    "::",
                    stringify!(m_stderr_file)
                )
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave11stream_list6insertERNS_6streamE"]
            pub fn stream_list_insert(
                this: *mut root::octave::stream_list,
                os: *mut root::octave::stream,
            ) -> ::std::os::raw::c_int;
        }
        extern "C" {
            #[link_name = "\u{1}_ZNK6octave11stream_list6lookupEiRKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
            pub fn stream_list_lookup(
                this: *const root::octave::stream_list,
                fid: ::std::os::raw::c_int,
                who: *const root::std::string,
            ) -> root::octave::stream;
        }
        extern "C" {
            #[link_name = "\u{1}_ZNK6octave11stream_list6lookupERK12octave_valueRKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
            pub fn stream_list_lookup1(
                this: *const root::octave::stream_list,
                fid: *const root::octave_value,
                who: *const root::std::string,
            ) -> root::octave::stream;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave11stream_list6removeEiRKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
            pub fn stream_list_remove(
                this: *mut root::octave::stream_list,
                fid: ::std::os::raw::c_int,
                who: *const root::std::string,
            ) -> ::std::os::raw::c_int;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave11stream_list6removeERK12octave_valueRKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
            pub fn stream_list_remove1(
                this: *mut root::octave::stream_list,
                fid: *const root::octave_value,
                who: *const root::std::string,
            ) -> ::std::os::raw::c_int;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave11stream_list5clearEb"]
            pub fn stream_list_clear(this: *mut root::octave::stream_list, flush: bool);
        }
        extern "C" {
            #[link_name = "\u{1}_ZNK6octave11stream_list8get_infoEi"]
            pub fn stream_list_get_info(
                this: *const root::octave::stream_list,
                fid: ::std::os::raw::c_int,
            ) -> root::string_vector;
        }
        extern "C" {
            #[link_name = "\u{1}_ZNK6octave11stream_list8get_infoERK12octave_value"]
            pub fn stream_list_get_info1(
                this: *const root::octave::stream_list,
                fid: *const root::octave_value,
            ) -> root::string_vector;
        }
        extern "C" {
            #[link_name = "\u{1}_ZNK6octave11stream_list15list_open_filesB5cxx11Ev"]
            pub fn stream_list_list_open_files(
                this: *const root::octave::stream_list,
            ) -> root::std::string;
        }
        extern "C" {
            #[link_name = "\u{1}_ZNK6octave11stream_list17open_file_numbersEv"]
            pub fn stream_list_open_file_numbers(
                this: *const root::octave::stream_list,
            ) -> root::octave_value;
        }
        extern "C" {
            #[link_name = "\u{1}_ZNK6octave11stream_list15get_file_numberERK12octave_value"]
            pub fn stream_list_get_file_number(
                this: *const root::octave::stream_list,
                fid: *const root::octave_value,
            ) -> ::std::os::raw::c_int;
        }
        extern "C" {
            #[link_name = "\u{1}_ZNK6octave11stream_list10stdin_fileEv"]
            pub fn stream_list_stdin_file(
                this: *const root::octave::stream_list,
            ) -> root::octave_value;
        }
        extern "C" {
            #[link_name = "\u{1}_ZNK6octave11stream_list11stdout_fileEv"]
            pub fn stream_list_stdout_file(
                this: *const root::octave::stream_list,
            ) -> root::octave_value;
        }
        extern "C" {
            #[link_name = "\u{1}_ZNK6octave11stream_list11stderr_fileEv"]
            pub fn stream_list_stderr_file(
                this: *const root::octave::stream_list,
            ) -> root::octave_value;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave11stream_listC1ERNS_11interpreterE"]
            pub fn stream_list_stream_list(
                this: *mut root::octave::stream_list,
                interp: *mut root::octave::interpreter,
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave11stream_listD1Ev"]
            pub fn stream_list_stream_list_destructor(this: *mut root::octave::stream_list);
        }
        impl stream_list {
            #[inline]
            pub unsafe fn insert(
                &mut self,
                os: *mut root::octave::stream,
            ) -> ::std::os::raw::c_int {
                stream_list_insert(self, os)
            }
            #[inline]
            pub unsafe fn lookup(
                &self,
                fid: ::std::os::raw::c_int,
                who: *const root::std::string,
            ) -> root::octave::stream {
                stream_list_lookup(self, fid, who)
            }
            #[inline]
            pub unsafe fn lookup1(
                &self,
                fid: *const root::octave_value,
                who: *const root::std::string,
            ) -> root::octave::stream {
                stream_list_lookup1(self, fid, who)
            }
            #[inline]
            pub unsafe fn remove(
                &mut self,
                fid: ::std::os::raw::c_int,
                who: *const root::std::string,
            ) -> ::std::os::raw::c_int {
                stream_list_remove(self, fid, who)
            }
            #[inline]
            pub unsafe fn remove1(
                &mut self,
                fid: *const root::octave_value,
                who: *const root::std::string,
            ) -> ::std::os::raw::c_int {
                stream_list_remove1(self, fid, who)
            }
            #[inline]
            pub unsafe fn clear(&mut self, flush: bool) {
                stream_list_clear(self, flush)
            }
            #[inline]
            pub unsafe fn get_info(&self, fid: ::std::os::raw::c_int) -> root::string_vector {
                stream_list_get_info(self, fid)
            }
            #[inline]
            pub unsafe fn get_info1(&self, fid: *const root::octave_value) -> root::string_vector {
                stream_list_get_info1(self, fid)
            }
            #[inline]
            pub unsafe fn list_open_files(&self) -> root::std::string {
                stream_list_list_open_files(self)
            }
            #[inline]
            pub unsafe fn open_file_numbers(&self) -> root::octave_value {
                stream_list_open_file_numbers(self)
            }
            #[inline]
            pub unsafe fn get_file_number(
                &self,
                fid: *const root::octave_value,
            ) -> ::std::os::raw::c_int {
                stream_list_get_file_number(self, fid)
            }
            #[inline]
            pub unsafe fn stdin_file(&self) -> root::octave_value {
                stream_list_stdin_file(self)
            }
            #[inline]
            pub unsafe fn stdout_file(&self) -> root::octave_value {
                stream_list_stdout_file(self)
            }
            #[inline]
            pub unsafe fn stderr_file(&self) -> root::octave_value {
                stream_list_stderr_file(self)
            }
            #[inline]
            pub unsafe fn new(interp: *mut root::octave::interpreter) -> Self {
                let mut __bindgen_tmp = ::core::mem::uninitialized();
                stream_list_stream_list(&mut __bindgen_tmp, interp);
                __bindgen_tmp
            }
            #[inline]
            pub unsafe fn destruct(&mut self) {
                stream_list_stream_list_destructor(self)
            }
        }
        #[repr(C)]
        pub struct action_container__bindgen_vtable(::std::os::raw::c_void);
        #[repr(C)]
        #[derive(Debug)]
        pub struct action_container {
            pub vtable_: *const action_container__bindgen_vtable,
        }
        #[repr(C)]
        pub struct action_container_elem__bindgen_vtable(::std::os::raw::c_void);
        #[repr(C)]
        #[derive(Debug)]
        pub struct action_container_elem {
            pub vtable_: *const action_container_elem__bindgen_vtable,
        }
        #[test]
        fn bindgen_test_layout_action_container_elem() {
            assert_eq!(
                ::core::mem::size_of::<action_container_elem>(),
                8usize,
                concat!("Size of: ", stringify!(action_container_elem))
            );
            assert_eq!(
                ::core::mem::align_of::<action_container_elem>(),
                8usize,
                concat!("Alignment of ", stringify!(action_container_elem))
            );
        }
        #[repr(C)]
        #[derive(Debug)]
        pub struct action_container_fcn_elem {
            pub _base: root::octave::action_container_elem,
            pub m_fcn: [u64; 4usize],
        }
        #[test]
        fn bindgen_test_layout_action_container_fcn_elem() {
            assert_eq!(
                ::core::mem::size_of::<action_container_fcn_elem>(),
                40usize,
                concat!("Size of: ", stringify!(action_container_fcn_elem))
            );
            assert_eq!(
                ::core::mem::align_of::<action_container_fcn_elem>(),
                8usize,
                concat!("Alignment of ", stringify!(action_container_fcn_elem))
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<action_container_fcn_elem>())).m_fcn as *const _
                        as usize
                },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(action_container_fcn_elem),
                    "::",
                    stringify!(m_fcn)
                )
            );
        }
        #[repr(C)]
        #[derive(Debug)]
        pub struct action_container_restore_var_elem<T> {
            pub _base: root::octave::action_container_elem,
            pub e_ptr: *mut T,
            pub e_val: T,
            pub _phantom_0: ::core::marker::PhantomData<::core::cell::UnsafeCell<T>>,
        }
        #[repr(C)]
        #[derive(Debug)]
        pub struct action_container_delete_ptr_elem<T> {
            pub _base: root::octave::action_container_elem,
            pub e_ptr: *mut T,
            pub _phantom_0: ::core::marker::PhantomData<::core::cell::UnsafeCell<T>>,
        }
        #[test]
        fn bindgen_test_layout_action_container() {
            assert_eq!(
                ::core::mem::size_of::<action_container>(),
                8usize,
                concat!("Size of: ", stringify!(action_container))
            );
            assert_eq!(
                ::core::mem::align_of::<action_container>(),
                8usize,
                concat!("Alignment of ", stringify!(action_container))
            );
        }
        #[repr(C)]
        #[derive(Debug)]
        pub struct unwind_protect {
            pub _base: root::octave::action_container,
            pub lifo: [u64; 10usize],
        }
        #[test]
        fn bindgen_test_layout_unwind_protect() {
            assert_eq!(
                ::core::mem::size_of::<unwind_protect>(),
                88usize,
                concat!("Size of: ", stringify!(unwind_protect))
            );
            assert_eq!(
                ::core::mem::align_of::<unwind_protect>(),
                8usize,
                concat!("Alignment of ", stringify!(unwind_protect))
            );
            assert_eq!(
                unsafe { &(*(::core::ptr::null::<unwind_protect>())).lifo as *const _ as usize },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(unwind_protect),
                    "::",
                    stringify!(lifo)
                )
            );
        }
        #[repr(C)]
        #[derive(Debug)]
        pub struct unwind_protect_safe {
            pub _base: root::octave::unwind_protect,
        }
        #[test]
        fn bindgen_test_layout_unwind_protect_safe() {
            assert_eq!(
                ::core::mem::size_of::<unwind_protect_safe>(),
                88usize,
                concat!("Size of: ", stringify!(unwind_protect_safe))
            );
            assert_eq!(
                ::core::mem::align_of::<unwind_protect_safe>(),
                8usize,
                concat!("Alignment of ", stringify!(unwind_protect_safe))
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave17__get_type_info__ERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
            pub fn __get_type_info__(
                arg1: *const root::std::string,
            ) -> *mut root::octave::type_info;
        }
        #[repr(C)]
        #[derive(Debug)]
        pub struct type_info {
            pub num_types: ::std::os::raw::c_int,
            pub types: root::Array<root::std::string>,
            pub vals: root::Array<*mut root::octave_value>,
            pub unary_class_ops: root::Array<*mut ::std::os::raw::c_void>,
            pub unary_ops: root::Array<*mut ::std::os::raw::c_void>,
            pub non_const_unary_ops: root::Array<*mut ::std::os::raw::c_void>,
            pub binary_class_ops: root::Array<*mut ::std::os::raw::c_void>,
            pub binary_ops: root::Array<*mut ::std::os::raw::c_void>,
            pub compound_binary_class_ops: root::Array<*mut ::std::os::raw::c_void>,
            pub compound_binary_ops: root::Array<*mut ::std::os::raw::c_void>,
            pub cat_ops: root::Array<*mut ::std::os::raw::c_void>,
            pub assign_ops: root::Array<*mut ::std::os::raw::c_void>,
            pub assignany_ops: root::Array<*mut ::std::os::raw::c_void>,
            pub pref_assign_conv: root::Array<::std::os::raw::c_int>,
            pub widening_ops: root::Array<*mut ::std::os::raw::c_void>,
        }
        pub type type_info_unary_class_op_fcn = ::core::option::Option<
            unsafe extern "C" fn(arg1: *const root::octave_value) -> root::octave_value,
        >;
        pub type type_info_unary_op_fcn = ::core::option::Option<
            unsafe extern "C" fn(arg1: *const root::octave_base_value) -> root::octave_value,
        >;
        pub type type_info_non_const_unary_op_fcn =
            ::core::option::Option<unsafe extern "C" fn(arg1: *mut root::octave_base_value)>;
        pub type type_info_binary_class_op_fcn = ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *const root::octave_value,
                arg2: *const root::octave_value,
            ) -> root::octave_value,
        >;
        pub type type_info_binary_op_fcn = ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *const root::octave_base_value,
                arg2: *const root::octave_base_value,
            ) -> root::octave_value,
        >;
        pub type type_info_cat_op_fcn = ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut root::octave_base_value,
                arg2: *const root::octave_base_value,
                ra_idx: *const root::Array<root::octave_idx_type>,
            ) -> root::octave_value,
        >;
        pub type type_info_assign_op_fcn = ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut root::octave_base_value,
                arg2: *const root::octave_value_list,
                arg3: *const root::octave_base_value,
            ) -> root::octave_value,
        >;
        pub type type_info_assignany_op_fcn = ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut root::octave_base_value,
                arg2: *const root::octave_value_list,
                arg3: *const root::octave_value,
            ) -> root::octave_value,
        >;
        #[test]
        fn bindgen_test_layout_type_info() {
            assert_eq!(
                ::core::mem::size_of::<type_info>(),
                568usize,
                concat!("Size of: ", stringify!(type_info))
            );
            assert_eq!(
                ::core::mem::align_of::<type_info>(),
                8usize,
                concat!("Alignment of ", stringify!(type_info))
            );
            assert_eq!(
                unsafe { &(*(::core::ptr::null::<type_info>())).num_types as *const _ as usize },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(type_info),
                    "::",
                    stringify!(num_types)
                )
            );
            assert_eq!(
                unsafe { &(*(::core::ptr::null::<type_info>())).types as *const _ as usize },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(type_info),
                    "::",
                    stringify!(types)
                )
            );
            assert_eq!(
                unsafe { &(*(::core::ptr::null::<type_info>())).vals as *const _ as usize },
                48usize,
                concat!(
                    "Offset of field: ",
                    stringify!(type_info),
                    "::",
                    stringify!(vals)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<type_info>())).unary_class_ops as *const _ as usize
                },
                88usize,
                concat!(
                    "Offset of field: ",
                    stringify!(type_info),
                    "::",
                    stringify!(unary_class_ops)
                )
            );
            assert_eq!(
                unsafe { &(*(::core::ptr::null::<type_info>())).unary_ops as *const _ as usize },
                128usize,
                concat!(
                    "Offset of field: ",
                    stringify!(type_info),
                    "::",
                    stringify!(unary_ops)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<type_info>())).non_const_unary_ops as *const _ as usize
                },
                168usize,
                concat!(
                    "Offset of field: ",
                    stringify!(type_info),
                    "::",
                    stringify!(non_const_unary_ops)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<type_info>())).binary_class_ops as *const _ as usize
                },
                208usize,
                concat!(
                    "Offset of field: ",
                    stringify!(type_info),
                    "::",
                    stringify!(binary_class_ops)
                )
            );
            assert_eq!(
                unsafe { &(*(::core::ptr::null::<type_info>())).binary_ops as *const _ as usize },
                248usize,
                concat!(
                    "Offset of field: ",
                    stringify!(type_info),
                    "::",
                    stringify!(binary_ops)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<type_info>())).compound_binary_class_ops as *const _
                        as usize
                },
                288usize,
                concat!(
                    "Offset of field: ",
                    stringify!(type_info),
                    "::",
                    stringify!(compound_binary_class_ops)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<type_info>())).compound_binary_ops as *const _ as usize
                },
                328usize,
                concat!(
                    "Offset of field: ",
                    stringify!(type_info),
                    "::",
                    stringify!(compound_binary_ops)
                )
            );
            assert_eq!(
                unsafe { &(*(::core::ptr::null::<type_info>())).cat_ops as *const _ as usize },
                368usize,
                concat!(
                    "Offset of field: ",
                    stringify!(type_info),
                    "::",
                    stringify!(cat_ops)
                )
            );
            assert_eq!(
                unsafe { &(*(::core::ptr::null::<type_info>())).assign_ops as *const _ as usize },
                408usize,
                concat!(
                    "Offset of field: ",
                    stringify!(type_info),
                    "::",
                    stringify!(assign_ops)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<type_info>())).assignany_ops as *const _ as usize
                },
                448usize,
                concat!(
                    "Offset of field: ",
                    stringify!(type_info),
                    "::",
                    stringify!(assignany_ops)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<type_info>())).pref_assign_conv as *const _ as usize
                },
                488usize,
                concat!(
                    "Offset of field: ",
                    stringify!(type_info),
                    "::",
                    stringify!(pref_assign_conv)
                )
            );
            assert_eq!(
                unsafe { &(*(::core::ptr::null::<type_info>())).widening_ops as *const _ as usize },
                528usize,
                concat!(
                    "Offset of field: ",
                    stringify!(type_info),
                    "::",
                    stringify!(widening_ops)
                )
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave9type_info13register_typeERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEES8_RK12octave_valueb"]
            pub fn type_info_register_type(
                this: *mut root::octave::type_info,
                arg1: *const root::std::string,
                arg2: *const root::std::string,
                arg3: *const root::octave_value,
                abort_on_duplicate: bool,
            ) -> ::std::os::raw::c_int;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave9type_info23register_unary_class_opEN12octave_value8unary_opEPFS1_RKS1_Eb"]
            pub fn type_info_register_unary_class_op(
                this: *mut root::octave::type_info,
                arg1: root::octave_value_unary_op,
                arg2: root::octave::type_info_unary_class_op_fcn,
                abort_on_duplicate: bool,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave9type_info17register_unary_opEN12octave_value8unary_opEiPFS1_RK17octave_base_valueEb"]
            pub fn type_info_register_unary_op(
                this: *mut root::octave::type_info,
                arg1: root::octave_value_unary_op,
                arg2: ::std::os::raw::c_int,
                arg3: root::octave::type_info_unary_op_fcn,
                abort_on_duplicate: bool,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave9type_info27register_non_const_unary_opEN12octave_value8unary_opEiPFvR17octave_base_valueEb"]
            pub fn type_info_register_non_const_unary_op(
                this: *mut root::octave::type_info,
                arg1: root::octave_value_unary_op,
                arg2: ::std::os::raw::c_int,
                arg3: root::octave::type_info_non_const_unary_op_fcn,
                abort_on_duplicate: bool,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave9type_info24register_binary_class_opEN12octave_value9binary_opEPFS1_RKS1_S4_Eb"]
            pub fn type_info_register_binary_class_op(
                this: *mut root::octave::type_info,
                arg1: root::octave_value_binary_op,
                arg2: root::octave::type_info_binary_class_op_fcn,
                abort_on_duplicate: bool,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave9type_info18register_binary_opEN12octave_value9binary_opEiiPFS1_RK17octave_base_valueS5_Eb"]
            pub fn type_info_register_binary_op(
                this: *mut root::octave::type_info,
                arg1: root::octave_value_binary_op,
                arg2: ::std::os::raw::c_int,
                arg3: ::std::os::raw::c_int,
                arg4: root::octave::type_info_binary_op_fcn,
                abort_on_duplicate: bool,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave9type_info24register_binary_class_opEN12octave_value18compound_binary_opEPFS1_RKS1_S4_Eb"]
            pub fn type_info_register_binary_class_op1(
                this: *mut root::octave::type_info,
                arg1: root::octave_value_compound_binary_op,
                arg2: root::octave::type_info_binary_class_op_fcn,
                abort_on_duplicate: bool,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave9type_info18register_binary_opEN12octave_value18compound_binary_opEiiPFS1_RK17octave_base_valueS5_Eb"]
            pub fn type_info_register_binary_op1(
                this: *mut root::octave::type_info,
                arg1: root::octave_value_compound_binary_op,
                arg2: ::std::os::raw::c_int,
                arg3: ::std::os::raw::c_int,
                arg4: root::octave::type_info_binary_op_fcn,
                abort_on_duplicate: bool,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave9type_info15register_cat_opEiiPF12octave_valueR17octave_base_valueRKS2_RK5ArrayIlEEb"]
            pub fn type_info_register_cat_op(
                this: *mut root::octave::type_info,
                arg1: ::std::os::raw::c_int,
                arg2: ::std::os::raw::c_int,
                arg3: root::octave::type_info_cat_op_fcn,
                abort_on_duplicate: bool,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave9type_info18register_assign_opEN12octave_value9assign_opEiiPFS1_R17octave_base_valueRK17octave_value_listRKS3_Eb"]
            pub fn type_info_register_assign_op(
                this: *mut root::octave::type_info,
                arg1: root::octave_value_assign_op,
                arg2: ::std::os::raw::c_int,
                arg3: ::std::os::raw::c_int,
                arg4: root::octave::type_info_assign_op_fcn,
                abort_on_duplicate: bool,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave9type_info21register_assignany_opEN12octave_value9assign_opEiPFS1_R17octave_base_valueRK17octave_value_listRKS1_Eb"]
            pub fn type_info_register_assignany_op(
                this: *mut root::octave::type_info,
                arg1: root::octave_value_assign_op,
                arg2: ::std::os::raw::c_int,
                arg3: root::octave::type_info_assignany_op_fcn,
                abort_on_duplicate: bool,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave9type_info25register_pref_assign_convEiiib"]
            pub fn type_info_register_pref_assign_conv(
                this: *mut root::octave::type_info,
                arg1: ::std::os::raw::c_int,
                arg2: ::std::os::raw::c_int,
                arg3: ::std::os::raw::c_int,
                abort_on_duplicate: bool,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave9type_info20register_widening_opEiiPFP17octave_base_valueRKS1_Eb"]
            pub fn type_info_register_widening_op(
                this: *mut root::octave::type_info,
                arg1: ::std::os::raw::c_int,
                arg2: ::std::os::raw::c_int,
                arg3: root::octave_base_value_type_conv_fcn,
                abort_on_duplicate: bool,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave9type_info11lookup_typeERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
            pub fn type_info_lookup_type(
                this: *mut root::octave::type_info,
                nm: *const root::std::string,
            ) -> root::octave_value;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave9type_info21lookup_unary_class_opEN12octave_value8unary_opE"]
            pub fn type_info_lookup_unary_class_op(
                this: *mut root::octave::type_info,
                arg1: root::octave_value_unary_op,
            ) -> root::octave::type_info_unary_class_op_fcn;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave9type_info15lookup_unary_opEN12octave_value8unary_opEi"]
            pub fn type_info_lookup_unary_op(
                this: *mut root::octave::type_info,
                arg1: root::octave_value_unary_op,
                arg2: ::std::os::raw::c_int,
            ) -> root::octave::type_info_unary_op_fcn;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave9type_info25lookup_non_const_unary_opEN12octave_value8unary_opEi"]
            pub fn type_info_lookup_non_const_unary_op(
                this: *mut root::octave::type_info,
                arg1: root::octave_value_unary_op,
                arg2: ::std::os::raw::c_int,
            ) -> root::octave::type_info_non_const_unary_op_fcn;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave9type_info22lookup_binary_class_opEN12octave_value9binary_opE"]
            pub fn type_info_lookup_binary_class_op(
                this: *mut root::octave::type_info,
                arg1: root::octave_value_binary_op,
            ) -> root::octave::type_info_binary_class_op_fcn;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave9type_info16lookup_binary_opEN12octave_value9binary_opEii"]
            pub fn type_info_lookup_binary_op(
                this: *mut root::octave::type_info,
                arg1: root::octave_value_binary_op,
                arg2: ::std::os::raw::c_int,
                arg3: ::std::os::raw::c_int,
            ) -> root::octave::type_info_binary_op_fcn;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave9type_info22lookup_binary_class_opEN12octave_value18compound_binary_opE"]
            pub fn type_info_lookup_binary_class_op1(
                this: *mut root::octave::type_info,
                arg1: root::octave_value_compound_binary_op,
            ) -> root::octave::type_info_binary_class_op_fcn;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave9type_info16lookup_binary_opEN12octave_value18compound_binary_opEii"]
            pub fn type_info_lookup_binary_op1(
                this: *mut root::octave::type_info,
                arg1: root::octave_value_compound_binary_op,
                arg2: ::std::os::raw::c_int,
                arg3: ::std::os::raw::c_int,
            ) -> root::octave::type_info_binary_op_fcn;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave9type_info13lookup_cat_opEii"]
            pub fn type_info_lookup_cat_op(
                this: *mut root::octave::type_info,
                arg1: ::std::os::raw::c_int,
                arg2: ::std::os::raw::c_int,
            ) -> root::octave::type_info_cat_op_fcn;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave9type_info16lookup_assign_opEN12octave_value9assign_opEii"]
            pub fn type_info_lookup_assign_op(
                this: *mut root::octave::type_info,
                arg1: root::octave_value_assign_op,
                arg2: ::std::os::raw::c_int,
                arg3: ::std::os::raw::c_int,
            ) -> root::octave::type_info_assign_op_fcn;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave9type_info19lookup_assignany_opEN12octave_value9assign_opEi"]
            pub fn type_info_lookup_assignany_op(
                this: *mut root::octave::type_info,
                arg1: root::octave_value_assign_op,
                arg2: ::std::os::raw::c_int,
            ) -> root::octave::type_info_assignany_op_fcn;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave9type_info23lookup_pref_assign_convEii"]
            pub fn type_info_lookup_pref_assign_conv(
                this: *mut root::octave::type_info,
                arg1: ::std::os::raw::c_int,
                arg2: ::std::os::raw::c_int,
            ) -> ::std::os::raw::c_int;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave9type_info18lookup_widening_opEii"]
            pub fn type_info_lookup_widening_op(
                this: *mut root::octave::type_info,
                arg1: ::std::os::raw::c_int,
                arg2: ::std::os::raw::c_int,
            ) -> root::octave_base_value_type_conv_fcn;
        }
        extern "C" {
            #[link_name = "\u{1}_ZNK6octave9type_info20installed_type_namesEv"]
            pub fn type_info_installed_type_names(
                this: *const root::octave::type_info,
            ) -> root::string_vector;
        }
        extern "C" {
            #[link_name = "\u{1}_ZNK6octave9type_info19installed_type_infoEv"]
            pub fn type_info_installed_type_info(
                this: *const root::octave::type_info,
            ) -> root::octave_scalar_map;
        }
        extern "C" {
            #[link_name = "\u{1}_ZNK6octave9type_info13unary_ops_mapEv"]
            pub fn type_info_unary_ops_map(
                this: *const root::octave::type_info,
            ) -> root::octave_scalar_map;
        }
        extern "C" {
            #[link_name = "\u{1}_ZNK6octave9type_info23non_const_unary_ops_mapEv"]
            pub fn type_info_non_const_unary_ops_map(
                this: *const root::octave::type_info,
            ) -> root::octave_scalar_map;
        }
        extern "C" {
            #[link_name = "\u{1}_ZNK6octave9type_info14binary_ops_mapEv"]
            pub fn type_info_binary_ops_map(
                this: *const root::octave::type_info,
            ) -> root::octave_scalar_map;
        }
        extern "C" {
            #[link_name = "\u{1}_ZNK6octave9type_info23compound_binary_ops_mapEv"]
            pub fn type_info_compound_binary_ops_map(
                this: *const root::octave::type_info,
            ) -> root::octave_scalar_map;
        }
        extern "C" {
            #[link_name = "\u{1}_ZNK6octave9type_info14assign_ops_mapEv"]
            pub fn type_info_assign_ops_map(
                this: *const root::octave::type_info,
            ) -> root::octave_scalar_map;
        }
        extern "C" {
            #[link_name = "\u{1}_ZNK6octave9type_info17assignany_ops_mapEv"]
            pub fn type_info_assignany_ops_map(
                this: *const root::octave::type_info,
            ) -> root::octave_scalar_map;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave9type_infoC1Ei"]
            pub fn type_info_type_info(
                this: *mut root::octave::type_info,
                init_tab_sz: ::std::os::raw::c_int,
            );
        }
        impl type_info {
            #[inline]
            pub unsafe fn register_type(
                &mut self,
                arg1: *const root::std::string,
                arg2: *const root::std::string,
                arg3: *const root::octave_value,
                abort_on_duplicate: bool,
            ) -> ::std::os::raw::c_int {
                type_info_register_type(self, arg1, arg2, arg3, abort_on_duplicate)
            }
            #[inline]
            pub unsafe fn register_unary_class_op(
                &mut self,
                arg1: root::octave_value_unary_op,
                arg2: root::octave::type_info_unary_class_op_fcn,
                abort_on_duplicate: bool,
            ) -> bool {
                type_info_register_unary_class_op(self, arg1, arg2, abort_on_duplicate)
            }
            #[inline]
            pub unsafe fn register_unary_op(
                &mut self,
                arg1: root::octave_value_unary_op,
                arg2: ::std::os::raw::c_int,
                arg3: root::octave::type_info_unary_op_fcn,
                abort_on_duplicate: bool,
            ) -> bool {
                type_info_register_unary_op(self, arg1, arg2, arg3, abort_on_duplicate)
            }
            #[inline]
            pub unsafe fn register_non_const_unary_op(
                &mut self,
                arg1: root::octave_value_unary_op,
                arg2: ::std::os::raw::c_int,
                arg3: root::octave::type_info_non_const_unary_op_fcn,
                abort_on_duplicate: bool,
            ) -> bool {
                type_info_register_non_const_unary_op(self, arg1, arg2, arg3, abort_on_duplicate)
            }
            #[inline]
            pub unsafe fn register_binary_class_op(
                &mut self,
                arg1: root::octave_value_binary_op,
                arg2: root::octave::type_info_binary_class_op_fcn,
                abort_on_duplicate: bool,
            ) -> bool {
                type_info_register_binary_class_op(self, arg1, arg2, abort_on_duplicate)
            }
            #[inline]
            pub unsafe fn register_binary_op(
                &mut self,
                arg1: root::octave_value_binary_op,
                arg2: ::std::os::raw::c_int,
                arg3: ::std::os::raw::c_int,
                arg4: root::octave::type_info_binary_op_fcn,
                abort_on_duplicate: bool,
            ) -> bool {
                type_info_register_binary_op(self, arg1, arg2, arg3, arg4, abort_on_duplicate)
            }
            #[inline]
            pub unsafe fn register_binary_class_op1(
                &mut self,
                arg1: root::octave_value_compound_binary_op,
                arg2: root::octave::type_info_binary_class_op_fcn,
                abort_on_duplicate: bool,
            ) -> bool {
                type_info_register_binary_class_op1(self, arg1, arg2, abort_on_duplicate)
            }
            #[inline]
            pub unsafe fn register_binary_op1(
                &mut self,
                arg1: root::octave_value_compound_binary_op,
                arg2: ::std::os::raw::c_int,
                arg3: ::std::os::raw::c_int,
                arg4: root::octave::type_info_binary_op_fcn,
                abort_on_duplicate: bool,
            ) -> bool {
                type_info_register_binary_op1(self, arg1, arg2, arg3, arg4, abort_on_duplicate)
            }
            #[inline]
            pub unsafe fn register_cat_op(
                &mut self,
                arg1: ::std::os::raw::c_int,
                arg2: ::std::os::raw::c_int,
                arg3: root::octave::type_info_cat_op_fcn,
                abort_on_duplicate: bool,
            ) -> bool {
                type_info_register_cat_op(self, arg1, arg2, arg3, abort_on_duplicate)
            }
            #[inline]
            pub unsafe fn register_assign_op(
                &mut self,
                arg1: root::octave_value_assign_op,
                arg2: ::std::os::raw::c_int,
                arg3: ::std::os::raw::c_int,
                arg4: root::octave::type_info_assign_op_fcn,
                abort_on_duplicate: bool,
            ) -> bool {
                type_info_register_assign_op(self, arg1, arg2, arg3, arg4, abort_on_duplicate)
            }
            #[inline]
            pub unsafe fn register_assignany_op(
                &mut self,
                arg1: root::octave_value_assign_op,
                arg2: ::std::os::raw::c_int,
                arg3: root::octave::type_info_assignany_op_fcn,
                abort_on_duplicate: bool,
            ) -> bool {
                type_info_register_assignany_op(self, arg1, arg2, arg3, abort_on_duplicate)
            }
            #[inline]
            pub unsafe fn register_pref_assign_conv(
                &mut self,
                arg1: ::std::os::raw::c_int,
                arg2: ::std::os::raw::c_int,
                arg3: ::std::os::raw::c_int,
                abort_on_duplicate: bool,
            ) -> bool {
                type_info_register_pref_assign_conv(self, arg1, arg2, arg3, abort_on_duplicate)
            }
            #[inline]
            pub unsafe fn register_widening_op(
                &mut self,
                arg1: ::std::os::raw::c_int,
                arg2: ::std::os::raw::c_int,
                arg3: root::octave_base_value_type_conv_fcn,
                abort_on_duplicate: bool,
            ) -> bool {
                type_info_register_widening_op(self, arg1, arg2, arg3, abort_on_duplicate)
            }
            #[inline]
            pub unsafe fn lookup_type(
                &mut self,
                nm: *const root::std::string,
            ) -> root::octave_value {
                type_info_lookup_type(self, nm)
            }
            #[inline]
            pub unsafe fn lookup_unary_class_op(
                &mut self,
                arg1: root::octave_value_unary_op,
            ) -> root::octave::type_info_unary_class_op_fcn {
                type_info_lookup_unary_class_op(self, arg1)
            }
            #[inline]
            pub unsafe fn lookup_unary_op(
                &mut self,
                arg1: root::octave_value_unary_op,
                arg2: ::std::os::raw::c_int,
            ) -> root::octave::type_info_unary_op_fcn {
                type_info_lookup_unary_op(self, arg1, arg2)
            }
            #[inline]
            pub unsafe fn lookup_non_const_unary_op(
                &mut self,
                arg1: root::octave_value_unary_op,
                arg2: ::std::os::raw::c_int,
            ) -> root::octave::type_info_non_const_unary_op_fcn {
                type_info_lookup_non_const_unary_op(self, arg1, arg2)
            }
            #[inline]
            pub unsafe fn lookup_binary_class_op(
                &mut self,
                arg1: root::octave_value_binary_op,
            ) -> root::octave::type_info_binary_class_op_fcn {
                type_info_lookup_binary_class_op(self, arg1)
            }
            #[inline]
            pub unsafe fn lookup_binary_op(
                &mut self,
                arg1: root::octave_value_binary_op,
                arg2: ::std::os::raw::c_int,
                arg3: ::std::os::raw::c_int,
            ) -> root::octave::type_info_binary_op_fcn {
                type_info_lookup_binary_op(self, arg1, arg2, arg3)
            }
            #[inline]
            pub unsafe fn lookup_binary_class_op1(
                &mut self,
                arg1: root::octave_value_compound_binary_op,
            ) -> root::octave::type_info_binary_class_op_fcn {
                type_info_lookup_binary_class_op1(self, arg1)
            }
            #[inline]
            pub unsafe fn lookup_binary_op1(
                &mut self,
                arg1: root::octave_value_compound_binary_op,
                arg2: ::std::os::raw::c_int,
                arg3: ::std::os::raw::c_int,
            ) -> root::octave::type_info_binary_op_fcn {
                type_info_lookup_binary_op1(self, arg1, arg2, arg3)
            }
            #[inline]
            pub unsafe fn lookup_cat_op(
                &mut self,
                arg1: ::std::os::raw::c_int,
                arg2: ::std::os::raw::c_int,
            ) -> root::octave::type_info_cat_op_fcn {
                type_info_lookup_cat_op(self, arg1, arg2)
            }
            #[inline]
            pub unsafe fn lookup_assign_op(
                &mut self,
                arg1: root::octave_value_assign_op,
                arg2: ::std::os::raw::c_int,
                arg3: ::std::os::raw::c_int,
            ) -> root::octave::type_info_assign_op_fcn {
                type_info_lookup_assign_op(self, arg1, arg2, arg3)
            }
            #[inline]
            pub unsafe fn lookup_assignany_op(
                &mut self,
                arg1: root::octave_value_assign_op,
                arg2: ::std::os::raw::c_int,
            ) -> root::octave::type_info_assignany_op_fcn {
                type_info_lookup_assignany_op(self, arg1, arg2)
            }
            #[inline]
            pub unsafe fn lookup_pref_assign_conv(
                &mut self,
                arg1: ::std::os::raw::c_int,
                arg2: ::std::os::raw::c_int,
            ) -> ::std::os::raw::c_int {
                type_info_lookup_pref_assign_conv(self, arg1, arg2)
            }
            #[inline]
            pub unsafe fn lookup_widening_op(
                &mut self,
                arg1: ::std::os::raw::c_int,
                arg2: ::std::os::raw::c_int,
            ) -> root::octave_base_value_type_conv_fcn {
                type_info_lookup_widening_op(self, arg1, arg2)
            }
            #[inline]
            pub unsafe fn installed_type_names(&self) -> root::string_vector {
                type_info_installed_type_names(self)
            }
            #[inline]
            pub unsafe fn installed_type_info(&self) -> root::octave_scalar_map {
                type_info_installed_type_info(self)
            }
            #[inline]
            pub unsafe fn unary_ops_map(&self) -> root::octave_scalar_map {
                type_info_unary_ops_map(self)
            }
            #[inline]
            pub unsafe fn non_const_unary_ops_map(&self) -> root::octave_scalar_map {
                type_info_non_const_unary_ops_map(self)
            }
            #[inline]
            pub unsafe fn binary_ops_map(&self) -> root::octave_scalar_map {
                type_info_binary_ops_map(self)
            }
            #[inline]
            pub unsafe fn compound_binary_ops_map(&self) -> root::octave_scalar_map {
                type_info_compound_binary_ops_map(self)
            }
            #[inline]
            pub unsafe fn assign_ops_map(&self) -> root::octave_scalar_map {
                type_info_assign_ops_map(self)
            }
            #[inline]
            pub unsafe fn assignany_ops_map(&self) -> root::octave_scalar_map {
                type_info_assignany_ops_map(self)
            }
            #[inline]
            pub unsafe fn new(init_tab_sz: ::std::os::raw::c_int) -> Self {
                let mut __bindgen_tmp = ::core::mem::uninitialized();
                type_info_type_info(&mut __bindgen_tmp, init_tab_sz);
                __bindgen_tmp
            }
        }
        #[repr(C)]
        pub struct base_list__bindgen_vtable(::std::os::raw::c_void);
        #[repr(C)]
        #[derive(Debug)]
        pub struct base_list {
            pub vtable_: *const base_list__bindgen_vtable,
            pub m_lst: u8,
        }
        pub type base_list_iterator = u8;
        pub type base_list_const_iterator = u8;
        pub type base_list_reverse_iterator = u8;
        pub type base_list_const_reverse_iterator = u8;
        #[repr(C)]
        #[derive(Debug)]
        pub struct regexp {
            pub pattern: root::std::string,
            pub options: root::octave::regexp_opts,
            pub data: *mut ::std::os::raw::c_void,
            pub m: root::std::string,
            pub named_pats: root::string_vector,
            pub nnames: ::std::os::raw::c_int,
            pub named_idx: root::Array<::std::os::raw::c_int>,
            pub who: root::std::string,
        }
        #[repr(C)]
        #[derive(Debug)]
        pub struct regexp_opts {
            pub x_case_insensitive: bool,
            pub x_dotexceptnewline: bool,
            pub x_emptymatch: bool,
            pub x_freespacing: bool,
            pub x_lineanchors: bool,
            pub x_once: bool,
        }
        #[test]
        fn bindgen_test_layout_regexp_opts() {
            assert_eq!(
                ::core::mem::size_of::<regexp_opts>(),
                6usize,
                concat!("Size of: ", stringify!(regexp_opts))
            );
            assert_eq!(
                ::core::mem::align_of::<regexp_opts>(),
                1usize,
                concat!("Alignment of ", stringify!(regexp_opts))
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<regexp_opts>())).x_case_insensitive as *const _ as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(regexp_opts),
                    "::",
                    stringify!(x_case_insensitive)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<regexp_opts>())).x_dotexceptnewline as *const _ as usize
                },
                1usize,
                concat!(
                    "Offset of field: ",
                    stringify!(regexp_opts),
                    "::",
                    stringify!(x_dotexceptnewline)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<regexp_opts>())).x_emptymatch as *const _ as usize
                },
                2usize,
                concat!(
                    "Offset of field: ",
                    stringify!(regexp_opts),
                    "::",
                    stringify!(x_emptymatch)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<regexp_opts>())).x_freespacing as *const _ as usize
                },
                3usize,
                concat!(
                    "Offset of field: ",
                    stringify!(regexp_opts),
                    "::",
                    stringify!(x_freespacing)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<regexp_opts>())).x_lineanchors as *const _ as usize
                },
                4usize,
                concat!(
                    "Offset of field: ",
                    stringify!(regexp_opts),
                    "::",
                    stringify!(x_lineanchors)
                )
            );
            assert_eq!(
                unsafe { &(*(::core::ptr::null::<regexp_opts>())).x_once as *const _ as usize },
                5usize,
                concat!(
                    "Offset of field: ",
                    stringify!(regexp_opts),
                    "::",
                    stringify!(x_once)
                )
            );
        }
        #[repr(C)]
        #[derive(Debug)]
        pub struct regexp_match_element {
            pub x_match_string: root::std::string,
            pub x_named_tokens: root::string_vector,
            pub x_tokens: root::string_vector,
            pub x_token_extents: root::Matrix,
            pub x_start: f64,
            pub x_end: f64,
        }
        #[test]
        fn bindgen_test_layout_regexp_match_element() {
            assert_eq!(
                ::core::mem::size_of::<regexp_match_element>(),
                168usize,
                concat!("Size of: ", stringify!(regexp_match_element))
            );
            assert_eq!(
                ::core::mem::align_of::<regexp_match_element>(),
                8usize,
                concat!("Alignment of ", stringify!(regexp_match_element))
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<regexp_match_element>())).x_match_string as *const _
                        as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(regexp_match_element),
                    "::",
                    stringify!(x_match_string)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<regexp_match_element>())).x_named_tokens as *const _
                        as usize
                },
                32usize,
                concat!(
                    "Offset of field: ",
                    stringify!(regexp_match_element),
                    "::",
                    stringify!(x_named_tokens)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<regexp_match_element>())).x_tokens as *const _ as usize
                },
                72usize,
                concat!(
                    "Offset of field: ",
                    stringify!(regexp_match_element),
                    "::",
                    stringify!(x_tokens)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<regexp_match_element>())).x_token_extents as *const _
                        as usize
                },
                112usize,
                concat!(
                    "Offset of field: ",
                    stringify!(regexp_match_element),
                    "::",
                    stringify!(x_token_extents)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<regexp_match_element>())).x_start as *const _ as usize
                },
                152usize,
                concat!(
                    "Offset of field: ",
                    stringify!(regexp_match_element),
                    "::",
                    stringify!(x_start)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<regexp_match_element>())).x_end as *const _ as usize
                },
                160usize,
                concat!(
                    "Offset of field: ",
                    stringify!(regexp_match_element),
                    "::",
                    stringify!(x_end)
                )
            );
        }
        #[repr(C)]
        #[derive(Debug)]
        pub struct regexp_match_data {
            pub _base: root::octave::base_list,
            pub named_pats: root::string_vector,
        }
        #[test]
        fn bindgen_test_layout_regexp_match_data() {
            assert_eq!(
                ::core::mem::size_of::<regexp_match_data>(),
                72usize,
                concat!("Size of: ", stringify!(regexp_match_data))
            );
            assert_eq!(
                ::core::mem::align_of::<regexp_match_data>(),
                8usize,
                concat!("Alignment of ", stringify!(regexp_match_data))
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<regexp_match_data>())).named_pats as *const _ as usize
                },
                32usize,
                concat!(
                    "Offset of field: ",
                    stringify!(regexp_match_data),
                    "::",
                    stringify!(named_pats)
                )
            );
        }
        #[test]
        fn bindgen_test_layout_regexp() {
            assert_eq!(
                ::core::mem::size_of::<regexp>(),
                200usize,
                concat!("Size of: ", stringify!(regexp))
            );
            assert_eq!(
                ::core::mem::align_of::<regexp>(),
                8usize,
                concat!("Alignment of ", stringify!(regexp))
            );
            assert_eq!(
                unsafe { &(*(::core::ptr::null::<regexp>())).pattern as *const _ as usize },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(regexp),
                    "::",
                    stringify!(pattern)
                )
            );
            assert_eq!(
                unsafe { &(*(::core::ptr::null::<regexp>())).options as *const _ as usize },
                32usize,
                concat!(
                    "Offset of field: ",
                    stringify!(regexp),
                    "::",
                    stringify!(options)
                )
            );
            assert_eq!(
                unsafe { &(*(::core::ptr::null::<regexp>())).data as *const _ as usize },
                40usize,
                concat!(
                    "Offset of field: ",
                    stringify!(regexp),
                    "::",
                    stringify!(data)
                )
            );
            assert_eq!(
                unsafe { &(*(::core::ptr::null::<regexp>())).m as *const _ as usize },
                48usize,
                concat!("Offset of field: ", stringify!(regexp), "::", stringify!(m))
            );
            assert_eq!(
                unsafe { &(*(::core::ptr::null::<regexp>())).named_pats as *const _ as usize },
                80usize,
                concat!(
                    "Offset of field: ",
                    stringify!(regexp),
                    "::",
                    stringify!(named_pats)
                )
            );
            assert_eq!(
                unsafe { &(*(::core::ptr::null::<regexp>())).nnames as *const _ as usize },
                120usize,
                concat!(
                    "Offset of field: ",
                    stringify!(regexp),
                    "::",
                    stringify!(nnames)
                )
            );
            assert_eq!(
                unsafe { &(*(::core::ptr::null::<regexp>())).named_idx as *const _ as usize },
                128usize,
                concat!(
                    "Offset of field: ",
                    stringify!(regexp),
                    "::",
                    stringify!(named_idx)
                )
            );
            assert_eq!(
                unsafe { &(*(::core::ptr::null::<regexp>())).who as *const _ as usize },
                168usize,
                concat!(
                    "Offset of field: ",
                    stringify!(regexp),
                    "::",
                    stringify!(who)
                )
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave6regexp5matchERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
            pub fn regexp_match(
                this: *mut root::octave::regexp,
                buffer: *const root::std::string,
            ) -> root::octave::regexp_match_data;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave6regexp8is_matchERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
            pub fn regexp_is_match(
                this: *mut root::octave::regexp,
                buffer: *const root::std::string,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave6regexp8is_matchERK13string_vector"]
            pub fn regexp_is_match1(
                this: *mut root::octave::regexp,
                buffer: *const root::string_vector,
            ) -> root::Array<bool>;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave6regexp7replaceERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEES8_"]
            pub fn regexp_replace(
                this: *mut root::octave::regexp,
                buffer: *const root::std::string,
                replacement: *const root::std::string,
            ) -> root::std::string;
        }
        impl regexp {
            #[inline]
            pub unsafe fn match_(
                &mut self,
                buffer: *const root::std::string,
            ) -> root::octave::regexp_match_data {
                regexp_match(self, buffer)
            }
            #[inline]
            pub unsafe fn is_match(&mut self, buffer: *const root::std::string) -> bool {
                regexp_is_match(self, buffer)
            }
            #[inline]
            pub unsafe fn is_match1(
                &mut self,
                buffer: *const root::string_vector,
            ) -> root::Array<bool> {
                regexp_is_match1(self, buffer)
            }
            #[inline]
            pub unsafe fn replace(
                &mut self,
                buffer: *const root::std::string,
                replacement: *const root::std::string,
            ) -> root::std::string {
                regexp_replace(self, buffer, replacement)
            }
        }
        #[repr(C)]
        #[derive(Debug)]
        pub struct symbol_record {
            pub m_rep: [u64; 2usize],
        }
        pub type symbol_record_context_id = usize;
        #[repr(C)]
        #[derive(Debug)]
        pub struct symbol_record_symbol_record_rep {
            pub m_storage_class: ::std::os::raw::c_uint,
            pub m_name: root::std::string,
            pub m_fwd_scope: [u64; 2usize],
            pub m_fwd_rep: [u64; 2usize],
            pub m_value_stack: [u64; 10usize],
        }
        #[test]
        fn bindgen_test_layout_symbol_record_symbol_record_rep() {
            assert_eq!(
                ::core::mem::size_of::<symbol_record_symbol_record_rep>(),
                152usize,
                concat!("Size of: ", stringify!(symbol_record_symbol_record_rep))
            );
            assert_eq!(
                ::core::mem::align_of::<symbol_record_symbol_record_rep>(),
                8usize,
                concat!("Alignment of ", stringify!(symbol_record_symbol_record_rep))
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<symbol_record_symbol_record_rep>())).m_storage_class
                        as *const _ as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(symbol_record_symbol_record_rep),
                    "::",
                    stringify!(m_storage_class)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<symbol_record_symbol_record_rep>())).m_name as *const _
                        as usize
                },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(symbol_record_symbol_record_rep),
                    "::",
                    stringify!(m_name)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<symbol_record_symbol_record_rep>())).m_fwd_scope
                        as *const _ as usize
                },
                40usize,
                concat!(
                    "Offset of field: ",
                    stringify!(symbol_record_symbol_record_rep),
                    "::",
                    stringify!(m_fwd_scope)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<symbol_record_symbol_record_rep>())).m_fwd_rep
                        as *const _ as usize
                },
                56usize,
                concat!(
                    "Offset of field: ",
                    stringify!(symbol_record_symbol_record_rep),
                    "::",
                    stringify!(m_fwd_rep)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<symbol_record_symbol_record_rep>())).m_value_stack
                        as *const _ as usize
                },
                72usize,
                concat!(
                    "Offset of field: ",
                    stringify!(symbol_record_symbol_record_rep),
                    "::",
                    stringify!(m_value_stack)
                )
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZNK6octave13symbol_record17symbol_record_rep21get_fwd_scope_contextEv"]
            pub fn symbol_record_symbol_record_rep_get_fwd_scope_context(
                this: *const root::octave::symbol_record_symbol_record_rep,
            ) -> root::octave::symbol_record_context_id;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave13symbol_record17symbol_record_rep15init_persistentEv"]
            pub fn symbol_record_symbol_record_rep_init_persistent(
                this: *mut root::octave::symbol_record_symbol_record_rep,
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZNK6octave13symbol_record17symbol_record_rep3dupERKSt10shared_ptrINS_16symbol_scope_repEE"]
            pub fn symbol_record_symbol_record_rep_dup(
                this: *const root::octave::symbol_record_symbol_record_rep,
                new_scope: *const [u64; 2usize],
            ) -> [u64; 2usize];
        }
        extern "C" {
            #[link_name = "\u{1}_ZNK6octave13symbol_record17symbol_record_rep4dumpEm"]
            pub fn symbol_record_symbol_record_rep_dump(
                this: *const root::octave::symbol_record_symbol_record_rep,
                context: root::octave::symbol_record_context_id,
            ) -> root::octave_value;
        }
        impl symbol_record_symbol_record_rep {
            #[inline]
            pub unsafe fn get_fwd_scope_context(&self) -> root::octave::symbol_record_context_id {
                symbol_record_symbol_record_rep_get_fwd_scope_context(self)
            }
            #[inline]
            pub unsafe fn init_persistent(&mut self) {
                symbol_record_symbol_record_rep_init_persistent(self)
            }
            #[inline]
            pub unsafe fn dup(&self, new_scope: *const [u64; 2usize]) -> [u64; 2usize] {
                symbol_record_symbol_record_rep_dup(self, new_scope)
            }
            #[inline]
            pub unsafe fn dump(
                &self,
                context: root::octave::symbol_record_context_id,
            ) -> root::octave_value {
                symbol_record_symbol_record_rep_dump(self, context)
            }
        }
        pub const symbol_record_local: ::std::os::raw::c_uint = 1;
        pub const symbol_record_automatic: ::std::os::raw::c_uint = 2;
        pub const symbol_record_formal: ::std::os::raw::c_uint = 4;
        pub const symbol_record_hidden: ::std::os::raw::c_uint = 8;
        pub const symbol_record_inherited: ::std::os::raw::c_uint = 16;
        pub const symbol_record_global: ::std::os::raw::c_uint = 32;
        pub const symbol_record_persistent: ::std::os::raw::c_uint = 64;
        pub const symbol_record_added_static: ::std::os::raw::c_uint = 128;
        extern "C" {
            #[link_name = "\u{1}_ZN6octave13symbol_record18dummy_octave_valueE"]
            pub static mut symbol_record_dummy_octave_value: root::octave_value;
        }
        #[test]
        fn bindgen_test_layout_symbol_record() {
            assert_eq!(
                ::core::mem::size_of::<symbol_record>(),
                16usize,
                concat!("Size of: ", stringify!(symbol_record))
            );
            assert_eq!(
                ::core::mem::align_of::<symbol_record>(),
                8usize,
                concat!("Alignment of ", stringify!(symbol_record))
            );
            assert_eq!(
                unsafe { &(*(::core::ptr::null::<symbol_record>())).m_rep as *const _ as usize },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(symbol_record),
                    "::",
                    stringify!(m_rep)
                )
            );
        }
        #[repr(C)]
        #[derive(Debug)]
        pub struct symbol_scope_rep {
            pub _base: [u64; 2usize],
            #[doc = "! Name for this scope (usually the corresponding filename of the"]
            #[doc = "! function corresponding to the scope)."]
            pub m_name: root::std::string,
            #[doc = "! Map from symbol names to symbol info."]
            pub m_symbols: [u64; 6usize],
            #[doc = "! Map from symbol names to subfunctions."]
            pub m_subfunctions: [u64; 6usize],
            #[doc = "! The list of subfunctions (if any) in the order they appear in"]
            #[doc = "! the function file."]
            pub m_subfunction_names: [u64; 3usize],
            #[doc = "! The associated user code (may be null)."]
            pub m_fcn: *mut root::octave_user_function,
            #[doc = "! Parent of nested function (may be null)."]
            pub m_parent: [u64; 2usize],
            #[doc = "! Primary (top) parent of nested function (may be null).  Used"]
            #[doc = "! to determine whether two nested functions are related."]
            pub m_primary_parent: [u64; 2usize],
            #[doc = "! Child nested functions."]
            pub m_children: [u64; 3usize],
            #[doc = "! If true, then this scope belongs to a nested function."]
            pub m_nesting_depth: usize,
            #[doc = "! If true then no variables can be added."]
            pub m_is_static: bool,
            pub m_context: root::octave::symbol_record_context_id,
        }
        pub type symbol_scope_rep_table_const_iterator = u64;
        pub type symbol_scope_rep_table_iterator = u64;
        pub type symbol_scope_rep_subfunctions_const_iterator = u64;
        pub type symbol_scope_rep_subfunctions_iterator = u64;
        #[test]
        fn bindgen_test_layout_symbol_scope_rep() {
            assert_eq!(
                ::core::mem::size_of::<symbol_scope_rep>(),
                256usize,
                concat!("Size of: ", stringify!(symbol_scope_rep))
            );
            assert_eq!(
                ::core::mem::align_of::<symbol_scope_rep>(),
                8usize,
                concat!("Alignment of ", stringify!(symbol_scope_rep))
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<symbol_scope_rep>())).m_name as *const _ as usize
                },
                16usize,
                concat!(
                    "Offset of field: ",
                    stringify!(symbol_scope_rep),
                    "::",
                    stringify!(m_name)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<symbol_scope_rep>())).m_symbols as *const _ as usize
                },
                48usize,
                concat!(
                    "Offset of field: ",
                    stringify!(symbol_scope_rep),
                    "::",
                    stringify!(m_symbols)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<symbol_scope_rep>())).m_subfunctions as *const _
                        as usize
                },
                96usize,
                concat!(
                    "Offset of field: ",
                    stringify!(symbol_scope_rep),
                    "::",
                    stringify!(m_subfunctions)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<symbol_scope_rep>())).m_subfunction_names as *const _
                        as usize
                },
                144usize,
                concat!(
                    "Offset of field: ",
                    stringify!(symbol_scope_rep),
                    "::",
                    stringify!(m_subfunction_names)
                )
            );
            assert_eq!(
                unsafe { &(*(::core::ptr::null::<symbol_scope_rep>())).m_fcn as *const _ as usize },
                168usize,
                concat!(
                    "Offset of field: ",
                    stringify!(symbol_scope_rep),
                    "::",
                    stringify!(m_fcn)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<symbol_scope_rep>())).m_parent as *const _ as usize
                },
                176usize,
                concat!(
                    "Offset of field: ",
                    stringify!(symbol_scope_rep),
                    "::",
                    stringify!(m_parent)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<symbol_scope_rep>())).m_primary_parent as *const _
                        as usize
                },
                192usize,
                concat!(
                    "Offset of field: ",
                    stringify!(symbol_scope_rep),
                    "::",
                    stringify!(m_primary_parent)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<symbol_scope_rep>())).m_children as *const _ as usize
                },
                208usize,
                concat!(
                    "Offset of field: ",
                    stringify!(symbol_scope_rep),
                    "::",
                    stringify!(m_children)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<symbol_scope_rep>())).m_nesting_depth as *const _
                        as usize
                },
                232usize,
                concat!(
                    "Offset of field: ",
                    stringify!(symbol_scope_rep),
                    "::",
                    stringify!(m_nesting_depth)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<symbol_scope_rep>())).m_is_static as *const _ as usize
                },
                240usize,
                concat!(
                    "Offset of field: ",
                    stringify!(symbol_scope_rep),
                    "::",
                    stringify!(m_is_static)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<symbol_scope_rep>())).m_context as *const _ as usize
                },
                248usize,
                concat!(
                    "Offset of field: ",
                    stringify!(symbol_scope_rep),
                    "::",
                    stringify!(m_context)
                )
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave16symbol_scope_rep21install_auto_fcn_varsEv"]
            pub fn symbol_scope_rep_install_auto_fcn_vars(
                this: *mut root::octave::symbol_scope_rep,
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave16symbol_scope_rep20install_auto_fcn_varERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
            pub fn symbol_scope_rep_install_auto_fcn_var(
                this: *mut root::octave::symbol_scope_rep,
                name: *const root::std::string,
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave16symbol_scope_rep4findERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
            pub fn symbol_scope_rep_find(
                this: *mut root::octave::symbol_scope_rep,
                name: *const root::std::string,
            ) -> root::octave_value;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave16symbol_scope_rep6insertERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEb"]
            pub fn symbol_scope_rep_insert(
                this: *mut root::octave::symbol_scope_rep,
                name: *const root::std::string,
                force_add: bool,
            ) -> *mut root::octave::symbol_record;
        }
        extern "C" {
            #[link_name = "\u{1}_ZNK6octave16symbol_scope_rep16find_subfunctionERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
            pub fn symbol_scope_rep_find_subfunction(
                this: *const root::octave::symbol_scope_rep,
                name: *const root::std::string,
            ) -> root::octave_value;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave16symbol_scope_rep37mark_subfunctions_in_scope_as_privateERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
            pub fn symbol_scope_rep_mark_subfunctions_in_scope_as_private(
                this: *mut root::octave::symbol_scope_rep,
                class_name: *const root::std::string,
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZNK6octave16symbol_scope_rep4dumpEv"]
            pub fn symbol_scope_rep_dump(
                this: *const root::octave::symbol_scope_rep,
            ) -> root::octave_value;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave16symbol_scope_rep10set_parentERKSt10shared_ptrIS0_E"]
            pub fn symbol_scope_rep_set_parent(
                this: *mut root::octave::symbol_scope_rep,
                parent: *const [u64; 2usize],
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave16symbol_scope_rep18set_primary_parentERKSt10shared_ptrIS0_E"]
            pub fn symbol_scope_rep_set_primary_parent(
                this: *mut root::octave::symbol_scope_rep,
                parent: *const [u64; 2usize],
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZNK6octave16symbol_scope_rep11is_relativeERKSt10shared_ptrIS0_E"]
            pub fn symbol_scope_rep_is_relative(
                this: *const root::octave::symbol_scope_rep,
                scope: *const [u64; 2usize],
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave16symbol_scope_rep11update_nestEv"]
            pub fn symbol_scope_rep_update_nest(this: *mut root::octave::symbol_scope_rep);
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave16symbol_scope_rep13look_nonlocalERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEERNS_13symbol_recordE"]
            pub fn symbol_scope_rep_look_nonlocal(
                this: *mut root::octave::symbol_scope_rep,
                name: *const root::std::string,
                result: *mut root::octave::symbol_record,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave16symbol_scope_rep19bind_script_symbolsERKSt10shared_ptrIS0_E"]
            pub fn symbol_scope_rep_bind_script_symbols(
                this: *mut root::octave::symbol_scope_rep,
                curr_scope: *const [u64; 2usize],
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave16symbol_scope_rep21unbind_script_symbolsEv"]
            pub fn symbol_scope_rep_unbind_script_symbols(
                this: *mut root::octave::symbol_scope_rep,
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZNK6octave16symbol_scope_rep16dump_symbols_mapEv"]
            pub fn symbol_scope_rep_dump_symbols_map(
                this: *const root::octave::symbol_scope_rep,
            ) -> root::octave_value;
        }
        impl symbol_scope_rep {
            #[inline]
            pub unsafe fn install_auto_fcn_vars(&mut self) {
                symbol_scope_rep_install_auto_fcn_vars(self)
            }
            #[inline]
            pub unsafe fn install_auto_fcn_var(&mut self, name: *const root::std::string) {
                symbol_scope_rep_install_auto_fcn_var(self, name)
            }
            #[inline]
            pub unsafe fn find(&mut self, name: *const root::std::string) -> root::octave_value {
                symbol_scope_rep_find(self, name)
            }
            #[inline]
            pub unsafe fn insert(
                &mut self,
                name: *const root::std::string,
                force_add: bool,
            ) -> *mut root::octave::symbol_record {
                symbol_scope_rep_insert(self, name, force_add)
            }
            #[inline]
            pub unsafe fn find_subfunction(
                &self,
                name: *const root::std::string,
            ) -> root::octave_value {
                symbol_scope_rep_find_subfunction(self, name)
            }
            #[inline]
            pub unsafe fn mark_subfunctions_in_scope_as_private(
                &mut self,
                class_name: *const root::std::string,
            ) {
                symbol_scope_rep_mark_subfunctions_in_scope_as_private(self, class_name)
            }
            #[inline]
            pub unsafe fn dump(&self) -> root::octave_value {
                symbol_scope_rep_dump(self)
            }
            #[inline]
            pub unsafe fn set_parent(&mut self, parent: *const [u64; 2usize]) {
                symbol_scope_rep_set_parent(self, parent)
            }
            #[inline]
            pub unsafe fn set_primary_parent(&mut self, parent: *const [u64; 2usize]) {
                symbol_scope_rep_set_primary_parent(self, parent)
            }
            #[inline]
            pub unsafe fn is_relative(&self, scope: *const [u64; 2usize]) -> bool {
                symbol_scope_rep_is_relative(self, scope)
            }
            #[inline]
            pub unsafe fn update_nest(&mut self) {
                symbol_scope_rep_update_nest(self)
            }
            #[inline]
            pub unsafe fn look_nonlocal(
                &mut self,
                name: *const root::std::string,
                result: *mut root::octave::symbol_record,
            ) -> bool {
                symbol_scope_rep_look_nonlocal(self, name, result)
            }
            #[inline]
            pub unsafe fn bind_script_symbols(&mut self, curr_scope: *const [u64; 2usize]) {
                symbol_scope_rep_bind_script_symbols(self, curr_scope)
            }
            #[inline]
            pub unsafe fn unbind_script_symbols(&mut self) {
                symbol_scope_rep_unbind_script_symbols(self)
            }
            #[inline]
            pub unsafe fn dump_symbols_map(&self) -> root::octave_value {
                symbol_scope_rep_dump_symbols_map(self)
            }
        }
        #[repr(C)]
        #[derive(Debug)]
        pub struct symbol_scope {
            pub m_rep: [u64; 2usize],
        }
        #[test]
        fn bindgen_test_layout_symbol_scope() {
            assert_eq!(
                ::core::mem::size_of::<symbol_scope>(),
                16usize,
                concat!("Size of: ", stringify!(symbol_scope))
            );
            assert_eq!(
                ::core::mem::align_of::<symbol_scope>(),
                8usize,
                concat!("Alignment of ", stringify!(symbol_scope))
            );
            assert_eq!(
                unsafe { &(*(::core::ptr::null::<symbol_scope>())).m_rep as *const _ as usize },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(symbol_scope),
                    "::",
                    stringify!(m_rep)
                )
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct tree_evaluator {
            _unused: [u8; 0],
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct tree_walker {
            _unused: [u8; 0],
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct jit_type {
            _unused: [u8; 0],
        }
        #[repr(C)]
        #[derive(Debug)]
        pub struct dynamic_library {
            pub rep: *mut root::octave::dynamic_library_dynlib_rep,
        }
        pub type dynamic_library_name_mangler = ::core::option::Option<
            unsafe extern "C" fn(arg1: *const root::std::string) -> root::std::string,
        >;
        #[repr(C)]
        pub struct dynamic_library_dynlib_rep__bindgen_vtable(::std::os::raw::c_void);
        #[repr(C)]
        #[derive(Debug)]
        pub struct dynamic_library_dynlib_rep {
            pub vtable_: *const dynamic_library_dynlib_rep__bindgen_vtable,
            pub count: root::octave::refcount<::std::os::raw::c_int>,
            pub file: root::std::string,
            pub tm_loaded: root::octave::sys::time,
            pub fcn_names: [u64; 6usize],
            pub search_all_loaded: bool,
        }
        pub type dynamic_library_dynlib_rep_fcn_names_iterator = u8;
        pub type dynamic_library_dynlib_rep_fcn_names_const_iterator = u8;
        extern "C" {
            #[link_name = "\u{1}_ZN6octave15dynamic_library10dynlib_rep9instancesB5cxx11E"]
            pub static mut dynamic_library_dynlib_rep_instances: [u64; 6usize];
        }
        #[test]
        fn bindgen_test_layout_dynamic_library_dynlib_rep() {
            assert_eq!(
                ::core::mem::size_of::<dynamic_library_dynlib_rep>(),
                120usize,
                concat!("Size of: ", stringify!(dynamic_library_dynlib_rep))
            );
            assert_eq!(
                ::core::mem::align_of::<dynamic_library_dynlib_rep>(),
                8usize,
                concat!("Alignment of ", stringify!(dynamic_library_dynlib_rep))
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<dynamic_library_dynlib_rep>())).count as *const _
                        as usize
                },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(dynamic_library_dynlib_rep),
                    "::",
                    stringify!(count)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<dynamic_library_dynlib_rep>())).file as *const _
                        as usize
                },
                16usize,
                concat!(
                    "Offset of field: ",
                    stringify!(dynamic_library_dynlib_rep),
                    "::",
                    stringify!(file)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<dynamic_library_dynlib_rep>())).tm_loaded as *const _
                        as usize
                },
                48usize,
                concat!(
                    "Offset of field: ",
                    stringify!(dynamic_library_dynlib_rep),
                    "::",
                    stringify!(tm_loaded)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<dynamic_library_dynlib_rep>())).fcn_names as *const _
                        as usize
                },
                64usize,
                concat!(
                    "Offset of field: ",
                    stringify!(dynamic_library_dynlib_rep),
                    "::",
                    stringify!(fcn_names)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<dynamic_library_dynlib_rep>())).search_all_loaded
                        as *const _ as usize
                },
                112usize,
                concat!(
                    "Offset of field: ",
                    stringify!(dynamic_library_dynlib_rep),
                    "::",
                    stringify!(search_all_loaded)
                )
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZNK6octave15dynamic_library10dynlib_rep14is_out_of_dateEv"]
            pub fn dynamic_library_dynlib_rep_is_out_of_date(
                this: *const root::octave::dynamic_library_dynlib_rep,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave15dynamic_library10dynlib_rep12new_instanceERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
            pub fn dynamic_library_dynlib_rep_new_instance(
                f: *const root::std::string,
            ) -> *mut root::octave::dynamic_library_dynlib_rep;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave15dynamic_library10dynlib_rep12get_instanceERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEb"]
            pub fn dynamic_library_dynlib_rep_get_instance(
                f: *const root::std::string,
                fake: bool,
            ) -> *mut root::octave::dynamic_library_dynlib_rep;
        }
        extern "C" {
            #[link_name = "\u{1}_ZNK6octave15dynamic_library10dynlib_rep14function_namesB5cxx11Ev"]
            pub fn dynamic_library_dynlib_rep_function_names(
                this: *const root::octave::dynamic_library_dynlib_rep,
            ) -> [u64; 3usize];
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave15dynamic_library10dynlib_rep12add_fcn_nameERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
            pub fn dynamic_library_dynlib_rep_add_fcn_name(
                this: *mut root::octave::dynamic_library_dynlib_rep,
                arg1: *const root::std::string,
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave15dynamic_library10dynlib_rep15remove_fcn_nameERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
            pub fn dynamic_library_dynlib_rep_remove_fcn_name(
                this: *mut root::octave::dynamic_library_dynlib_rep,
                arg1: *const root::std::string,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave15dynamic_library10dynlib_rep11fake_reloadEv"]
            pub fn dynamic_library_dynlib_rep_fake_reload(
                this: *mut root::octave::dynamic_library_dynlib_rep,
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave15dynamic_library10dynlib_repC1ERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
            pub fn dynamic_library_dynlib_rep_dynlib_rep(
                this: *mut root::octave::dynamic_library_dynlib_rep,
                f: *const root::std::string,
            );
        }
        impl dynamic_library_dynlib_rep {
            #[inline]
            pub unsafe fn is_out_of_date(&self) -> bool {
                dynamic_library_dynlib_rep_is_out_of_date(self)
            }
            #[inline]
            pub unsafe fn new_instance(
                f: *const root::std::string,
            ) -> *mut root::octave::dynamic_library_dynlib_rep {
                dynamic_library_dynlib_rep_new_instance(f)
            }
            #[inline]
            pub unsafe fn get_instance(
                f: *const root::std::string,
                fake: bool,
            ) -> *mut root::octave::dynamic_library_dynlib_rep {
                dynamic_library_dynlib_rep_get_instance(f, fake)
            }
            #[inline]
            pub unsafe fn function_names(&self) -> [u64; 3usize] {
                dynamic_library_dynlib_rep_function_names(self)
            }
            #[inline]
            pub unsafe fn add_fcn_name(&mut self, arg1: *const root::std::string) {
                dynamic_library_dynlib_rep_add_fcn_name(self, arg1)
            }
            #[inline]
            pub unsafe fn remove_fcn_name(&mut self, arg1: *const root::std::string) -> bool {
                dynamic_library_dynlib_rep_remove_fcn_name(self, arg1)
            }
            #[inline]
            pub unsafe fn fake_reload(&mut self) {
                dynamic_library_dynlib_rep_fake_reload(self)
            }
            #[inline]
            pub unsafe fn new(f: *const root::std::string) -> Self {
                let mut __bindgen_tmp = ::core::mem::uninitialized();
                dynamic_library_dynlib_rep_dynlib_rep(&mut __bindgen_tmp, f);
                __bindgen_tmp
            }
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave15dynamic_library7nil_repE"]
            pub static mut dynamic_library_nil_rep: root::octave::dynamic_library_dynlib_rep;
        }
        #[test]
        fn bindgen_test_layout_dynamic_library() {
            assert_eq!(
                ::core::mem::size_of::<dynamic_library>(),
                8usize,
                concat!("Size of: ", stringify!(dynamic_library))
            );
            assert_eq!(
                ::core::mem::align_of::<dynamic_library>(),
                8usize,
                concat!("Alignment of ", stringify!(dynamic_library))
            );
            assert_eq!(
                unsafe { &(*(::core::ptr::null::<dynamic_library>())).rep as *const _ as usize },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(dynamic_library),
                    "::",
                    stringify!(rep)
                )
            );
        }
        #[repr(C)]
        #[derive(Debug)]
        pub struct auto_shlib {
            pub _base: root::octave::dynamic_library,
        }
        #[test]
        fn bindgen_test_layout_auto_shlib() {
            assert_eq!(
                ::core::mem::size_of::<auto_shlib>(),
                8usize,
                concat!("Size of: ", stringify!(auto_shlib))
            );
            assert_eq!(
                ::core::mem::align_of::<auto_shlib>(),
                8usize,
                concat!("Alignment of ", stringify!(auto_shlib))
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct help_system {
            pub m_interpreter: *mut root::octave::interpreter,
            pub m_built_in_docstrings_file: root::std::string,
            pub m_doc_cache_file: root::std::string,
            pub m_info_file: root::std::string,
            pub m_info_program: root::std::string,
            pub m_makeinfo_program: root::std::string,
            pub m_suppress_verbose_help_message: bool,
            pub m_texi_macros_file: root::std::string,
        }
        #[test]
        fn bindgen_test_layout_help_system() {
            assert_eq!(
                ::core::mem::size_of::<help_system>(),
                208usize,
                concat!("Size of: ", stringify!(help_system))
            );
            assert_eq!(
                ::core::mem::align_of::<help_system>(),
                8usize,
                concat!("Alignment of ", stringify!(help_system))
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<help_system>())).m_interpreter as *const _ as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(help_system),
                    "::",
                    stringify!(m_interpreter)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<help_system>())).m_built_in_docstrings_file as *const _
                        as usize
                },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(help_system),
                    "::",
                    stringify!(m_built_in_docstrings_file)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<help_system>())).m_doc_cache_file as *const _ as usize
                },
                40usize,
                concat!(
                    "Offset of field: ",
                    stringify!(help_system),
                    "::",
                    stringify!(m_doc_cache_file)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<help_system>())).m_info_file as *const _ as usize
                },
                72usize,
                concat!(
                    "Offset of field: ",
                    stringify!(help_system),
                    "::",
                    stringify!(m_info_file)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<help_system>())).m_info_program as *const _ as usize
                },
                104usize,
                concat!(
                    "Offset of field: ",
                    stringify!(help_system),
                    "::",
                    stringify!(m_info_program)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<help_system>())).m_makeinfo_program as *const _ as usize
                },
                136usize,
                concat!(
                    "Offset of field: ",
                    stringify!(help_system),
                    "::",
                    stringify!(m_makeinfo_program)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<help_system>())).m_suppress_verbose_help_message
                        as *const _ as usize
                },
                168usize,
                concat!(
                    "Offset of field: ",
                    stringify!(help_system),
                    "::",
                    stringify!(m_suppress_verbose_help_message)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<help_system>())).m_texi_macros_file as *const _ as usize
                },
                176usize,
                concat!(
                    "Offset of field: ",
                    stringify!(help_system),
                    "::",
                    stringify!(m_texi_macros_file)
                )
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave11help_system24built_in_docstrings_fileERK17octave_value_listi"]
            pub fn help_system_built_in_docstrings_file(
                this: *mut root::octave::help_system,
                args: *const root::octave_value_list,
                nargout: ::std::os::raw::c_int,
            ) -> root::octave_value;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave11help_system14doc_cache_fileERK17octave_value_listi"]
            pub fn help_system_doc_cache_file(
                this: *mut root::octave::help_system,
                args: *const root::octave_value_list,
                nargout: ::std::os::raw::c_int,
            ) -> root::octave_value;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave11help_system9info_fileERK17octave_value_listi"]
            pub fn help_system_info_file(
                this: *mut root::octave::help_system,
                args: *const root::octave_value_list,
                nargout: ::std::os::raw::c_int,
            ) -> root::octave_value;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave11help_system12info_programERK17octave_value_listi"]
            pub fn help_system_info_program(
                this: *mut root::octave::help_system,
                args: *const root::octave_value_list,
                nargout: ::std::os::raw::c_int,
            ) -> root::octave_value;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave11help_system16makeinfo_programERK17octave_value_listi"]
            pub fn help_system_makeinfo_program(
                this: *mut root::octave::help_system,
                args: *const root::octave_value_list,
                nargout: ::std::os::raw::c_int,
            ) -> root::octave_value;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave11help_system29suppress_verbose_help_messageERK17octave_value_listi"]
            pub fn help_system_suppress_verbose_help_message(
                this: *mut root::octave::help_system,
                args: *const root::octave_value_list,
                nargout: ::std::os::raw::c_int,
            ) -> root::octave_value;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave11help_system16texi_macros_fileERK17octave_value_listi"]
            pub fn help_system_texi_macros_file(
                this: *mut root::octave::help_system,
                args: *const root::octave_value_list,
                nargout: ::std::os::raw::c_int,
            ) -> root::octave_value;
        }
        extern "C" {
            #[link_name = "\u{1}_ZNK6octave11help_system8raw_helpERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEERb"]
            pub fn help_system_raw_help(
                this: *const root::octave::help_system,
                arg1: *const root::std::string,
                arg2: *mut bool,
            ) -> root::std::string;
        }
        extern "C" {
            #[link_name = "\u{1}_ZNK6octave11help_system5whichERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
            pub fn help_system_which(
                this: *const root::octave::help_system,
                name: *const root::std::string,
            ) -> root::std::string;
        }
        extern "C" {
            #[link_name = "\u{1}_ZNK6octave11help_system5whichERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEERS6_"]
            pub fn help_system_which1(
                this: *const root::octave::help_system,
                name: *const root::std::string,
                type_: *mut root::std::string,
            ) -> root::std::string;
        }
        extern "C" {
            #[link_name = "\u{1}_ZNK6octave11help_system14make_name_listEv"]
            pub fn help_system_make_name_list(
                this: *const root::octave::help_system,
            ) -> root::string_vector;
        }
        extern "C" {
            #[link_name = "\u{1}_ZNK6octave11help_system13get_help_textERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEERS6_S9_"]
            pub fn help_system_get_help_text(
                this: *const root::octave::help_system,
                name: *const root::std::string,
                text: *mut root::std::string,
                format: *mut root::std::string,
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZNK6octave11help_system23get_help_text_from_fileERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEERS6_S9_"]
            pub fn help_system_get_help_text_from_file(
                this: *const root::octave::help_system,
                fname: *const root::std::string,
                text: *mut root::std::string,
                format: *mut root::std::string,
            );
        }
        impl help_system {
            #[inline]
            pub unsafe fn built_in_docstrings_file(
                &mut self,
                args: *const root::octave_value_list,
                nargout: ::std::os::raw::c_int,
            ) -> root::octave_value {
                help_system_built_in_docstrings_file(self, args, nargout)
            }
            #[inline]
            pub unsafe fn doc_cache_file(
                &mut self,
                args: *const root::octave_value_list,
                nargout: ::std::os::raw::c_int,
            ) -> root::octave_value {
                help_system_doc_cache_file(self, args, nargout)
            }
            #[inline]
            pub unsafe fn info_file(
                &mut self,
                args: *const root::octave_value_list,
                nargout: ::std::os::raw::c_int,
            ) -> root::octave_value {
                help_system_info_file(self, args, nargout)
            }
            #[inline]
            pub unsafe fn info_program(
                &mut self,
                args: *const root::octave_value_list,
                nargout: ::std::os::raw::c_int,
            ) -> root::octave_value {
                help_system_info_program(self, args, nargout)
            }
            #[inline]
            pub unsafe fn makeinfo_program(
                &mut self,
                args: *const root::octave_value_list,
                nargout: ::std::os::raw::c_int,
            ) -> root::octave_value {
                help_system_makeinfo_program(self, args, nargout)
            }
            #[inline]
            pub unsafe fn suppress_verbose_help_message(
                &mut self,
                args: *const root::octave_value_list,
                nargout: ::std::os::raw::c_int,
            ) -> root::octave_value {
                help_system_suppress_verbose_help_message(self, args, nargout)
            }
            #[inline]
            pub unsafe fn texi_macros_file(
                &mut self,
                args: *const root::octave_value_list,
                nargout: ::std::os::raw::c_int,
            ) -> root::octave_value {
                help_system_texi_macros_file(self, args, nargout)
            }
            #[inline]
            pub unsafe fn raw_help(
                &self,
                arg1: *const root::std::string,
                arg2: *mut bool,
            ) -> root::std::string {
                help_system_raw_help(self, arg1, arg2)
            }
            #[inline]
            pub unsafe fn which(&self, name: *const root::std::string) -> root::std::string {
                help_system_which(self, name)
            }
            #[inline]
            pub unsafe fn which1(
                &self,
                name: *const root::std::string,
                type_: *mut root::std::string,
            ) -> root::std::string {
                help_system_which1(self, name, type_)
            }
            #[inline]
            pub unsafe fn make_name_list(&self) -> root::string_vector {
                help_system_make_name_list(self)
            }
            #[inline]
            pub unsafe fn get_help_text(
                &self,
                name: *const root::std::string,
                text: *mut root::std::string,
                format: *mut root::std::string,
            ) {
                help_system_get_help_text(self, name, text, format)
            }
            #[inline]
            pub unsafe fn get_help_text_from_file(
                &self,
                fname: *const root::std::string,
                text: *mut root::std::string,
                format: *mut root::std::string,
            ) {
                help_system_get_help_text_from_file(self, fname, text, format)
            }
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave14make_name_listEv"]
            pub fn make_name_list() -> root::string_vector;
        }
        #[repr(C)]
        pub struct pager_buf__bindgen_vtable(::std::os::raw::c_void);
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct pager_buf {
            pub vtable_: *const pager_buf__bindgen_vtable,
            pub _base: root::std::stringbuf,
            pub diary_skip: usize,
        }
        #[test]
        fn bindgen_test_layout_pager_buf() {
            assert_eq!(
                ::core::mem::size_of::<pager_buf>(),
                112usize,
                concat!("Size of: ", stringify!(pager_buf))
            );
            assert_eq!(
                ::core::mem::align_of::<pager_buf>(),
                8usize,
                concat!("Alignment of ", stringify!(pager_buf))
            );
            assert_eq!(
                unsafe { &(*(::core::ptr::null::<pager_buf>())).diary_skip as *const _ as usize },
                104usize,
                concat!(
                    "Offset of field: ",
                    stringify!(pager_buf),
                    "::",
                    stringify!(diary_skip)
                )
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave9pager_buf31flush_current_contents_to_diaryEv"]
            pub fn pager_buf_flush_current_contents_to_diary(this: *mut root::octave::pager_buf);
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave9pager_buf14set_diary_skipEv"]
            pub fn pager_buf_set_diary_skip(this: *mut root::octave::pager_buf);
        }
        impl pager_buf {
            #[inline]
            pub unsafe fn flush_current_contents_to_diary(&mut self) {
                pager_buf_flush_current_contents_to_diary(self)
            }
            #[inline]
            pub unsafe fn set_diary_skip(&mut self) {
                pager_buf_set_diary_skip(self)
            }
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave9pager_buf4syncEv"]
            pub fn pager_buf_sync(this: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int;
        }
        #[repr(C)]
        pub struct pager_stream__bindgen_vtable(::std::os::raw::c_void);
        #[repr(C)]
        pub struct pager_stream {
            pub vtable_: *const pager_stream__bindgen_vtable,
            pub _base: root::std::ostream,
            pub pb: *mut root::octave::pager_buf,
        }
        #[test]
        fn bindgen_test_layout_pager_stream() {
            assert_eq!(
                ::core::mem::size_of::<pager_stream>(),
                280usize,
                concat!("Size of: ", stringify!(pager_stream))
            );
            assert_eq!(
                ::core::mem::align_of::<pager_stream>(),
                8usize,
                concat!("Alignment of ", stringify!(pager_stream))
            );
            assert_eq!(
                unsafe { &(*(::core::ptr::null::<pager_stream>())).pb as *const _ as usize },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(pager_stream),
                    "::",
                    stringify!(pb)
                )
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave12pager_stream31flush_current_contents_to_diaryEv"]
            pub fn pager_stream_flush_current_contents_to_diary(
                this: *mut root::octave::pager_stream,
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave12pager_stream14set_diary_skipEv"]
            pub fn pager_stream_set_diary_skip(this: *mut root::octave::pager_stream);
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave12pager_stream6streamEv"]
            pub fn pager_stream_stream(
                this: *mut root::octave::pager_stream,
            ) -> *mut root::std::ostream;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave12pager_stream5resetEv"]
            pub fn pager_stream_reset(this: *mut root::octave::pager_stream);
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave12pager_streamC1Ev"]
            pub fn pager_stream_pager_stream(this: *mut root::octave::pager_stream);
        }
        impl pager_stream {
            #[inline]
            pub unsafe fn flush_current_contents_to_diary(&mut self) {
                pager_stream_flush_current_contents_to_diary(self)
            }
            #[inline]
            pub unsafe fn set_diary_skip(&mut self) {
                pager_stream_set_diary_skip(self)
            }
            #[inline]
            pub unsafe fn stream(&mut self) -> *mut root::std::ostream {
                pager_stream_stream(self)
            }
            #[inline]
            pub unsafe fn reset(&mut self) {
                pager_stream_reset(self)
            }
            #[inline]
            pub unsafe fn new() -> Self {
                let mut __bindgen_tmp = ::core::mem::uninitialized();
                pager_stream_pager_stream(&mut __bindgen_tmp);
                __bindgen_tmp
            }
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave12pager_streamD1Ev"]
            pub fn pager_stream_pager_stream_destructor(this: *mut root::octave::pager_stream);
        }
        #[repr(C)]
        pub struct diary_buf__bindgen_vtable(::std::os::raw::c_void);
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct diary_buf {
            pub vtable_: *const diary_buf__bindgen_vtable,
            pub _base: root::std::stringbuf,
        }
        #[test]
        fn bindgen_test_layout_diary_buf() {
            assert_eq!(
                ::core::mem::size_of::<diary_buf>(),
                104usize,
                concat!("Size of: ", stringify!(diary_buf))
            );
            assert_eq!(
                ::core::mem::align_of::<diary_buf>(),
                8usize,
                concat!("Alignment of ", stringify!(diary_buf))
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave9diary_buf4syncEv"]
            pub fn diary_buf_sync(this: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int;
        }
        #[repr(C)]
        pub struct diary_stream__bindgen_vtable(::std::os::raw::c_void);
        #[repr(C)]
        pub struct diary_stream {
            pub vtable_: *const diary_stream__bindgen_vtable,
            pub _base: root::std::ostream,
            pub db: *mut root::octave::diary_buf,
        }
        #[test]
        fn bindgen_test_layout_diary_stream() {
            assert_eq!(
                ::core::mem::size_of::<diary_stream>(),
                280usize,
                concat!("Size of: ", stringify!(diary_stream))
            );
            assert_eq!(
                ::core::mem::align_of::<diary_stream>(),
                8usize,
                concat!("Alignment of ", stringify!(diary_stream))
            );
            assert_eq!(
                unsafe { &(*(::core::ptr::null::<diary_stream>())).db as *const _ as usize },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(diary_stream),
                    "::",
                    stringify!(db)
                )
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave12diary_stream6streamEv"]
            pub fn diary_stream_stream(
                this: *mut root::octave::diary_stream,
            ) -> *mut root::std::ostream;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave12diary_stream5resetEv"]
            pub fn diary_stream_reset(this: *mut root::octave::diary_stream);
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave12diary_streamC1Ev"]
            pub fn diary_stream_diary_stream(this: *mut root::octave::diary_stream);
        }
        impl diary_stream {
            #[inline]
            pub unsafe fn stream(&mut self) -> *mut root::std::ostream {
                diary_stream_stream(self)
            }
            #[inline]
            pub unsafe fn reset(&mut self) {
                diary_stream_reset(self)
            }
            #[inline]
            pub unsafe fn new() -> Self {
                let mut __bindgen_tmp = ::core::mem::uninitialized();
                diary_stream_diary_stream(&mut __bindgen_tmp);
                __bindgen_tmp
            }
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave12diary_streamD1Ev"]
            pub fn diary_stream_diary_stream_destructor(this: *mut root::octave::diary_stream);
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave12flush_stdoutEv"]
            pub fn flush_stdout();
        }
        #[repr(C)]
        pub struct output_system {
            pub m_interpreter: *mut root::octave::interpreter,
            pub m_pager_stream: root::octave::pager_stream,
            pub m_diary_stream: root::octave::diary_stream,
            pub m_external_pager: *mut root::oprocstream,
            pub m_external_diary_file: root::std::ofstream,
            pub m_diary_file_name: root::std::string,
            pub m_PAGER: root::std::string,
            pub m_PAGER_FLAGS: root::std::string,
            pub m_page_output_immediately: bool,
            pub m_page_screen_output: bool,
            pub m_write_to_diary_file: bool,
            pub m_really_flush_to_pager: bool,
            pub m_flushing_output_to_pager: bool,
        }
        #[test]
        fn bindgen_test_layout_output_system() {
            assert_eq!(
                ::core::mem::size_of::<output_system>(),
                1192usize,
                concat!("Size of: ", stringify!(output_system))
            );
            assert_eq!(
                ::core::mem::align_of::<output_system>(),
                8usize,
                concat!("Alignment of ", stringify!(output_system))
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<output_system>())).m_interpreter as *const _ as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(output_system),
                    "::",
                    stringify!(m_interpreter)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<output_system>())).m_pager_stream as *const _ as usize
                },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(output_system),
                    "::",
                    stringify!(m_pager_stream)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<output_system>())).m_diary_stream as *const _ as usize
                },
                288usize,
                concat!(
                    "Offset of field: ",
                    stringify!(output_system),
                    "::",
                    stringify!(m_diary_stream)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<output_system>())).m_external_pager as *const _ as usize
                },
                568usize,
                concat!(
                    "Offset of field: ",
                    stringify!(output_system),
                    "::",
                    stringify!(m_external_pager)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<output_system>())).m_external_diary_file as *const _
                        as usize
                },
                576usize,
                concat!(
                    "Offset of field: ",
                    stringify!(output_system),
                    "::",
                    stringify!(m_external_diary_file)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<output_system>())).m_diary_file_name as *const _
                        as usize
                },
                1088usize,
                concat!(
                    "Offset of field: ",
                    stringify!(output_system),
                    "::",
                    stringify!(m_diary_file_name)
                )
            );
            assert_eq!(
                unsafe { &(*(::core::ptr::null::<output_system>())).m_PAGER as *const _ as usize },
                1120usize,
                concat!(
                    "Offset of field: ",
                    stringify!(output_system),
                    "::",
                    stringify!(m_PAGER)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<output_system>())).m_PAGER_FLAGS as *const _ as usize
                },
                1152usize,
                concat!(
                    "Offset of field: ",
                    stringify!(output_system),
                    "::",
                    stringify!(m_PAGER_FLAGS)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<output_system>())).m_page_output_immediately as *const _
                        as usize
                },
                1184usize,
                concat!(
                    "Offset of field: ",
                    stringify!(output_system),
                    "::",
                    stringify!(m_page_output_immediately)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<output_system>())).m_page_screen_output as *const _
                        as usize
                },
                1185usize,
                concat!(
                    "Offset of field: ",
                    stringify!(output_system),
                    "::",
                    stringify!(m_page_screen_output)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<output_system>())).m_write_to_diary_file as *const _
                        as usize
                },
                1186usize,
                concat!(
                    "Offset of field: ",
                    stringify!(output_system),
                    "::",
                    stringify!(m_write_to_diary_file)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<output_system>())).m_really_flush_to_pager as *const _
                        as usize
                },
                1187usize,
                concat!(
                    "Offset of field: ",
                    stringify!(output_system),
                    "::",
                    stringify!(m_really_flush_to_pager)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::core::ptr::null::<output_system>())).m_flushing_output_to_pager
                        as *const _ as usize
                },
                1188usize,
                concat!(
                    "Offset of field: ",
                    stringify!(output_system),
                    "::",
                    stringify!(m_flushing_output_to_pager)
                )
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave13output_system5PAGERERK17octave_value_listi"]
            pub fn output_system_PAGER(
                this: *mut root::octave::output_system,
                args: *const root::octave_value_list,
                nargout: ::std::os::raw::c_int,
            ) -> root::octave_value;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave13output_system11PAGER_FLAGSERK17octave_value_listi"]
            pub fn output_system_PAGER_FLAGS(
                this: *mut root::octave::output_system,
                args: *const root::octave_value_list,
                nargout: ::std::os::raw::c_int,
            ) -> root::octave_value;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave13output_system23page_output_immediatelyERK17octave_value_listi"]
            pub fn output_system_page_output_immediately(
                this: *mut root::octave::output_system,
                args: *const root::octave_value_list,
                nargout: ::std::os::raw::c_int,
            ) -> root::octave_value;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave13output_system18page_screen_outputERK17octave_value_listi"]
            pub fn output_system_page_screen_output(
                this: *mut root::octave::output_system,
                args: *const root::octave_value_list,
                nargout: ::std::os::raw::c_int,
            ) -> root::octave_value;
        }
        extern "C" {
            #[link_name = "\u{1}_ZNK6octave13output_system13pager_commandB5cxx11Ev"]
            pub fn output_system_pager_command(
                this: *const root::octave::output_system,
            ) -> root::std::string;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave13output_system5resetEv"]
            pub fn output_system_reset(this: *mut root::octave::output_system);
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave13output_system12flush_stdoutEv"]
            pub fn output_system_flush_stdout(this: *mut root::octave::output_system);
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave13output_system4syncEPKci"]
            pub fn output_system_sync(
                this: *mut root::octave::output_system,
                msg: *const ::std::os::raw::c_char,
                len: ::std::os::raw::c_int,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave13output_system20clear_external_pagerEv"]
            pub fn output_system_clear_external_pager(this: *mut root::octave::output_system);
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave13output_system10open_diaryEv"]
            pub fn output_system_open_diary(this: *mut root::octave::output_system);
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave13output_system11close_diaryEv"]
            pub fn output_system_close_diary(this: *mut root::octave::output_system);
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave13output_systemC1ERNS_11interpreterE"]
            pub fn output_system_output_system(
                this: *mut root::octave::output_system,
                interp: *mut root::octave::interpreter,
            );
        }
        impl output_system {
            #[inline]
            pub unsafe fn PAGER(
                &mut self,
                args: *const root::octave_value_list,
                nargout: ::std::os::raw::c_int,
            ) -> root::octave_value {
                output_system_PAGER(self, args, nargout)
            }
            #[inline]
            pub unsafe fn PAGER_FLAGS(
                &mut self,
                args: *const root::octave_value_list,
                nargout: ::std::os::raw::c_int,
            ) -> root::octave_value {
                output_system_PAGER_FLAGS(self, args, nargout)
            }
            #[inline]
            pub unsafe fn page_output_immediately(
                &mut self,
                args: *const root::octave_value_list,
                nargout: ::std::os::raw::c_int,
            ) -> root::octave_value {
                output_system_page_output_immediately(self, args, nargout)
            }
            #[inline]
            pub unsafe fn page_screen_output(
                &mut self,
                args: *const root::octave_value_list,
                nargout: ::std::os::raw::c_int,
            ) -> root::octave_value {
                output_system_page_screen_output(self, args, nargout)
            }
            #[inline]
            pub unsafe fn pager_command(&self) -> root::std::string {
                output_system_pager_command(self)
            }
            #[inline]
            pub unsafe fn reset(&mut self) {
                output_system_reset(self)
            }
            #[inline]
            pub unsafe fn flush_stdout(&mut self) {
                output_system_flush_stdout(self)
            }
            #[inline]
            pub unsafe fn sync(
                &mut self,
                msg: *const ::std::os::raw::c_char,
                len: ::std::os::raw::c_int,
            ) -> bool {
                output_system_sync(self, msg, len)
            }
            #[inline]
            pub unsafe fn clear_external_pager(&mut self) {
                output_system_clear_external_pager(self)
            }
            #[inline]
            pub unsafe fn open_diary(&mut self) {
                output_system_open_diary(self)
            }
            #[inline]
            pub unsafe fn close_diary(&mut self) {
                output_system_close_diary(self)
            }
            #[inline]
            pub unsafe fn new(interp: *mut root::octave::interpreter) -> Self {
                let mut __bindgen_tmp = ::core::mem::uninitialized();
                output_system_output_system(&mut __bindgen_tmp, interp);
                __bindgen_tmp
            }
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave10__stdout__Ev"]
            pub fn __stdout__() -> *mut root::std::ostream;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave9__diary__Ev"]
            pub fn __diary__() -> *mut root::std::ostream;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave16valid_identifierEPKc"]
            pub fn valid_identifier(s: *const ::std::os::raw::c_char) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave16valid_identifierERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
            pub fn valid_identifier1(s: *const root::std::string) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave9same_fileERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEES7_"]
            pub fn same_file(f: *const root::std::string, g: *const root::std::string) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave12almost_matchERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEES7_ii"]
            pub fn almost_match(
                std: *const root::std::string,
                s: *const root::std::string,
                min_match_len: ::std::os::raw::c_int,
                case_sens: ::std::os::raw::c_int,
            ) -> ::std::os::raw::c_int;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave20keyword_almost_matchEPKPKcPiRKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEii"]
            pub fn keyword_almost_match(
                std: *const *const ::std::os::raw::c_char,
                min_len: *mut ::std::os::raw::c_int,
                s: *const root::std::string,
                min_toks_to_match: ::std::os::raw::c_int,
                max_toks: ::std::os::raw::c_int,
            ) -> ::std::os::raw::c_int;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave20search_path_for_fileERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEERK13string_vector"]
            pub fn search_path_for_file(
                arg1: *const root::std::string,
                arg2: *const root::string_vector,
            ) -> root::std::string;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave25search_path_for_all_filesERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEERK13string_vector"]
            pub fn search_path_for_all_files(
                arg1: *const root::std::string,
                arg2: *const root::string_vector,
            ) -> root::string_vector;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave12file_in_pathERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEES7_"]
            pub fn file_in_path(
                arg1: *const root::std::string,
                arg2: *const root::std::string,
            ) -> root::std::string;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave27find_data_file_in_load_pathERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEES7_b"]
            pub fn find_data_file_in_load_path(
                fcn: *const root::std::string,
                file: *const root::std::string,
                require_regular_file: bool,
            ) -> root::std::string;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave21contents_file_in_pathERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
            pub fn contents_file_in_path(arg1: *const root::std::string) -> root::std::string;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave16fcn_file_in_pathERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
            pub fn fcn_file_in_path(arg1: *const root::std::string) -> root::std::string;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave17do_string_escapesERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
            pub fn do_string_escapes(s: *const root::std::string) -> root::std::string;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave18undo_string_escapeEc"]
            pub fn undo_string_escape(c: ::std::os::raw::c_char) -> *const ::std::os::raw::c_char;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave19undo_string_escapesERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
            pub fn undo_string_escapes(s: *const root::std::string) -> root::std::string;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave16check_dimensionsER10dim_vectorPKc"]
            pub fn check_dimensions(
                dim: *mut root::dim_vector,
                warnfor: *const ::std::os::raw::c_char,
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave14get_dimensionsERK12octave_valuePKcR10dim_vector"]
            pub fn get_dimensions(
                a: *const root::octave_value,
                warn_for: *const ::std::os::raw::c_char,
                dim: *mut root::dim_vector,
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave14get_dimensionsERK12octave_valueS2_PKcRlS5_"]
            pub fn get_dimensions1(
                a: *const root::octave_value,
                b: *const root::octave_value,
                warn_for: *const ::std::os::raw::c_char,
                nr: *mut root::octave_idx_type,
                nc: *mut root::octave_idx_type,
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave14get_dimensionsERK12octave_valuePKcRlS5_"]
            pub fn get_dimensions2(
                a: *const root::octave_value,
                warn_for: *const ::std::os::raw::c_char,
                nr: *mut root::octave_idx_type,
                nc: *mut root::octave_idx_type,
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave13dims_to_numelERK10dim_vectorRK17octave_value_list"]
            pub fn dims_to_numel(
                dims: *const root::dim_vector,
                idx: *const root::octave_value_list,
            ) -> root::octave_idx_type;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave15identity_matrixEll"]
            pub fn identity_matrix(
                nr: root::octave_idx_type,
                nc: root::octave_idx_type,
            ) -> root::Matrix;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave21float_identity_matrixEll"]
            pub fn float_identity_matrix(
                nr: root::octave_idx_type,
                nc: root::octave_idx_type,
            ) -> root::FloatMatrix;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave6formatERSoPKcz"]
            pub fn format(
                os: *mut root::std::ostream,
                fmt: *const ::std::os::raw::c_char,
                ...
            ) -> usize;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave7vformatERSoPKcP13__va_list_tag"]
            pub fn vformat(
                os: *mut root::std::ostream,
                fmt: *const ::std::os::raw::c_char,
                args: *mut root::__va_list_tag,
            ) -> usize;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave9vasprintfB5cxx11EPKcP13__va_list_tag"]
            pub fn vasprintf(
                fmt: *const ::std::os::raw::c_char,
                args: *mut root::__va_list_tag,
            ) -> root::std::string;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave8asprintfB5cxx11EPKcz"]
            pub fn asprintf(fmt: *const ::std::os::raw::c_char, ...) -> root::std::string;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave5sleepEdb"]
            pub fn sleep(seconds: f64, do_graphics_events: bool);
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave17do_simple_cellfunEPF17octave_value_listRKS0_iEPKcS2_i"]
            pub fn do_simple_cellfun(
                fun: ::core::option::Option<
                    unsafe extern "C" fn(
                        arg1: *const root::octave_value_list,
                        arg2: ::std::os::raw::c_int,
                    ) -> root::octave_value_list,
                >,
                fun_name: *const ::std::os::raw::c_char,
                args: *const root::octave_value_list,
                nargout: ::std::os::raw::c_int,
            ) -> root::octave_value_list;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN6octave17do_simple_cellfunEPF17octave_value_listRKS0_iEPKcS2_"]
            pub fn do_simple_cellfun1(
                fun: ::core::option::Option<
                    unsafe extern "C" fn(
                        arg1: *const root::octave_value_list,
                        arg2: ::std::os::raw::c_int,
                    ) -> root::octave_value_list,
                >,
                fun_name: *const ::std::os::raw::c_char,
                args: *const root::octave_value_list,
            ) -> root::octave_value;
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct tree_identifier {
            _unused: [u8; 0],
        }
    }
    pub type octave_refcount = u8;
    #[doc = "! Vector representing the dimensions (size) of an Array."]
    #[doc = "!"]
    #[doc = "! A dim_vector is used to represent dimensions of an Array.  It is used"]
    #[doc = "! on its constructor to specify its size, or when reshaping it."]
    #[doc = "!"]
    #[doc = "! @code{.cc}"]
    #[doc = "! // Matrix with 10 rows and 20 columns."]
    #[doc = "! Matrix m Matrix (dim_vector (10, 20));"]
    #[doc = "!"]
    #[doc = "! // Change its size to 5 rows and 40 columns."]
    #[doc = "! Matrix m2 = m.reshape (dim_vector (5, 40));"]
    #[doc = "!"]
    #[doc = "! // Five dimensional Array of length 10, 20, 3, 8, 7 on each dimension."]
    #[doc = "! NDArray a (dim_vector (10, 20, 3, 8, 7));"]
    #[doc = "!"]
    #[doc = "! // Uninitialized array of same size as other."]
    #[doc = "! NDArray b (a.dims ());"]
    #[doc = "! @endcode"]
    #[doc = "!"]
    #[doc = "! The main thing to understand about this class, is that methods such as"]
    #[doc = "! ndims() and numel(), return the value for an Array of these dimensions,"]
    #[doc = "! not the actual number of elements in the dim_vector."]
    #[doc = "!"]
    #[doc = "! @code{.cc}"]
    #[doc = "! dim_vector d (10, 5, 3);"]
    #[doc = "! octave_idx_type n = d.numel (); // returns 150"]
    #[doc = "! octave_idx_type nd = d.ndims (); // returns 3"]
    #[doc = "! @endcode"]
    #[doc = "!"]
    #[doc = "! ## Implementation details ##"]
    #[doc = "!"]
    #[doc = "! This implementation is more tricky than Array, but the big plus is that"]
    #[doc = "! dim_vector requires only one allocation instead of two.  It is (slightly)"]
    #[doc = "! patterned after GCC's basic_string implementation.  rep is a pointer to an"]
    #[doc = "! array of memory, comprising count, length, and the data:"]
    #[doc = "!"]
    #[doc = "! @verbatim"]
    #[doc = "!        <count>"]
    #[doc = "!        <ndims>"]
    #[doc = "! rep --> <dims[0]>"]
    #[doc = "!        <dims[1]>"]
    #[doc = "!        ..."]
    #[doc = "! @endverbatim"]
    #[doc = "!"]
    #[doc = "! The inlines count(), ndims() recover this data from the rep.  Note"]
    #[doc = "! that rep points to the beginning of dims to grant faster access"]
    #[doc = "! (reinterpret_cast is assumed to be an inexpensive operation)."]
    #[repr(C)]
    #[derive(Debug)]
    pub struct dim_vector {
        pub rep: *mut root::octave_idx_type,
    }
    #[test]
    fn bindgen_test_layout_dim_vector() {
        assert_eq!(
            ::core::mem::size_of::<dim_vector>(),
            8usize,
            concat!("Size of: ", stringify!(dim_vector))
        );
        assert_eq!(
            ::core::mem::align_of::<dim_vector>(),
            8usize,
            concat!("Alignment of ", stringify!(dim_vector))
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<dim_vector>())).rep as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(dim_vector),
                "::",
                stringify!(rep)
            )
        );
    }
    extern "C" {
        #[link_name = "\u{1}_ZN10dim_vector19chop_all_singletonsEv"]
        pub fn dim_vector_chop_all_singletons(this: *mut root::dim_vector);
    }
    extern "C" {
        #[link_name = "\u{1}_ZN10dim_vector7dim_maxEv"]
        pub fn dim_vector_dim_max() -> root::octave_idx_type;
    }
    extern "C" {
        #[link_name = "\u{1}_ZNK10dim_vector3strB5cxx11Ec"]
        pub fn dim_vector_str(
            this: *const root::dim_vector,
            sep: ::std::os::raw::c_char,
        ) -> root::std::string;
    }
    extern "C" {
        #[link_name = "\u{1}_ZNK10dim_vector8num_onesEv"]
        pub fn dim_vector_num_ones(this: *const root::dim_vector) -> ::std::os::raw::c_int;
    }
    extern "C" {
        #[doc = "! The following function will throw a std::bad_alloc ()"]
        #[doc = "! exception if the requested size is larger than can be indexed by"]
        #[doc = "! octave_idx_type.  This may be smaller than the actual amount of"]
        #[doc = "! memory that can be safely allocated on a system.  However, if we"]
        #[doc = "! don't fail here, we can end up with a mysterious crash inside a"]
        #[doc = "! function that is iterating over an array using octave_idx_type"]
        #[doc = "! indices."]
        #[link_name = "\u{1}_ZNK10dim_vector10safe_numelEv"]
        pub fn dim_vector_safe_numel(this: *const root::dim_vector) -> root::octave_idx_type;
    }
    extern "C" {
        #[link_name = "\u{1}_ZNK10dim_vector7squeezeEv"]
        pub fn dim_vector_squeeze(this: *const root::dim_vector) -> root::dim_vector;
    }
    extern "C" {
        #[doc = "! This corresponds to cat()."]
        #[link_name = "\u{1}_ZN10dim_vector6concatERKS_i"]
        pub fn dim_vector_concat(
            this: *mut root::dim_vector,
            dvb: *const root::dim_vector,
            dim: ::std::os::raw::c_int,
        ) -> bool;
    }
    extern "C" {
        #[doc = "! This corresponds to [,] (horzcat, dim = 0) and [;] (vertcat, dim = 1)."]
        #[link_name = "\u{1}_ZN10dim_vector5hvcatERKS_i"]
        pub fn dim_vector_hvcat(
            this: *mut root::dim_vector,
            dvb: *const root::dim_vector,
            dim: ::std::os::raw::c_int,
        ) -> bool;
    }
    extern "C" {
        #[doc = "! Force certain dimensionality, preserving numel ().  Missing"]
        #[doc = "! dimensions are set to 1, redundant are folded into the trailing"]
        #[doc = "! one.  If n = 1, the result is 2d and the second dim is 1"]
        #[doc = "! (dim_vectors are always at least 2D)."]
        #[link_name = "\u{1}_ZNK10dim_vector5redimEi"]
        pub fn dim_vector_redim(
            this: *const root::dim_vector,
            n: ::std::os::raw::c_int,
        ) -> root::dim_vector;
    }
    extern "C" {
        #[link_name = "\u{1}_ZNK10dim_vector8as_arrayEv"]
        pub fn dim_vector_as_array(
            this: *const root::dim_vector,
        ) -> root::Array<root::octave_idx_type>;
    }
    impl dim_vector {
        #[inline]
        pub unsafe fn chop_all_singletons(&mut self) {
            dim_vector_chop_all_singletons(self)
        }
        #[inline]
        pub unsafe fn dim_max() -> root::octave_idx_type {
            dim_vector_dim_max()
        }
        #[inline]
        pub unsafe fn str(&self, sep: ::std::os::raw::c_char) -> root::std::string {
            dim_vector_str(self, sep)
        }
        #[inline]
        pub unsafe fn num_ones(&self) -> ::std::os::raw::c_int {
            dim_vector_num_ones(self)
        }
        #[inline]
        pub unsafe fn safe_numel(&self) -> root::octave_idx_type {
            dim_vector_safe_numel(self)
        }
        #[inline]
        pub unsafe fn squeeze(&self) -> root::dim_vector {
            dim_vector_squeeze(self)
        }
        #[inline]
        pub unsafe fn concat(
            &mut self,
            dvb: *const root::dim_vector,
            dim: ::std::os::raw::c_int,
        ) -> bool {
            dim_vector_concat(self, dvb, dim)
        }
        #[inline]
        pub unsafe fn hvcat(
            &mut self,
            dvb: *const root::dim_vector,
            dim: ::std::os::raw::c_int,
        ) -> bool {
            dim_vector_hvcat(self, dvb, dim)
        }
        #[inline]
        pub unsafe fn redim(&self, n: ::std::os::raw::c_int) -> root::dim_vector {
            dim_vector_redim(self, n)
        }
        #[inline]
        pub unsafe fn as_array(&self) -> root::Array<root::octave_idx_type> {
            dim_vector_as_array(self)
        }
    }
    pub type octave_int8 = root::octave_int<i8>;
    pub type octave_int16 = root::octave_int<i16>;
    pub type octave_int32 = root::octave_int<i32>;
    pub type octave_int64 = root::octave_int<i64>;
    pub type octave_uint8 = root::octave_int<u8>;
    pub type octave_uint16 = root::octave_int<u16>;
    pub type octave_uint32 = root::octave_int<u32>;
    pub type octave_uint64 = root::octave_int<u64>;
    #[repr(C)]
    #[derive(Debug)]
    pub struct idx_vector {
        pub rep: *mut root::idx_vector_idx_base_rep,
    }
    pub const idx_vector_idx_class_type_class_invalid: root::idx_vector_idx_class_type = -1;
    pub const idx_vector_idx_class_type_class_colon: root::idx_vector_idx_class_type = 0;
    pub const idx_vector_idx_class_type_class_range: root::idx_vector_idx_class_type = 1;
    pub const idx_vector_idx_class_type_class_scalar: root::idx_vector_idx_class_type = 2;
    pub const idx_vector_idx_class_type_class_vector: root::idx_vector_idx_class_type = 3;
    pub const idx_vector_idx_class_type_class_mask: root::idx_vector_idx_class_type = 4;
    pub type idx_vector_idx_class_type = i32;
    #[repr(C)]
    pub struct idx_vector_idx_base_rep__bindgen_vtable(::std::os::raw::c_void);
    #[repr(C)]
    #[derive(Debug)]
    pub struct idx_vector_idx_base_rep {
        pub vtable_: *const idx_vector_idx_base_rep__bindgen_vtable,
        pub count: root::octave::refcount<::std::os::raw::c_int>,
        pub err: bool,
    }
    #[test]
    fn bindgen_test_layout_idx_vector_idx_base_rep() {
        assert_eq!(
            ::core::mem::size_of::<idx_vector_idx_base_rep>(),
            16usize,
            concat!("Size of: ", stringify!(idx_vector_idx_base_rep))
        );
        assert_eq!(
            ::core::mem::align_of::<idx_vector_idx_base_rep>(),
            8usize,
            concat!("Alignment of ", stringify!(idx_vector_idx_base_rep))
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<idx_vector_idx_base_rep>())).count as *const _ as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(idx_vector_idx_base_rep),
                "::",
                stringify!(count)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<idx_vector_idx_base_rep>())).err as *const _ as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(idx_vector_idx_base_rep),
                "::",
                stringify!(err)
            )
        );
    }
    #[repr(C)]
    #[derive(Debug)]
    pub struct idx_vector_idx_colon_rep {
        pub _base: root::idx_vector_idx_base_rep,
    }
    #[test]
    fn bindgen_test_layout_idx_vector_idx_colon_rep() {
        assert_eq!(
            ::core::mem::size_of::<idx_vector_idx_colon_rep>(),
            16usize,
            concat!("Size of: ", stringify!(idx_vector_idx_colon_rep))
        );
        assert_eq!(
            ::core::mem::align_of::<idx_vector_idx_colon_rep>(),
            8usize,
            concat!("Alignment of ", stringify!(idx_vector_idx_colon_rep))
        );
    }
    extern "C" {
        #[link_name = "\u{1}_ZN10idx_vector13idx_colon_repC1Ec"]
        pub fn idx_vector_idx_colon_rep_idx_colon_rep(
            this: *mut root::idx_vector_idx_colon_rep,
            c: ::std::os::raw::c_char,
        );
    }
    impl idx_vector_idx_colon_rep {
        #[inline]
        pub unsafe fn new(c: ::std::os::raw::c_char) -> Self {
            let mut __bindgen_tmp = ::core::mem::uninitialized();
            idx_vector_idx_colon_rep_idx_colon_rep(&mut __bindgen_tmp, c);
            __bindgen_tmp
        }
    }
    pub const idx_vector_direct_DIRECT: root::idx_vector_direct = 0;
    pub type idx_vector_direct = u32;
    #[repr(C)]
    #[derive(Debug)]
    pub struct idx_vector_idx_range_rep {
        pub _base: root::idx_vector_idx_base_rep,
        pub start: root::octave_idx_type,
        pub len: root::octave_idx_type,
        pub step: root::octave_idx_type,
    }
    #[test]
    fn bindgen_test_layout_idx_vector_idx_range_rep() {
        assert_eq!(
            ::core::mem::size_of::<idx_vector_idx_range_rep>(),
            40usize,
            concat!("Size of: ", stringify!(idx_vector_idx_range_rep))
        );
        assert_eq!(
            ::core::mem::align_of::<idx_vector_idx_range_rep>(),
            8usize,
            concat!("Alignment of ", stringify!(idx_vector_idx_range_rep))
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<idx_vector_idx_range_rep>())).start as *const _ as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(idx_vector_idx_range_rep),
                "::",
                stringify!(start)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<idx_vector_idx_range_rep>())).len as *const _ as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(idx_vector_idx_range_rep),
                "::",
                stringify!(len)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<idx_vector_idx_range_rep>())).step as *const _ as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(idx_vector_idx_range_rep),
                "::",
                stringify!(step)
            )
        );
    }
    extern "C" {
        #[link_name = "\u{1}_ZNK10idx_vector13idx_range_rep9unconvertEv"]
        pub fn idx_vector_idx_range_rep_unconvert(
            this: *const root::idx_vector_idx_range_rep,
        ) -> root::Range;
    }
    extern "C" {
        #[link_name = "\u{1}_ZN10idx_vector13idx_range_repC1Elll"]
        pub fn idx_vector_idx_range_rep_idx_range_rep(
            this: *mut root::idx_vector_idx_range_rep,
            _start: root::octave_idx_type,
            _limit: root::octave_idx_type,
            _step: root::octave_idx_type,
        );
    }
    extern "C" {
        #[link_name = "\u{1}_ZN10idx_vector13idx_range_repC1ERK5Range"]
        pub fn idx_vector_idx_range_rep_idx_range_rep1(
            this: *mut root::idx_vector_idx_range_rep,
            arg1: *const root::Range,
        );
    }
    impl idx_vector_idx_range_rep {
        #[inline]
        pub unsafe fn unconvert(&self) -> root::Range {
            idx_vector_idx_range_rep_unconvert(self)
        }
        #[inline]
        pub unsafe fn new(
            _start: root::octave_idx_type,
            _limit: root::octave_idx_type,
            _step: root::octave_idx_type,
        ) -> Self {
            let mut __bindgen_tmp = ::core::mem::uninitialized();
            idx_vector_idx_range_rep_idx_range_rep(&mut __bindgen_tmp, _start, _limit, _step);
            __bindgen_tmp
        }
        #[inline]
        pub unsafe fn new1(arg1: *const root::Range) -> Self {
            let mut __bindgen_tmp = ::core::mem::uninitialized();
            idx_vector_idx_range_rep_idx_range_rep1(&mut __bindgen_tmp, arg1);
            __bindgen_tmp
        }
    }
    #[repr(C)]
    #[derive(Debug)]
    pub struct idx_vector_idx_scalar_rep {
        pub _base: root::idx_vector_idx_base_rep,
        pub data: root::octave_idx_type,
    }
    #[test]
    fn bindgen_test_layout_idx_vector_idx_scalar_rep() {
        assert_eq!(
            ::core::mem::size_of::<idx_vector_idx_scalar_rep>(),
            24usize,
            concat!("Size of: ", stringify!(idx_vector_idx_scalar_rep))
        );
        assert_eq!(
            ::core::mem::align_of::<idx_vector_idx_scalar_rep>(),
            8usize,
            concat!("Alignment of ", stringify!(idx_vector_idx_scalar_rep))
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<idx_vector_idx_scalar_rep>())).data as *const _ as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(idx_vector_idx_scalar_rep),
                "::",
                stringify!(data)
            )
        );
    }
    extern "C" {
        #[link_name = "\u{1}_ZNK10idx_vector14idx_scalar_rep9unconvertEv"]
        pub fn idx_vector_idx_scalar_rep_unconvert(
            this: *const root::idx_vector_idx_scalar_rep,
        ) -> f64;
    }
    extern "C" {
        #[link_name = "\u{1}_ZN10idx_vector14idx_scalar_repC1El"]
        pub fn idx_vector_idx_scalar_rep_idx_scalar_rep(
            this: *mut root::idx_vector_idx_scalar_rep,
            i: root::octave_idx_type,
        );
    }
    impl idx_vector_idx_scalar_rep {
        #[inline]
        pub unsafe fn unconvert(&self) -> f64 {
            idx_vector_idx_scalar_rep_unconvert(self)
        }
        #[inline]
        pub unsafe fn new(i: root::octave_idx_type) -> Self {
            let mut __bindgen_tmp = ::core::mem::uninitialized();
            idx_vector_idx_scalar_rep_idx_scalar_rep(&mut __bindgen_tmp, i);
            __bindgen_tmp
        }
    }
    #[repr(C)]
    #[derive(Debug)]
    pub struct idx_vector_idx_vector_rep {
        pub _base: root::idx_vector_idx_base_rep,
        pub data: *const root::octave_idx_type,
        pub len: root::octave_idx_type,
        pub ext: root::octave_idx_type,
        pub aowner: *mut root::Array<root::octave_idx_type>,
        pub orig_dims: root::dim_vector,
    }
    #[test]
    fn bindgen_test_layout_idx_vector_idx_vector_rep() {
        assert_eq!(
            ::core::mem::size_of::<idx_vector_idx_vector_rep>(),
            56usize,
            concat!("Size of: ", stringify!(idx_vector_idx_vector_rep))
        );
        assert_eq!(
            ::core::mem::align_of::<idx_vector_idx_vector_rep>(),
            8usize,
            concat!("Alignment of ", stringify!(idx_vector_idx_vector_rep))
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<idx_vector_idx_vector_rep>())).data as *const _ as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(idx_vector_idx_vector_rep),
                "::",
                stringify!(data)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<idx_vector_idx_vector_rep>())).len as *const _ as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(idx_vector_idx_vector_rep),
                "::",
                stringify!(len)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<idx_vector_idx_vector_rep>())).ext as *const _ as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(idx_vector_idx_vector_rep),
                "::",
                stringify!(ext)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<idx_vector_idx_vector_rep>())).aowner as *const _ as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(idx_vector_idx_vector_rep),
                "::",
                stringify!(aowner)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<idx_vector_idx_vector_rep>())).orig_dims as *const _
                    as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(idx_vector_idx_vector_rep),
                "::",
                stringify!(orig_dims)
            )
        );
    }
    extern "C" {
        #[link_name = "\u{1}_ZNK10idx_vector14idx_vector_rep9unconvertEv"]
        pub fn idx_vector_idx_vector_rep_unconvert(
            this: *const root::idx_vector_idx_vector_rep,
        ) -> root::Array<f64>;
    }
    extern "C" {
        #[link_name = "\u{1}_ZN10idx_vector14idx_vector_repC1ERK5ArrayIlE"]
        pub fn idx_vector_idx_vector_rep_idx_vector_rep(
            this: *mut root::idx_vector_idx_vector_rep,
            inda: *const root::Array<root::octave_idx_type>,
        );
    }
    extern "C" {
        #[link_name = "\u{1}_ZN10idx_vector14idx_vector_repC1ERK5ArrayIlElNS_6directE"]
        pub fn idx_vector_idx_vector_rep_idx_vector_rep1(
            this: *mut root::idx_vector_idx_vector_rep,
            inda: *const root::Array<root::octave_idx_type>,
            _ext: root::octave_idx_type,
            arg1: root::idx_vector_direct,
        );
    }
    extern "C" {
        #[link_name = "\u{1}_ZN10idx_vector14idx_vector_repC1Eb"]
        pub fn idx_vector_idx_vector_rep_idx_vector_rep2(
            this: *mut root::idx_vector_idx_vector_rep,
            arg1: bool,
        );
    }
    extern "C" {
        #[link_name = "\u{1}_ZN10idx_vector14idx_vector_repC1ERK5ArrayIbEl"]
        pub fn idx_vector_idx_vector_rep_idx_vector_rep3(
            this: *mut root::idx_vector_idx_vector_rep,
            arg1: *const root::Array<bool>,
            arg2: root::octave_idx_type,
        );
    }
    extern "C" {
        #[link_name = "\u{1}_ZN10idx_vector14idx_vector_repC1ERK6SparseIbE"]
        pub fn idx_vector_idx_vector_rep_idx_vector_rep4(
            this: *mut root::idx_vector_idx_vector_rep,
            arg1: *const root::Sparse<bool>,
        );
    }
    impl idx_vector_idx_vector_rep {
        #[inline]
        pub unsafe fn unconvert(&self) -> root::Array<f64> {
            idx_vector_idx_vector_rep_unconvert(self)
        }
        #[inline]
        pub unsafe fn new(inda: *const root::Array<root::octave_idx_type>) -> Self {
            let mut __bindgen_tmp = ::core::mem::uninitialized();
            idx_vector_idx_vector_rep_idx_vector_rep(&mut __bindgen_tmp, inda);
            __bindgen_tmp
        }
        #[inline]
        pub unsafe fn new1(
            inda: *const root::Array<root::octave_idx_type>,
            _ext: root::octave_idx_type,
            arg1: root::idx_vector_direct,
        ) -> Self {
            let mut __bindgen_tmp = ::core::mem::uninitialized();
            idx_vector_idx_vector_rep_idx_vector_rep1(&mut __bindgen_tmp, inda, _ext, arg1);
            __bindgen_tmp
        }
        #[inline]
        pub unsafe fn new2(arg1: bool) -> Self {
            let mut __bindgen_tmp = ::core::mem::uninitialized();
            idx_vector_idx_vector_rep_idx_vector_rep2(&mut __bindgen_tmp, arg1);
            __bindgen_tmp
        }
        #[inline]
        pub unsafe fn new3(arg1: *const root::Array<bool>, arg2: root::octave_idx_type) -> Self {
            let mut __bindgen_tmp = ::core::mem::uninitialized();
            idx_vector_idx_vector_rep_idx_vector_rep3(&mut __bindgen_tmp, arg1, arg2);
            __bindgen_tmp
        }
        #[inline]
        pub unsafe fn new4(arg1: *const root::Sparse<bool>) -> Self {
            let mut __bindgen_tmp = ::core::mem::uninitialized();
            idx_vector_idx_vector_rep_idx_vector_rep4(&mut __bindgen_tmp, arg1);
            __bindgen_tmp
        }
    }
    #[repr(C)]
    #[derive(Debug)]
    pub struct idx_vector_idx_mask_rep {
        pub _base: root::idx_vector_idx_base_rep,
        pub data: *const bool,
        pub len: root::octave_idx_type,
        pub ext: root::octave_idx_type,
        pub lsti: root::octave_idx_type,
        pub lste: root::octave_idx_type,
        pub aowner: *mut root::Array<bool>,
        pub orig_dims: root::dim_vector,
    }
    #[test]
    fn bindgen_test_layout_idx_vector_idx_mask_rep() {
        assert_eq!(
            ::core::mem::size_of::<idx_vector_idx_mask_rep>(),
            72usize,
            concat!("Size of: ", stringify!(idx_vector_idx_mask_rep))
        );
        assert_eq!(
            ::core::mem::align_of::<idx_vector_idx_mask_rep>(),
            8usize,
            concat!("Alignment of ", stringify!(idx_vector_idx_mask_rep))
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<idx_vector_idx_mask_rep>())).data as *const _ as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(idx_vector_idx_mask_rep),
                "::",
                stringify!(data)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<idx_vector_idx_mask_rep>())).len as *const _ as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(idx_vector_idx_mask_rep),
                "::",
                stringify!(len)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<idx_vector_idx_mask_rep>())).ext as *const _ as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(idx_vector_idx_mask_rep),
                "::",
                stringify!(ext)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<idx_vector_idx_mask_rep>())).lsti as *const _ as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(idx_vector_idx_mask_rep),
                "::",
                stringify!(lsti)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<idx_vector_idx_mask_rep>())).lste as *const _ as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(idx_vector_idx_mask_rep),
                "::",
                stringify!(lste)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<idx_vector_idx_mask_rep>())).aowner as *const _ as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(idx_vector_idx_mask_rep),
                "::",
                stringify!(aowner)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::core::ptr::null::<idx_vector_idx_mask_rep>())).orig_dims as *const _ as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(idx_vector_idx_mask_rep),
                "::",
                stringify!(orig_dims)
            )
        );
    }
    extern "C" {
        #[link_name = "\u{1}_ZNK10idx_vector12idx_mask_rep9unconvertEv"]
        pub fn idx_vector_idx_mask_rep_unconvert(
            this: *const root::idx_vector_idx_mask_rep,
        ) -> root::Array<bool>;
    }
    extern "C" {
        #[link_name = "\u{1}_ZN10idx_vector12idx_mask_repC1Eb"]
        pub fn idx_vector_idx_mask_rep_idx_mask_rep(
            this: *mut root::idx_vector_idx_mask_rep,
            arg1: bool,
        );
    }
    extern "C" {
        #[link_name = "\u{1}_ZN10idx_vector12idx_mask_repC1ERK5ArrayIbEl"]
        pub fn idx_vector_idx_mask_rep_idx_mask_rep1(
            this: *mut root::idx_vector_idx_mask_rep,
            arg1: *const root::Array<bool>,
            arg2: root::octave_idx_type,
        );
    }
    impl idx_vector_idx_mask_rep {
        #[inline]
        pub unsafe fn unconvert(&self) -> root::Array<bool> {
            idx_vector_idx_mask_rep_unconvert(self)
        }
        #[inline]
        pub unsafe fn new(arg1: bool) -> Self {
            let mut __bindgen_tmp = ::core::mem::uninitialized();
            idx_vector_idx_mask_rep_idx_mask_rep(&mut __bindgen_tmp, arg1);
            __bindgen_tmp
        }
        #[inline]
        pub unsafe fn new1(arg1: *const root::Array<bool>, arg2: root::octave_idx_type) -> Self {
            let mut __bindgen_tmp = ::core::mem::uninitialized();
            idx_vector_idx_mask_rep_idx_mask_rep1(&mut __bindgen_tmp, arg1, arg2);
            __bindgen_tmp
        }
    }
    extern "C" {
        #[link_name = "\u{1}_ZN10idx_vector5colonE"]
        pub static idx_vector_colon: root::idx_vector;
    }
    #[test]
    fn bindgen_test_layout_idx_vector() {
        assert_eq!(
            ::core::mem::size_of::<idx_vector>(),
            8usize,
            concat!("Size of: ", stringify!(idx_vector))
        );
        assert_eq!(
            ::core::mem::align_of::<idx_vector>(),
            8usize,
            concat!("Alignment of ", stringify!(idx_vector))
        );
        assert_eq!(
            unsafe { &(*(::core::ptr::null::<idx_vector>())).rep as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(idx_vector),
                "::",
                stringify!(rep)
            )
        );
    }
    extern "C" {
        #[link_name = "\u{1}_ZN10idx_vector12maybe_reduceElRKS_l"]
        pub fn idx_vector_maybe_reduce(
            this: *mut root::idx_vector,
            n: root::octave_idx_type,
            j: *const root::idx_vector,
            nj: root::octave_idx_type,
        ) -> bool;
    }
    extern "C" {
        #[link_name = "\u{1}_ZNK10idx_vector13is_cont_rangeElRlS0_"]
        pub fn idx_vector_is_cont_range(
            this: *const root::idx_vector,
            n: root::octave_idx_type,
            l: *mut root::octave_idx_type,
            u: *mut root::octave_idx_type,
        ) -> bool;
    }
    extern "C" {
        #[link_name = "\u{1}_ZNK10idx_vector9incrementEv"]
        pub fn idx_vector_increment(this: *const root::idx_vector) -> root::octave_idx_type;
    }
    extern "C" {
        #[link_name = "\u{1}_ZNK10idx_vector10complementEl"]
        pub fn idx_vector_complement(
            this: *const root::idx_vector,
            n: root::octave_idx_type,
        ) -> root::idx_vector;
    }
    extern "C" {
        #[link_name = "\u{1}_ZNK10idx_vector14is_permutationEl"]
        pub fn idx_vector_is_permutation(
            this: *const root::idx_vector,
            n: root::octave_idx_type,
        ) -> bool;
    }
    extern "C" {
        #[link_name = "\u{1}_ZNK10idx_vector19inverse_permutationEl"]
        pub fn idx_vector_inverse_permutation(
            this: *const root::idx_vector,
            n: root::octave_idx_type,
        ) -> root::idx_vector;
    }
    extern "C" {
        #[link_name = "\u{1}_ZNK10idx_vector9copy_dataEPl"]
        pub fn idx_vector_copy_data(
            this: *const root::idx_vector,
            data: *mut root::octave_idx_type,
        );
    }
    extern "C" {
        #[link_name = "\u{1}_ZNK10idx_vector6unmaskEv"]
        pub fn idx_vector_unmask(this: *const root::idx_vector) -> root::idx_vector;
    }
    extern "C" {
        #[link_name = "\u{1}_ZNK10idx_vector9unconvertERNS_14idx_class_typeERdR5RangeR5ArrayIdERS5_IbE"]
        pub fn idx_vector_unconvert(
            this: *const root::idx_vector,
            iclass: *mut root::idx_vector_idx_class_type,
            scalar: *mut f64,
            range: *mut root::Range,
            array: *mut root::Array<f64>,
            mask: *mut root::Array<bool>,
        );
    }
    extern "C" {
        #[link_name = "\u{1}_ZNK10idx_vector8as_arrayEv"]
        pub fn idx_vector_as_array(
            this: *const root::idx_vector,
        ) -> root::Array<root::octave_idx_type>;
    }
    extern "C" {
        #[link_name = "\u{1}_ZN10idx_vector3rawEv"]
        pub fn idx_vector_raw(this: *mut root::idx_vector) -> *const root::octave_idx_type;
    }
    extern "C" {
        #[link_name = "\u{1}_ZNK10idx_vector8isvectorEv"]
        pub fn idx_vector_isvector(this: *const root::idx_vector) -> bool;
    }
    extern "C" {
        #[link_name = "\u{1}_ZN10idx_vector6freezeElPKcb"]
        pub fn idx_vector_freeze(
            this: *mut root::idx_vector,
            z_len: root::octave_idx_type,
            tag: *const ::std::os::raw::c_char,
            resize_ok: bool,
        ) -> root::octave_idx_type;
    }
    extern "C" {
        #[link_name = "\u{1}_ZNK10idx_vector10ones_countEv"]
        pub fn idx_vector_ones_count(this: *const root::idx_vector) -> root::octave_idx_type;
    }
    extern "C" {
        #[link_name = "\u{1}_ZN10idx_vectorC1ERK5ArrayIbE"]
        pub fn idx_vector_idx_vector(this: *mut root::idx_vector, nda: *const root::Array<bool>);
    }
    impl idx_vector {
        #[inline]
        pub unsafe fn maybe_reduce(
            &mut self,
            n: root::octave_idx_type,
            j: *const root::idx_vector,
            nj: root::octave_idx_type,
        ) -> bool {
            idx_vector_maybe_reduce(self, n, j, nj)
        }
        #[inline]
        pub unsafe fn is_cont_range(
            &self,
            n: root::octave_idx_type,
            l: *mut root::octave_idx_type,
            u: *mut root::octave_idx_type,
        ) -> bool {
            idx_vector_is_cont_range(self, n, l, u)
        }
        #[inline]
        pub unsafe fn increment(&self) -> root::octave_idx_type {
            idx_vector_increment(self)
        }
        #[inline]
        pub unsafe fn complement(&self, n: root::octave_idx_type) -> root::idx_vector {
            idx_vector_complement(self, n)
        }
        #[inline]
        pub unsafe fn is_permutation(&self, n: root::octave_idx_type) -> bool {
            idx_vector_is_permutation(self, n)
        }
        #[inline]
        pub unsafe fn inverse_permutation(&self, n: root::octave_idx_type) -> root::idx_vector {
            idx_vector_inverse_permutation(self, n)
        }
        #[inline]
        pub unsafe fn copy_data(&self, data: *mut root::octave_idx_type) {
            idx_vector_copy_data(self, data)
        }
        #[inline]
        pub unsafe fn unmask(&self) -> root::idx_vector {
            idx_vector_unmask(self)
        }
        #[inline]
        pub unsafe fn unconvert(
            &self,
            iclass: *mut root::idx_vector_idx_class_type,
            scalar: *mut f64,
            range: *mut root::Range,
            array: *mut root::Array<f64>,
            mask: *mut root::Array<bool>,
        ) {
            idx_vector_unconvert(self, iclass, scalar, range, array, mask)
        }
        #[inline]
        pub unsafe fn as_array(&self) -> root::Array<root::octave_idx_type> {
            idx_vector_as_array(self)
        }
        #[inline]
        pub unsafe fn raw(&mut self) -> *const root::octave_idx_type {
            idx_vector_raw(self)
        }
        #[inline]
        pub unsafe fn isvector(&self) -> bool {
            idx_vector_isvector(self)
        }
        #[inline]
        pub unsafe fn freeze(
            &mut self,
            z_len: root::octave_idx_type,
            tag: *const ::std::os::raw::c_char,
            resize_ok: bool,
        ) -> root::octave_idx_type {
            idx_vector_freeze(self, z_len, tag, resize_ok)
        }
        #[inline]
        pub unsafe fn ones_count(&self) -> root::octave_idx_type {
            idx_vector_ones_count(self)
        }
        #[inline]
        pub unsafe fn new(nda: *const root::Array<bool>) -> Self {
            let mut __bindgen_tmp = ::core::mem::uninitialized();
            idx_vector_idx_vector(&mut __bindgen_tmp, nda);
            __bindgen_tmp
        }
    }
    extern "C" {
        #[link_name = "\u{1}_ZN10idx_vector12idx_base_rep8as_arrayEv"]
        pub fn idx_vector_idx_base_rep_as_array(
            this: *mut ::std::os::raw::c_void,
        ) -> root::Array<root::octave_idx_type>;
    }
    extern "C" {
        #[link_name = "\u{1}_ZNK10idx_vector13idx_colon_rep9checkelemEl"]
        pub fn idx_vector_idx_colon_rep_checkelem(
            this: *mut ::std::os::raw::c_void,
            i: root::octave_idx_type,
        ) -> root::octave_idx_type;
    }
    extern "C" {
        #[link_name = "\u{1}_ZN10idx_vector13idx_colon_rep8sort_idxER5ArrayIlE"]
        pub fn idx_vector_idx_colon_rep_sort_idx(
            this: *mut ::std::os::raw::c_void,
            arg1: *mut root::Array<root::octave_idx_type>,
        ) -> *mut root::idx_vector_idx_base_rep;
    }
    extern "C" {
        #[link_name = "\u{1}_ZNK10idx_vector13idx_colon_rep5printERSo"]
        pub fn idx_vector_idx_colon_rep_print(
            this: *mut ::std::os::raw::c_void,
            os: *mut root::std::ostream,
        ) -> *mut root::std::ostream;
    }
    extern "C" {
        #[link_name = "\u{1}_ZNK10idx_vector13idx_range_rep9checkelemEl"]
        pub fn idx_vector_idx_range_rep_checkelem(
            this: *mut ::std::os::raw::c_void,
            i: root::octave_idx_type,
        ) -> root::octave_idx_type;
    }
    extern "C" {
        #[link_name = "\u{1}_ZN10idx_vector13idx_range_rep15sort_uniq_cloneEb"]
        pub fn idx_vector_idx_range_rep_sort_uniq_clone(
            this: *mut ::std::os::raw::c_void,
            uniq: bool,
        ) -> *mut root::idx_vector_idx_base_rep;
    }
    extern "C" {
        #[link_name = "\u{1}_ZN10idx_vector13idx_range_rep8sort_idxER5ArrayIlE"]
        pub fn idx_vector_idx_range_rep_sort_idx(
            this: *mut ::std::os::raw::c_void,
            arg1: *mut root::Array<root::octave_idx_type>,
        ) -> *mut root::idx_vector_idx_base_rep;
    }
    extern "C" {
        #[link_name = "\u{1}_ZNK10idx_vector13idx_range_rep5printERSo"]
        pub fn idx_vector_idx_range_rep_print(
            this: *mut ::std::os::raw::c_void,
            os: *mut root::std::ostream,
        ) -> *mut root::std::ostream;
    }
    extern "C" {
        #[link_name = "\u{1}_ZN10idx_vector13idx_range_rep8as_arrayEv"]
        pub fn idx_vector_idx_range_rep_as_array(
            this: *mut ::std::os::raw::c_void,
        ) -> root::Array<root::octave_idx_type>;
    }
    extern "C" {
        #[link_name = "\u{1}_ZNK10idx_vector14idx_scalar_rep9checkelemEl"]
        pub fn idx_vector_idx_scalar_rep_checkelem(
            this: *mut ::std::os::raw::c_void,
            i: root::octave_idx_type,
        ) -> root::octave_idx_type;
    }
    extern "C" {
        #[link_name = "\u{1}_ZN10idx_vector14idx_scalar_rep8sort_idxER5ArrayIlE"]
        pub fn idx_vector_idx_scalar_rep_sort_idx(
            this: *mut ::std::os::raw::c_void,
            arg1: *mut root::Array<root::octave_idx_type>,
        ) -> *mut root::idx_vector_idx_base_rep;
    }
    extern "C" {
        #[link_name = "\u{1}_ZNK10idx_vector14idx_scalar_rep5printERSo"]
        pub fn idx_vector_idx_scalar_rep_print(
            this: *mut ::std::os::raw::c_void,
            os: *mut root::std::ostream,
        ) -> *mut root::std::ostream;
    }
    extern "C" {
        #[link_name = "\u{1}_ZN10idx_vector14idx_scalar_rep8as_arrayEv"]
        pub fn idx_vector_idx_scalar_rep_as_array(
            this: *mut ::std::os::raw::c_void,
        ) -> root::Array<root::octave_idx_type>;
    }
    extern "C" {
        #[link_name = "\u{1}_ZN10idx_vector14idx_vector_repD1Ev"]
        pub fn idx_vector_idx_vector_rep_idx_vector_rep_destructor(
            this: *mut root::idx_vector_idx_vector_rep,
        );
    }
    extern "C" {
        #[link_name = "\u{1}_ZNK10idx_vector14idx_vector_rep9checkelemEl"]
        pub fn idx_vector_idx_vector_rep_checkelem(
            this: *mut ::std::os::raw::c_void,
            i: root::octave_idx_type,
        ) -> root::octave_idx_type;
    }
    extern "C" {
        #[link_name = "\u{1}_ZN10idx_vector14idx_vector_rep15sort_uniq_cloneEb"]
        pub fn idx_vector_idx_vector_rep_sort_uniq_clone(
            this: *mut ::std::os::raw::c_void,
            uniq: bool,
        ) -> *mut root::idx_vector_idx_base_rep;
    }
    extern "C" {
        #[link_name = "\u{1}_ZN10idx_vector14idx_vector_rep8sort_idxER5ArrayIlE"]
        pub fn idx_vector_idx_vector_rep_sort_idx(
            this: *mut ::std::os::raw::c_void,
            arg1: *mut root::Array<root::octave_idx_type>,
        ) -> *mut root::idx_vector_idx_base_rep;
    }
    extern "C" {
        #[link_name = "\u{1}_ZNK10idx_vector14idx_vector_rep5printERSo"]
        pub fn idx_vector_idx_vector_rep_print(
            this: *mut ::std::os::raw::c_void,
            os: *mut root::std::ostream,
        ) -> *mut root::std::ostream;
    }
    extern "C" {
        #[link_name = "\u{1}_ZN10idx_vector14idx_vector_rep8as_arrayEv"]
        pub fn idx_vector_idx_vector_rep_as_array(
            this: *mut ::std::os::raw::c_void,
        ) -> root::Array<root::octave_idx_type>;
    }
    extern "C" {
        #[link_name = "\u{1}_ZN10idx_vector12idx_mask_repD1Ev"]
        pub fn idx_vector_idx_mask_rep_idx_mask_rep_destructor(
            this: *mut root::idx_vector_idx_mask_rep,
        );
    }
    extern "C" {
        #[link_name = "\u{1}_ZNK10idx_vector12idx_mask_rep5xelemEl"]
        pub fn idx_vector_idx_mask_rep_xelem(
            this: *mut ::std::os::raw::c_void,
            i: root::octave_idx_type,
        ) -> root::octave_idx_type;
    }
    extern "C" {
        #[link_name = "\u{1}_ZNK10idx_vector12idx_mask_rep9checkelemEl"]
        pub fn idx_vector_idx_mask_rep_checkelem(
            this: *mut ::std::os::raw::c_void,
            i: root::octave_idx_type,
        ) -> root::octave_idx_type;
    }
    extern "C" {
        #[link_name = "\u{1}_ZN10idx_vector12idx_mask_rep8sort_idxER5ArrayIlE"]
        pub fn idx_vector_idx_mask_rep_sort_idx(
            this: *mut ::std::os::raw::c_void,
            arg1: *mut root::Array<root::octave_idx_type>,
        ) -> *mut root::idx_vector_idx_base_rep;
    }
    extern "C" {
        #[link_name = "\u{1}_ZNK10idx_vector12idx_mask_rep5printERSo"]
        pub fn idx_vector_idx_mask_rep_print(
            this: *mut ::std::os::raw::c_void,
            os: *mut root::std::ostream,
        ) -> *mut root::std::ostream;
    }
    extern "C" {
        #[link_name = "\u{1}_ZN10idx_vector12idx_mask_rep8as_arrayEv"]
        pub fn idx_vector_idx_mask_rep_as_array(
            this: *mut ::std::os::raw::c_void,
        ) -> root::Array<root::octave_idx_type>;
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct ref_param {
        pub _address: u8,
    }
    pub type ref_param_type = u8;
    extern "C" {
        pub fn octave_qsort(
            base: *mut ::std::os::raw::c_void,
            n: usize,
            size: usize,
            cmp: ::core::option::Option<
                unsafe extern "C" fn(
                    arg1: *const ::std::os::raw::c_void,
                    arg2: *const ::std::os::raw::c_void,
                ) -> ::std::os::raw::c_int,
            >,
        );
    }
    extern "C" {
        pub fn octave_strcasecmp(
            s1: *const ::std::os::raw::c_char,
            s2: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn octave_strncasecmp(
            s1: *const ::std::os::raw::c_char,
            s2: *const ::std::os::raw::c_char,
            n: usize,
        ) -> ::std::os::raw::c_int;
    }
    pub type Complex = [u64; 2usize];
    pub type FloatComplex = [u32; 2usize];
    pub const octave_exception_octave_no_exception: root::octave_exception = 0;
    pub const octave_exception_octave_exec_exception: root::octave_exception = 1;
    pub const octave_exception_octave_alloc_exception: root::octave_exception = 3;
    pub const octave_exception_octave_quit_exception: root::octave_exception = 4;
    pub type octave_exception = u32;
    extern "C" {
        pub fn octave_handle_signal();
    }
    extern "C" {
        pub fn octave_throw_interrupt_exception();
    }
    extern "C" {
        pub fn octave_throw_execution_exception();
    }
    extern "C" {
        pub fn octave_throw_bad_alloc();
    }
    extern "C" {
        pub fn octave_throw_exit_exception(
            exit_status: ::std::os::raw::c_int,
            safe_to_return: ::std::os::raw::c_int,
        );
    }
    extern "C" {
        pub fn octave_rethrow_exception();
    }
    extern "C" {
        #[link_name = "\u{1}_Z12octave_fgetsB5cxx11P8_IO_FILE"]
        pub fn octave_fgets(arg1: *mut root::FILE) -> root::std::string;
    }
    extern "C" {
        #[link_name = "\u{1}_Z12octave_fgetlB5cxx11P8_IO_FILE"]
        pub fn octave_fgetl(arg1: *mut root::FILE) -> root::std::string;
    }
    extern "C" {
        #[link_name = "\u{1}_Z12octave_fgetsB5cxx11P8_IO_FILERb"]
        pub fn octave_fgets1(arg1: *mut root::FILE, eof: *mut bool) -> root::std::string;
    }
    extern "C" {
        #[link_name = "\u{1}_Z12octave_fgetlB5cxx11P8_IO_FILERb"]
        pub fn octave_fgetl1(arg1: *mut root::FILE, eof: *mut bool) -> root::std::string;
    }
    extern "C" {
        #[link_name = "\u{1}_Z17octave_read_valueIdET_RSi"]
        pub fn octave_read_value(is: *mut root::std::istream) -> f64;
    }
    extern "C" {
        #[link_name = "\u{1}_Z17octave_read_valueISt7complexIdEET_RSi"]
        pub fn octave_read_value1(is: *mut root::std::istream) -> root::Complex;
    }
    extern "C" {
        #[link_name = "\u{1}_Z17octave_read_valueIfET_RSi"]
        pub fn octave_read_value2(is: *mut root::std::istream) -> f32;
    }
    extern "C" {
        #[link_name = "\u{1}_Z17octave_read_valueISt7complexIfEET_RSi"]
        pub fn octave_read_value3(is: *mut root::std::istream) -> root::FloatComplex;
    }
    extern "C" {
        #[link_name = "\u{1}_Z19octave_write_doubleRSod"]
        pub fn octave_write_double(os: *mut root::std::ostream, dval: f64);
    }
    extern "C" {
        #[link_name = "\u{1}_Z20octave_write_complexRSoRKSt7complexIdE"]
        pub fn octave_write_complex(os: *mut root::std::ostream, cval: *const root::Complex);
    }
    extern "C" {
        #[link_name = "\u{1}_Z18octave_write_floatRSof"]
        pub fn octave_write_float(os: *mut root::std::ostream, dval: f32);
    }
    extern "C" {
        #[link_name = "\u{1}_Z26octave_write_float_complexRSoRKSt7complexIfE"]
        pub fn octave_write_float_complex(
            os: *mut root::std::ostream,
            cval: *const root::FloatComplex,
        );
    }
    pub const sortmode_UNSORTED: root::sortmode = 0;
    pub const sortmode_ASCENDING: root::sortmode = 1;
    pub const sortmode_DESCENDING: root::sortmode = 2;
    pub type sortmode = u32;
    #[repr(C)]
    #[derive(Debug)]
    pub struct octave_sort<T> {
        pub compare: root::octave_sort_compare_fcn_type,
        pub ms: *mut root::octave_sort_MergeState<T>,
        pub _phantom_0: ::core::marker::PhantomData<::core::cell::UnsafeCell<T>>,
    }
    pub type octave_sort_compare_fcn_type = ::core::option::Option<
        unsafe extern "C" fn(arg1: root::ref_param, arg2: root::ref_param) -> bool,
    >;
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct octave_sort_s_slice {
        pub base: root::octave_idx_type,
        pub len: root::octave_idx_type,
    }
    #[repr(C)]
    #[derive(Debug)]
    pub struct octave_sort_MergeState<T> {
        pub min_gallop: root::octave_idx_type,
        pub a: *mut T,
        pub ia: *mut root::octave_idx_type,
        pub alloced: root::octave_idx_type,
        pub n: root::octave_idx_type,
        pub pending: *mut root::octave_sort_s_slice,
        pub _phantom_0: ::core::marker::PhantomData<::core::cell::UnsafeCell<T>>,
    }
    #[repr(C)]
    pub struct Array__bindgen_vtable(::std::os::raw::c_void);
    #[doc = "! N Dimensional Array with copy-on-write semantics."]
    #[doc = "!"]
    #[doc = "! The Array class is at the root of Octave.  It provides a container"]
    #[doc = "! with an arbitrary number of dimensions.  The operator () provides"]
    #[doc = "! access to individual elements via subscript and linear indexing."]
    #[doc = "! Indexing starts at 0.  Arrays are column-major order as in Fortran."]
    #[doc = "!"]
    #[doc = "! @code{.cc}"]
    #[doc = "! // 3 D Array with 10 rows, 20 columns, and 5 pages, filled with 7.0"]
    #[doc = "! Array<double> A Array<double (dim_vector (10, 20, 5), 7.0);"]
    #[doc = "!"]
    #[doc = "! // set value for row 0, column 10, and page 3"]
    #[doc = "! A(0, 10, 3) = 2.5;"]
    #[doc = "!"]
    #[doc = "! // get value for row 1, column 2, and page 0"]
    #[doc = "! double v = A(1, 2, 0);"]
    #[doc = "!"]
    #[doc = "! // get value for 25th element (row 4, column 3, page 1)"]
    #[doc = "! double v = A(24);"]
    #[doc = "! @endcode"]
    #[doc = "!"]
    #[doc = "! ## Notes on STL compatibility"]
    #[doc = "!"]
    #[doc = "! ### size() and length()"]
    #[doc = "!"]
    #[doc = "! To access the total number of elements in an Array, use numel()"]
    #[doc = "! which is short for number of elements and is equivalent to the"]
    #[doc = "! Octave function with same name."]
    #[doc = "!"]
    #[doc = "! @code{.cc}"]
    #[doc = "! Array<int> A (dim_vector (10, 20, 4), 1);"]
    #[doc = "!"]
    #[doc = "! octave_idx_type n = A.numel (); // returns 800 (10x20x4)"]
    #[doc = "!"]
    #[doc = "! octave_idx_type nr = A.size (0); // returns 10 (number of rows/dimension 0)"]
    #[doc = "! octave_idx_type nc = A.size (1); // returns 20 (number of columns)"]
    #[doc = "! octave_idx_type nc = A.size (2); // returns 4 (size of dimension 3)"]
    #[doc = "! octave_idx_type l6 = A.size (6); // returns 1 (implicit singleton dimension)"]
    #[doc = "!"]
    #[doc = "! // Alternatively, get a dim_vector which represents the dimensions."]
    #[doc = "! dim_vector dims = A.dims ();"]
    #[doc = "! @endcode"]
    #[doc = "!"]
    #[doc = "! The methods size() and length() as they exist in the STL cause"]
    #[doc = "! confusion in the context of a N dimensional array."]
    #[doc = "!"]
    #[doc = "! The size() of an array is the length of all dimensions.  In Octave,"]
    #[doc = "! the size() function returns a row vector with the length of each"]
    #[doc = "! dimension, or the size of a specific dimension.  Only the latter is"]
    #[doc = "! present in liboctave."]
    #[doc = "!"]
    #[doc = "! Since there is more than 1 dimension, length() would not make sense"]
    #[doc = "! without expliciting which dimension.  If the function existed, which"]
    #[doc = "! length should it return?  Octave length() function returns the length"]
    #[doc = "! of the longest dimension which is an odd definition, only useful for"]
    #[doc = "! vectors and square matrices.  The alternatives numel(), rows(),"]
    #[doc = "! columns(), and size(d) are more explict and recommended."]
    #[doc = "!"]
    #[doc = "! ### size_type"]
    #[doc = "!"]
    #[doc = "! Array::size_type is `octave_idx_type` which is a typedef for `int`"]
    #[doc = "! or `long int`, depending whether Octave was configured for 64-bit"]
    #[doc = "! indexing."]
    #[doc = "!"]
    #[doc = "! This is a signed integer which may cause problems when mixed with"]
    #[doc = "! STL containers.  The reason is that Octave interacts with Fortran"]
    #[doc = "! routines, providing an interface many Fortran numeric libraries."]
    #[doc = "!"]
    #[doc = "! ## Subclasses"]
    #[doc = "!"]
    #[doc = "! The following subclasses specializations, will be of most use:"]
    #[doc = "!   - Matrix: Array<double> with only 2 dimensions"]
    #[doc = "!   - ComplexMatrix: Array<std::complex<double>> with only 2 dimensions"]
    #[doc = "!   - boolNDArray: N dimensional Array<bool>"]
    #[doc = "!   - ColumnVector: Array<double> with 1 column"]
    #[doc = "!   - string_vector: Array<std::string> with 1 column"]
    #[doc = "!   - Cell: Array<octave_value>, equivalent to an Octave cell."]
    #[repr(C)]
    #[derive(Debug)]
    pub struct Array<T> {
        pub vtable_: *const Array__bindgen_vtable,
        pub dimensions: root::dim_vector,
        pub rep: *mut root::Array_ArrayRep<T>,
        pub slice_data: *mut T,
        pub slice_len: root::octave_idx_type,
        pub _phantom_0: ::core::marker::PhantomData<::core::cell::UnsafeCell<T>>,
    }
    #[doc = "! The real representation of all arrays."]
    #[repr(C)]
    #[derive(Debug)]
    pub struct Array_ArrayRep<T> {
        pub data: *mut T,
        pub len: root::octave_idx_type,
        pub count: root::octave::refcount<::std::os::raw::c_int>,
        pub _phantom_0: ::core::marker::PhantomData<::core::cell::UnsafeCell<T>>,
    }
    pub type Array_element_type<T> = T;
    pub type Array_value_type<T> = T;
    #[doc = "! Used for operator(), and returned by numel() and size()"]
    #[doc = "! (beware: signed integer)"]
    pub type Array_size_type = root::octave_idx_type;
    pub type Array_crefT = root::ref_param;
    pub type Array_compare_fcn_type = ::core::option::Option<
        unsafe extern "C" fn(arg1: root::ref_param, arg2: root::ref_param) -> bool,
    >;
    extern "C" {
        pub fn octave_ieee_init();
    }
    pub const query_integer_type_registered: bool = false;
    pub type query_integer_type_type = ::std::os::raw::c_void;
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct octave_int_cmp_op {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct octave_int_cmp_op_prom {
        pub _address: u8,
    }
    pub type octave_int_cmp_op_prom_type = u8;
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct octave_int_cmp_op_lt {
        pub _address: u8,
    }
    pub const octave_int_cmp_op_lt_ltval: bool = true;
    pub const octave_int_cmp_op_lt_gtval: bool = false;
    #[test]
    fn bindgen_test_layout_octave_int_cmp_op_lt() {
        assert_eq!(
            ::core::mem::size_of::<octave_int_cmp_op_lt>(),
            1usize,
            concat!("Size of: ", stringify!(octave_int_cmp_op_lt))
        );
        assert_eq!(
            ::core::mem::align_of::<octave_int_cmp_op_lt>(),
            1usize,
            concat!("Alignment of ", stringify!(octave_int_cmp_op_lt))
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct octave_int_cmp_op_le {
        pub _address: u8,
    }
    pub const octave_int_cmp_op_le_ltval: bool = true;
    pub const octave_int_cmp_op_le_gtval: bool = false;
    #[test]
    fn bindgen_test_layout_octave_int_cmp_op_le() {
        assert_eq!(
            ::core::mem::size_of::<octave_int_cmp_op_le>(),
            1usize,
            concat!("Size of: ", stringify!(octave_int_cmp_op_le))
        );
        assert_eq!(
            ::core::mem::align_of::<octave_int_cmp_op_le>(),
            1usize,
            concat!("Alignment of ", stringify!(octave_int_cmp_op_le))
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct octave_int_cmp_op_gt {
        pub _address: u8,
    }
    pub const octave_int_cmp_op_gt_ltval: bool = false;
    pub const octave_int_cmp_op_gt_gtval: bool = true;
    #[test]
    fn bindgen_test_layout_octave_int_cmp_op_gt() {
        assert_eq!(
            ::core::mem::size_of::<octave_int_cmp_op_gt>(),
            1usize,
            concat!("Size of: ", stringify!(octave_int_cmp_op_gt))
        );
        assert_eq!(
            ::core::mem::align_of::<octave_int_cmp_op_gt>(),
            1usize,
            concat!("Alignment of ", stringify!(octave_int_cmp_op_gt))
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct octave_int_cmp_op_ge {
        pub _address: u8,
    }
    pub const octave_int_cmp_op_ge_ltval: bool = false;
    pub const octave_int_cmp_op_ge_gtval: bool = true;
    #[test]
    fn bindgen_test_layout_octave_int_cmp_op_ge() {
        assert_eq!(
            ::core::mem::size_of::<octave_int_cmp_op_ge>(),
            1usize,
            concat!("Size of: ", stringify!(octave_int_cmp_op_ge))
        );
        assert_eq!(
            ::core::mem::align_of::<octave_int_cmp_op_ge>(),
            1usize,
            concat!("Alignment of ", stringify!(octave_int_cmp_op_ge))
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct octave_int_cmp_op_eq {
        pub _address: u8,
    }
    pub const octave_int_cmp_op_eq_ltval: bool = false;
    pub const octave_int_cmp_op_eq_gtval: bool = false;
    #[test]
    fn bindgen_test_layout_octave_int_cmp_op_eq() {
        assert_eq!(
            ::core::mem::size_of::<octave_int_cmp_op_eq>(),
            1usize,
            concat!("Size of: ", stringify!(octave_int_cmp_op_eq))
        );
        assert_eq!(
            ::core::mem::align_of::<octave_int_cmp_op_eq>(),
            1usize,
            concat!("Alignment of ", stringify!(octave_int_cmp_op_eq))
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct octave_int_cmp_op_ne {
        pub _address: u8,
    }
    pub const octave_int_cmp_op_ne_ltval: bool = true;
    pub const octave_int_cmp_op_ne_gtval: bool = true;
    #[test]
    fn bindgen_test_layout_octave_int_cmp_op_ne() {
        assert_eq!(
            ::core::mem::size_of::<octave_int_cmp_op_ne>(),
            1usize,
            concat!("Size of: ", stringify!(octave_int_cmp_op_ne))
        );
        assert_eq!(
            ::core::mem::align_of::<octave_int_cmp_op_ne>(),
            1usize,
            concat!("Alignment of ", stringify!(octave_int_cmp_op_ne))
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct octave_int_cmp_op_ct {
        pub _address: u8,
    }
    pub const octave_int_cmp_op_ct_ltval: bool = true;
    pub const octave_int_cmp_op_ct_gtval: bool = true;
    #[test]
    fn bindgen_test_layout_octave_int_cmp_op_ct() {
        assert_eq!(
            ::core::mem::size_of::<octave_int_cmp_op_ct>(),
            1usize,
            concat!("Size of: ", stringify!(octave_int_cmp_op_ct))
        );
        assert_eq!(
            ::core::mem::align_of::<octave_int_cmp_op_ct>(),
            1usize,
            concat!("Alignment of ", stringify!(octave_int_cmp_op_ct))
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct octave_int_cmp_op_cf {
        pub _address: u8,
    }
    pub const octave_int_cmp_op_cf_ltval: bool = false;
    pub const octave_int_cmp_op_cf_gtval: bool = false;
    #[test]
    fn bindgen_test_layout_octave_int_cmp_op_cf() {
        assert_eq!(
            ::core::mem::size_of::<octave_int_cmp_op_cf>(),
            1usize,
            concat!("Size of: ", stringify!(octave_int_cmp_op_cf))
        );
        assert_eq!(
            ::core::mem::align_of::<octave_int_cmp_op_cf>(),
            1usize,
            concat!("Alignment of ", stringify!(octave_int_cmp_op_cf))
        );
    }
    #[test]
    fn bindgen_test_layout_octave_int_cmp_op() {
        assert_eq!(
            ::core::mem::size_of::<octave_int_cmp_op>(),
            1usize,
            concat!("Size of: ", stringify!(octave_int_cmp_op))
        );
        assert_eq!(
            ::core::mem::align_of::<octave_int_cmp_op>(),
            1usize,
            concat!("Alignment of ", stringify!(octave_int_cmp_op))
        );
    }
    pub type octave_int_cmp_op_uiop_utype = u8;
    pub type octave_int_cmp_op_uiop_stype = u8;
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct octave_int_base {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct octave_int_arith {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct octave_int<T> {
        pub ival: T,
        pub _phantom_0: ::core::marker::PhantomData<::core::cell::UnsafeCell<T>>,
    }
    pub type octave_int_val_type<T> = T;
    #[doc = "! Template for N-dimensional array classes with like-type math operators."]
    #[repr(C)]
    #[derive(Debug)]
    pub struct MArray<T> {
        pub _base: root::Array<T>,
        pub _phantom_0: ::core::marker::PhantomData<::core::cell::UnsafeCell<T>>,
    }
    #[repr(C)]
    pub struct Sparse__bindgen_vtable(::std::os::raw::c_void);
    #[repr(C)]
    #[derive(Debug)]
    pub struct Sparse<T> {
        pub vtable_: *const Sparse__bindgen_vtable,
        pub rep: *mut root::Sparse_SparseRep<T>,
        pub dimensions: root::dim_vector,
        pub _phantom_0: ::core::marker::PhantomData<::core::cell::UnsafeCell<T>>,
    }
    pub type Sparse_element_type<T> = T;
    #[repr(C)]
    #[derive(Debug)]
    pub struct Sparse_SparseRep<T> {
        pub d: *mut T,
        pub r: *mut root::octave_idx_type,
        pub c: *mut root::octave_idx_type,
        pub nzmx: root::octave_idx_type,
        pub nrows: root::octave_idx_type,
        pub ncols: root::octave_idx_type,
        pub count: root::octave::refcount<::std::os::raw::c_int>,
        pub _phantom_0: ::core::marker::PhantomData<::core::cell::UnsafeCell<T>>,
    }
    #[repr(C)]
    #[derive(Debug)]
    pub struct MSparse<T> {
        pub _base: root::Sparse<T>,
